{"responseData": {"feed":{"feedUrl":"http://feeds.soundcloud.com/users/soundcloud:users:4474692/sounds.rss","title":"Comedy Bang Bang","link":"http://www.earwolf.com/show/comedy-bang-bang/","author":"","description":"Comedy Bang Bang is a high-spirited get-together between host Scott Aukerman (“Mr. Show”, Producer of “Between Two Ferns”) and his funny friends! You can expect conversation, music, improv, games, and most importantly plugs.","type":"rss20","entries":[{"title":"351 Sean Clements, Hayes Davenport, Ben Rodgers, Hayley Huntley","link":"https://soundcloud.com/comedybangbang/351-sean-clements-hayes-davenport-ben-rodgers-hayley-huntley","author":"","publishedDate":"Sun, 17 May 2015 21:15:38 -0700","contentSnippet":"Sean Clements and Hayes Davenport of the cult hit podcast Hollywood Handbook are finally making their Comedy Bang Bang debut! ...","content":"\u003cp\u003e\u003cspan\u003eSean Clements and Hayes Davenport of the cult hit podcast Hollywood Handbook are finally making their Comedy Bang Bang debut! Sean \u0026amp; Hayes speak on the good ol’ days of baseball, their upcoming film Spies vs. Spies, and the history of phones. Then, actors Bang Rodgers and Hayes’ daughter Hayley Shields stop by to read Hayes \u0026amp; Sean’s Comedy Bang! Bang! movie script.\u003c/span\u003e\u003c/p\u003e","categories":[]},{"title":"350 Andy Richter, Andy Daly","link":"https://soundcloud.com/comedybangbang/350-andy-richter-andy-daly","author":"","publishedDate":"Sun, 10 May 2015 12:26:56 -0700","contentSnippet":"Comedy legend Andy Richter of Conan is back to celebrate the 350th episode of Comedy Bing! Bong! Andy tells us about his dating ...","content":"\u003cp\u003e\u003cspan\u003eComedy legend Andy Richter of Conan is back to celebrate the 350th episode of Comedy Bing! Bong! Andy tells us about his dating life, how meeting your heroes is sometimes awkward, and the Fast \u0026amp; Furious movies. Then, royal watcher Byron Denniston returns to talk about why he left royal watching only to recently get back into it and does a little royal baby roleplaying with Andy \u0026amp; Scott.\u003c/span\u003e\u003c/p\u003e","categories":[]},{"title":"349 6th Anniv. Paul F. Tompkins, Lauren Lapkus, Thomas Middleditch, Neil Campbell, Mike Hanford, Joe Wengert, Paul Scheer, Erin Whitehead","link":"https://soundcloud.com/comedybangbang/349-6th-anniv-pftlapkusmiddleditchcampbellmike-hanfordjoe-wengertpaul-scheererin-whitehead","author":"","publishedDate":"Mon, 04 May 2015 00:53:36 -0700","contentSnippet":"6 years ago and no score today a comedy podcast was born. My, oh, my how time has flown by! IT’S BEEN 6 years of Comedy Bang! ...","content":"\u003cp\u003e\u003cspan\u003e6 years ago and no score today a comedy podcast was born. My, oh, my how time has flown by! IT’S BEEN 6 years of Comedy Bang! Bang! The Podcast and old friends and new friends stop by to celebrate. Expect to hear from some show favorites like a boss of cakes, a naughty elf, a resurrected Beatle, and a man’s man who might be a duck. But what would a celebration be without some new friends like a wise man who observes and keeps time, a German blast from Scott’s past, a cool dude who is tapped into pop-culture, and a mysterious 11-year-old boy. Join us for this special sexversary!\u003c/span\u003e\u003c/p\u003e","categories":[]},{"title":"348 Cameron Esposito, Paul F. Tompkins, Matt Gourley","link":"https://soundcloud.com/comedybangbang/348-cameron-esposito-paul-f-tompkins-matt-gourley","author":"","publishedDate":"Sun, 26 Apr 2015 23:47:17 -0700","contentSnippet":"Y'all hear 'em sireens? That's right Cameron Esposito of Put Your Hands Together is back along with her new legal guardian ...","content":"\u003cp\u003e\u003cspan\u003eY'all hear 'em sireens? That's right Cameron Esposito of Put Your Hands Together is back along with her new legal guardian vigilante J.W. Stillwater! They'll tell us all about living together, pitching projects in Hollywood, and J.W.'s missing father. Later, pool man to the stars, Jim Chambers comes in to studio to test the pH balance of the waters. However, he looks strangely familiar to J.W. Stillwater. Could this be Professor Stillwater in disguise!? Tune in to find out!\u003c/span\u003e\u003c/p\u003e","categories":[]},{"title":"347 Kevin Pollak, Seth Morris","link":"https://soundcloud.com/comedybangbang/347-kevin-pollak-seth-morris","author":"","publishedDate":"Wed, 22 Apr 2015 20:51:43 -0700","contentSnippet":"Kevin Pollak, director of the new documentary Misery Loves Comedy finally makes his first appearance on today’s emergency ...","content":"\u003cp\u003e\u003cspan\u003eKevin Pollak, director of the new documentary Misery Loves Comedy finally makes his first appearance on today’s emergency B-B-B-ONUS-S-S Comedy Bing Bong! Ever wanted to know why comedians do what they do? What about helpful tips to get out of jury duty? Well, you’ll hear all about that plus some incredible foley work from foley artist Andy Pappage. Also, there might be a special surprise phone call from a certain star of Kroll Show! \u003c/span\u003e\u003c/p\u003e","categories":[]},{"title":"346 Tom Green, Mary Holland, Erin Whitehead","link":"https://soundcloud.com/comedybangbang/346-tom-green-mary-holland-erin-whitehead","author":"","publishedDate":"Sun, 19 Apr 2015 12:25:04 -0700","contentSnippet":"Proud Canadian Tom Green makes his first appearance as wonderful co-host/high school graduate Trabitha Tarteen joins Scott on ...","content":"\u003cp\u003e\u003cspan\u003eProud Canadian Tom Green makes his first appearance as wonderful co-host/high school graduate Trabitha Tarteen joins Scott on this week's Comedy Bing Bong! Tom takes us through the seasons, gives us some great Halloween costume advice, and shares his passion for tech while talking about his interactive web-o-vision show. Then, therapist Gale Burbiglia stops by all the way from Burbank to heal everyone by helping them better acquainted with their inner child.\u003c/span\u003e\u003c/p\u003e","categories":[]},{"title":"345 Kyle Bornheimer, Paul Brittain","link":"https://soundcloud.com/comedybangbang/345-kyle-bornheimer-paul-brittain","author":"","publishedDate":"Sun, 12 Apr 2015 12:42:30 -0700","contentSnippet":"First timer Kyle Bornheimer of the new film The Last Time You Had Fun and SNL alum/return timer Paul Brittain are on today's ...","content":"\u003cp\u003e\u003cspan\u003eFirst timer Kyle Bornheimer of the new film The Last Time You Had Fun and SNL alum/return timer Paul Brittain are on today's Comedy Bing Bong! We get great TV advice and all the deets on Kyle’s movie before Paul answers a knocking door to reveal a new guest by the name of Michael Explosione Jr. from Explosione and Son Trampolines. Prepare yourself to spring into the world of the Explosione family, a world with guaranteed ups and downs.\u003c/span\u003e\u003c/p\u003e","categories":[]},{"title":"344 Ryan Hansen, Jamie Chung, Horatio Sanz, Jocelyn DeBoer, Paul F. Tompkins","link":"https://soundcloud.com/comedybangbang/344-ryan-hansen-jamie-chung-paul-f-tompkins-horatio-sanz-jocelyn-deboer","author":"","publishedDate":"Wed, 08 Apr 2015 19:52:41 -0700","contentSnippet":"Ryan Hansen and Jamie Chung of Hulu's Resident Advisors get it percolatin' on a B-B-B-ONUS-S-S Comedy Bing Bong! They'll tell ...","content":"\u003cp\u003e\u003cspan\u003eRyan Hansen and Jamie Chung of Hulu\u0026#39;s Resident Advisors get it percolatin\u0026#39; on a B-B-B-ONUS-S-S Comedy Bing Bong! They\u0026#39;ll tell us all about the fun they had while creating all these hours of content before The Hooray Show’s Horatio Sanz walks into the studio to tell us about his new venture of managing the career of 1930‘s actress Bitsy Boo-Carmichael. Then, Jarles decides to pop in once again for more of his #ClassicJarles antics. Plus, Bitsy shows off her acting chops as she reads a script alongside Ryan \u0026amp; Jamie for season 2 of Resident Advisors.\u003c/span\u003e\u003c/p\u003e","categories":[]},{"title":"343 Alicia Witt, Jon Gabrus, Brendon Small","link":"https://soundcloud.com/comedybangbang/343-alicia-witt-jon-gabrus-brendon-small","author":"","publishedDate":"Sun, 05 Apr 2015 18:28:52 -0700","contentSnippet":"A real triple threat -- actress, singer-songwriter, and pianist Alicia Witt gets the first timer treatment as Intern Gino ...","content":"\u003cp\u003e\u003cspan\u003eA real triple threat -- actress, singer-songwriter, and pianist Alicia Witt gets the first timer treatment as Intern Gino returns to co-host on today's Comedy Bing Bong! We hear about Alicia’s time as a teenager on the TV show Cybill, the album cover break down of her new record Revisionary History, and how she collaborated with Ben Folds on the record. Then, Victor and Tiny are back to tell us all about their new change of household as well as Victor's dating life.\u003c/span\u003e\u003c/p\u003e","categories":[]},{"title":"342 Thomas Middleditch, Kumail Nanjiani, Martin Starr, Paul F. Tompkins","link":"https://soundcloud.com/comedybangbang/342-thomas-middleditch-kumail-nanjiani-martin-starr-paul-f-tompkins","author":"","publishedDate":"Sun, 29 Mar 2015 21:52:36 -0700","contentSnippet":"The stars of HBO's Silicon Valley, Thomas Middleditch, Kumail Nanjiani, and Martin Starr share some spoilers from both the ...","content":"\u003cp\u003e\u003cspan\u003eThe stars of HBO's Silicon Valley, Thomas Middleditch, Kumail Nanjiani, and Martin Starr share some spoilers from both the first and the upcoming second season season of their show on today’s Comedy Bing! Bong! They also talk about the history of TV before being joined by Jarles, yet another star of Silicon Valley. The guys hunt for treasure, play one of their jam sesh songs, and talk to Silicon Valley super-fan Joey Tortellini. It’s a sweet p-cast you won’t want to miss!\u003c/span\u003e\u003c/p\u003e","categories":[]},{"title":"341 Stars, Claudia O’Doherty, Neil Campbell","link":"https://soundcloud.com/comedybangbang/341-stars-claudia-odoherty-neil-campbell","author":"","publishedDate":"Sun, 22 Mar 2015 22:58:53 -0700","contentSnippet":"The tables are being banged on as lead-singers Torquil \u0026amp; Amy of Stars join Scott on this week’s Comedy Bing! Bong! They’ll ...","content":"\u003cp\u003e\u003cspan\u003eThe tables are being banged on as lead-singers Torquil \u0026amp; Amy of Stars join Scott on this week’s Comedy Bing! Bong! They’ll tell us about the band’s origin story, making each other sing embarrassing lyrics, and play songs off their latest album “No One Is Lost.” Later, Claudia O’Doherty returns to showcase her excellent Kim Cattrall impression on everyone including Hollywood barber Brian Barber.\u003c/span\u003e\u003c/p\u003e","categories":[]},{"title":"340 LIVE from SXSW 2015 II: Tig Notaro, Stephanie Allynne, Mary Holland, Lauren Lapkus, James Adomian","link":"https://soundcloud.com/comedybangbang/340-live-from-sxsw-ii-tig-notaro-stephanie-allynne-mary-holland-lauren-lapkus-james-adomian","author":"","publishedDate":"Thu, 19 Mar 2015 01:19:02 -0700","contentSnippet":"This week's B-B-B-ONUS-S-S Comedy Bing! Bong! was recorded LIVE from the South by Southwest Festival in Austin, Texas with ...","content":"\u003cp\u003e\u003cspan\u003eThis week\u0026#39;s B-B-B-ONUS-S-S Comedy Bing! Bong! was recorded LIVE from the South by Southwest Festival in Austin, Texas with Professor Blastoff\u0026#39;s own Tig Notaro! Tig shares a story with us that is sure to keep Austin weird and tells us about her new Showtime special \u0026quot;Knock Knock, It\u0026#39;s Tig Notaro\u0026quot; before she weighs in on the family issues that small business owners Helen \u0026amp; Hannah Harpie have with their sister Hortense. As they talk it out, radio legend Tom Leykis makes his way onto the stage to tease us on the new app he\u0026#39;s promoting. \u003c/span\u003e\u003c/p\u003e","categories":[]},{"title":"339 LIVE from SXSW 2015: Lauren Lapkus, Colin Hanks, Nick Kroll, Horatio Sanz","link":"https://soundcloud.com/comedybangbang/339-live-from-sxsw-2015-lauren-lapkus-colin-hanks-nick-kroll-horatio-sanz","author":"","publishedDate":"Sun, 15 Mar 2015 22:53:21 -0700","contentSnippet":"339 LIVE from SXSW 2015: Lauren Lapkus, Colin Hanks, Nick Kroll, Horatio Sanz by Comedy Bang Bang","content":"339 LIVE from SXSW 2015: Lauren Lapkus, Colin Hanks, Nick Kroll, Horatio Sanz by Comedy Bang Bang","categories":[]},{"title":"338 Michael Ableson, Paul F. Tompkins, Andy Daly, Lauren Lapkus","link":"https://soundcloud.com/comedybangbang/338-michael-ableson-paul-f-tompkins-andy-daly-lauren-lapkus","author":"","publishedDate":"Sun, 08 Mar 2015 22:59:24 -0700","contentSnippet":"It’s a special co-host edition of Comedy Bing Bong with our favorite German film director Werner Herzog! Werner \u0026amp; Scott ...","content":"\u003cp\u003e\u003cspan\u003eIt’s a special co-host edition of Comedy Bing Bong with our favorite German film director Werner Herzog! Werner \u0026amp; Scott welcome guest of honor Michael Ableson, a NYC corporate litigator AND Origin Story documentary donator to tell us all about being the hero of the banks when suddenly Ho Ho the Naughty Elf squeaks into the studio. They are also joined by well known French actor Jean Claude Pepi to read a Nosferatu script, play a new game called Name French Actors, and to settle the score during Would You Rather?\u003c/span\u003e\u003c/p\u003e","categories":[]},{"title":"337 Weird Al Yankovic, Paul F. Tompkins, Joe Wengert","link":"https://soundcloud.com/comedybangbang/337-weird-al-yankovic-paul-f-tompkins-joe-wengert","author":"","publishedDate":"Sun, 01 Mar 2015 21:00:37 -0800","contentSnippet":"We command thee to listen to music titans “Weird Al” Yankovic \u0026 Lord Andrew Lloyd Webber on today’s Comedy Bing Bong! The Vicar ...","content":"We command thee to listen to music titans “Weird Al” Yankovic \u0026amp; Lord Andrew Lloyd Webber on today’s Comedy Bing Bong! The Vicar of Yanks tells us all about his upcoming (potentially infinite) world tour and Lord Webber finally explains what’s the deal with cats. Then, party starter Doug Doyzoice stops by to talk about his experience as a finalist to take a trip to Mars. It’s truly an episode that is out of this world!","categories":[]},{"title":"336 Harris Wittels, Chelsea Peretti, Adam Scott","link":"https://soundcloud.com/comedybangbang/336-harris-wittels-chelsea-peretti-adam-scott","author":"","publishedDate":"Sun, 22 Feb 2015 22:38:37 -0800","contentSnippet":"4 years ago, maybe the greatest recording in Earwolf history took place. Now, the Farts and Procreation crew aka Harris ...","content":"\u003cp\u003e\u003cspan\u003e4 years ago, maybe the greatest recording in Earwolf history took place. Now, the Farts and Procreation crew aka Harris Wittels, Chelsea Peretti, and Adam Scott return for the fourth time to attempt to recreate the magic. Creak, slam, sit, and chill with the Farts \u0026amp; Pro crew as we hear some gems during Harris’ Foam Corner, an incredible charac from Chelsea, and the hard work (e-mails) that went into making this episode a reality.\u003c/span\u003e\u003c/p\u003e","categories":[]},{"title":"335 Colin Hay, Gillian Jacobs, Paul F. Tompkins","link":"https://soundcloud.com/comedybangbang/335-colin-hay-gillian-jacobs-paul-f-tompkins","author":"","publishedDate":"Sun, 15 Feb 2015 23:47:17 -0800","contentSnippet":"You're cordially invited to attend the wedding of Gillian Jacobs \u0026amp; Garry Marshall on this special episode of Comedy Bing ...","content":"\u003cp\u003e\u003cspan\u003eYou\u0026#39;re cordially invited to attend the wedding of Gillian Jacobs \u0026amp; Garry Marshall on this special episode of Comedy Bing Bong. Master singer-songwriter Colin Hay of Men at Work is playing songs from his new record “Next Year People” to celebrate their love and director Len Wiseman is also here to bear witness on this beautiful occasion. This may possibly be the most important wedding in Hollywood history!\u003c/span\u003e\u003c/p\u003e","categories":[]},{"title":"334 David Cross, James Adomian, Matt Walsh","link":"https://soundcloud.com/comedybangbang/334-david-cross-james-adomian-matt-walsh","author":"","publishedDate":"Wed, 11 Feb 2015 22:36:05 -0800","contentSnippet":"David Cross of Mr. Show brings along James Adomian \u0026amp; Matt Walsh, the stars of his directorial debut Hits on this week's ...","content":"\u003cp\u003e\u003cspan\u003eDavid Cross of Mr. Show brings along James Adomian \u0026amp; Matt Walsh, the stars of his directorial debut Hits on this week\u0026#39;s b-b-b-onus-s-s Comedy Bean Bag! They’ll talk extensively about the inception of the film beginning with the title, their lovers, and moving to Ice Cream Land. Later, Corny Grandpa and Slovenian philosopher Slavoj Zizek stop by to share some of the things the youngsters are putting out into the internet as well as play a game of Would You Rather!\u003c/span\u003e\u003c/p\u003e","categories":[]},{"title":"333 Jack Antonoff, Horatio Sanz, Miriam Tolan","link":"https://soundcloud.com/comedybangbang/333-jack-antonoff-horatio-sanz-miriam-tolan","author":"","publishedDate":"Thu, 05 Feb 2015 23:31:37 -0800","contentSnippet":"Jack Antonoff of fun. \u0026amp; Bleachers finally makes his way onto Comedy Bing Bong for a serious chat about love. Scott \u0026amp; ...","content":"\u003cp\u003e\u003cspan\u003eJack Antonoff of fun. \u0026amp; Bleachers finally makes his way onto Comedy Bing Bong for a serious chat about love. Scott \u0026amp; Jack talk about immortality, marriage, and Jack’s personal 10 commandments. Then, Susan and Jacob Brooks of Pit Stop in Beverly Hills\u003cspan\u003e  \u003c/span\u003ecome into the studio to tell us all about their pit rescue business, their past life as bullies, and the status of their tiger sanctuary. It’s a real flipperidoo of an episode you won’t want to miss!\u003c/span\u003e\u003c/p\u003e","categories":[]},{"title":"332 Kyle Kinane, Matt Braunger, Fran Gillespie, Neil Campbell","link":"https://soundcloud.com/comedybangbang/332-kyle-kinane-matt-braunger-fran-gillespie-neil-campbell","author":"","publishedDate":"Sun, 01 Feb 2015 14:32:57 -0800","contentSnippet":"Two of the world's best comedians and pals from Chicago, Kyle Kinane \u0026amp; Matt Braunger are on today's Comedy Bing Bong! Scott ...","content":"\u003cp\u003e\u003cspan\u003eTwo of the world\u0026#39;s best comedians and pals from Chicago, Kyle Kinane \u0026amp; Matt Braunger are on today\u0026#39;s Comedy Bing Bong! Scott \u0026amp; Matt do some long form improv, Matt tells us all about his new comedy special “Big Dumb Animal,” Kyle teases us with some info on his new comedy special “I Liked His Old Stuff Better,” and we find out what Kyle \u0026amp; Matt’s ultimate plans for the future are. Then, reality show stars Missy and Winsome Prejudice stop by to talk about their very popular reality show as well as compete in a fun game of Riddle Me This!\u003c/span\u003e\u003c/p\u003e","categories":[]},{"title":"331 Patton Oswalt, Lauren Lapkus, Mary Holland","link":"https://soundcloud.com/comedybangbang/331-patton-oswalt-lauren-lapkus-mary-holland","author":"","publishedDate":"Thu, 22 Jan 2015 23:15:34 -0800","contentSnippet":"Comedian extraordinaire Patton Oswalt is back to tell us all about his new book Silver Screen Fiend which goes into his classic ...","content":"\u003cp\u003e\u003cspan\u003eComedian extraordinaire Patton Oswalt is back to tell us all about his new book Silver Screen Fiend which goes into his classic film obsession of the late 90s on today’s Comedy Bing Bong! Patton \u0026amp; Scott talk about the time they improvised a live stage reading of The Day the Clown Cried before a young British schoolboy by the name of Benjamin Susix III wanders into the studio. As they try to figure out why Benjamin is here, soon to be high school graduate Trabitha Tarteen joins Scott \u0026amp; Patton to share which secret superlatives she has been given.\u003c/span\u003e\u003c/p\u003e","categories":[]},{"title":"330 Jim Rash, Horatio Sanz","link":"https://soundcloud.com/comedybangbang/330-jim-rash-horatio-sanz","author":"","publishedDate":"Mon, 19 Jan 2015 00:03:21 -0800","contentSnippet":"Academy award winner Jim Rash joins the first timers club on today’s Comedy Bean Bag! Jim tells us about the upcoming 6th ...","content":"\u003cp\u003eAcademy award winner Jim Rash joins the first timers club on today’s Comedy Bean Bag! Jim tells us about the upcoming 6th season of Community on Yahoo! Screen, potential plot lines involving his character Marquess of Queensberry on Mike Tyson Mysteries, and most importantly, where he keeps his Oscar. Then, our old pal Shelly Driftwood stops by to give us all the details on his new venture selling special vitamins. Finally, everyone becomes closer as friends as they play a game of Would You Rather!\u003c/p\u003e","categories":[]},{"title":"329 Nick Kroll, John Mulaney","link":"https://soundcloud.com/comedybangbang/329-nick-kroll-john-mulaney","author":"","publishedDate":"Sun, 11 Jan 2015 17:05:57 -0800","contentSnippet":"Oh, hello CBB listeners. Nick Kroll of The League \u0026amp; Kroll Show returns to the stuudge to give us all the details on the ...","content":"\u003cp\u003e\u003cspan\u003eOh, hello CBB listeners. Nick Kroll of The League \u0026amp; Kroll Show returns to the stuudge to give us all the details on the final season of Kroll Show as well as take some calls before joining Scott in a new segment called Get To The Gifts. Then, George St Geegland \u0026amp; Gil Faizon of Too Much Tuna fame stop by to tell us about their new book Tuna Head Companion, the SUNY hacks, and share some ‘sclusie news on celebrities who have passed on this past year. It’s the perfect way to start off your hump week!\u003c/span\u003e\u003c/p\u003e","categories":[]},{"title":"328 American Football, Anders Holm, Mike Hanford","link":"https://soundcloud.com/comedybangbang/328-american-football-anders-holm-mike-hanford","author":"","publishedDate":"Thu, 08 Jan 2015 01:25:09 -0800","contentSnippet":"2015 is starting to look like the year of first timers as Anders Holm of Workaholics and Mike, Steve, and Steve of the Rock ‘n’ ...","content":"\u003cp\u003e\u003cspan\u003e2015 is starting to look like the year of first timers as Anders Holm of Workaholics and Mike, Steve, and Steve of the Rock ‘n’ Roll band American Football join Scott for a B-B-B-ONUS-S-S-S episode of Comedy Bing Bong! We’ll hear some amazing acoustic performances from the guys of American Football as well as hear all about the upcoming 5th season of Workaholics. Later, the legendary John Lennon of The Beatles makes a rare appearance to give everyone tips on playing music and to join in on a game of Would You Rather!\u003c/span\u003e\u003c/p\u003e","categories":[]},{"title":"327 Ben Schwartz, Horatio Sanz","link":"https://soundcloud.com/comedybangbang/327-ben-schwartz-horatio-sanz","author":"","publishedDate":"Sun, 04 Jan 2015 17:20:29 -0800","contentSnippet":"House of Pies star Ben Schwartz aka Benny Schwaz \u0026amp; Saturday Night Pies alum Horatio Sanz are back to kick off the new year ...","content":"\u003cp\u003e\u003cspan\u003eHouse of Pies star Ben Schwartz aka Benny Schwaz \u0026amp; Saturday Night Pies alum Horatio Sanz are back to kick off the new year on Comedy Bing Bong! Everyone chats about Scott’s time working at Disneyland, Horatio dressing like Captain Crunch for a gig, and SNL dream casts before Uncle Stoney stops by to tell us all about his new projects. Then, the guys play the first Would You Rather of 2015! The End.\u003c/span\u003e\u003c/p\u003e","categories":[]},{"title":"Best of 2014 Pt 4","link":"https://soundcloud.com/comedybangbang/best-of-2014-pt-4","author":"","publishedDate":"Wed, 31 Dec 2014 16:48:39 -0800","contentSnippet":"The exciting conclusion of the Comedy Bang! Bang! best of 2014 countdown with Paul F. Tompkins is here with numbers three to ...","content":"The exciting conclusion of the Comedy Bang! Bang! best of 2014 countdown with Paul F. Tompkins is here with numbers three to one of the best CBB eps that YOU have chosen! Happy New Year!","categories":[]},{"title":"Best of 2014 Pt 3","link":"https://soundcloud.com/comedybangbang/best-of-2014-pt-3","author":"","publishedDate":"Sun, 28 Dec 2014 21:23:23 -0800","contentSnippet":"It's getting real close to the end with part three of the Comedy Bang! Bang! best of countdown as Scott and special guest Paul ...","content":"\u003cp\u003e\u003cspan\u003eIt's getting real close to the end with part three of the Comedy Bang! Bang! best of countdown as Scott and special guest Paul F. Tompkins get into the meat of the matter and count down numbers seven through four. Sit tight and look out for the final installment!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThis episode is sponsored by \u003ca href\u003d\"http://www.squarespace.com/\"\u003e\u003cspan\u003eSquarespace,\u003c/span\u003e\u003c/a\u003e \u003ca href\u003d\"http://www.audible.com\"\u003eAudible\u003c/a\u003e, and \u003ca href\u003d\"http://www.casper.com/BANGBANG\"\u003eCasper Mattresses\u003c/a\u003e. Use offer code BANGBANG at checkout for some great savings!\u003c/span\u003e\u003c/p\u003e","categories":[]},{"title":"Best of 2014 Pt 2","link":"https://soundcloud.com/comedybangbang/best-of-2014-part-2","author":"","publishedDate":"Wed, 24 Dec 2014 20:27:13 -0800","contentSnippet":"Merry Christmas to you all! The best of Comedy Bang! Bang! countdown 2014 continues with Scott and special guest Paul F. ...","content":"\u003cp\u003eMerry Christmas to you all! The best of Comedy Bang! Bang! countdown 2014 continues with Scott and special guest Paul F. Tompkins as they count down numbers eleven through eight of the best episodes YOU voted for! Come back Monday for Pt 3!\u003c/p\u003e","categories":[]},{"title":"Best of 2014 Pt 1","link":"https://soundcloud.com/comedybangbang/best-of-2014-pt-1","author":"","publishedDate":"Sun, 21 Dec 2014 19:14:01 -0800","contentSnippet":"Say bye bye to another year but say hello hello to the new year with the best of 2014 episode of Comedy Bang! Bang! One of our ...","content":"\u003cp\u003e\u003cspan\u003eSay bye bye to another year but say hello hello to the new year with the best of 2014 episode of Comedy Bang! Bang! One of our faves, Paul F. Tompkins joins Scott to countdown numbers fifteen through twelve of the best CBB eps of 2014 that YOU voted for. Stay tuned for Pt 2 dropping on Christmas day!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThis episode is sponsored by \u003ca href\u003d\"http://www.clubw.com/bangbang\"\u003e\u003cspan\u003eClub W\u003c/span\u003e\u003c/a\u003e, and \u003ca href\u003d\"http://www.bonobos.com\"\u003eBonobos\u003c/a\u003e. Use offer code BANGBANG at checkout for some great savings!\u003c/span\u003e\u003c/p\u003e","categories":[]},{"title":"326 2014 Holiday Spectacular","link":"https://soundcloud.com/comedybangbang/326-2014-holiday-spectacular","author":"","publishedDate":"Sun, 14 Dec 2014 20:07:49 -0800","contentSnippet":"Ho! Ho! Ho! It's the year end holiday episode of Comedy Bean Bag with music from The Both (Aimee Mann \u0026amp; Ted Leo) and guests ...","content":"Ho! Ho! Ho! It\u0026#39;s the year end holiday episode of Comedy Bean Bag with music from The Both (Aimee Mann \u0026amp; Ted Leo) and guests galore! Director of the Underworld series, Len Wiseman is back for the CBB festivities that will include visits from some spooky ghosts, a naughty elf, and much more. Merry Christmas bros!","categories":[]},{"title":"325 Skylar Astin, Rory Scovel, Pamela Murphy, Will Hines","link":"https://soundcloud.com/comedybangbang/325-skylar-astin-rory-scovel-pamela-murphy-will-hines","author":"","publishedDate":"Mon, 08 Dec 2014 01:21:15 -0800","contentSnippet":"Ground Floor stars Skylar Astin \u0026amp; Rory Scovel are two bros that are today’s Comedy Bean Bag! Skylar, Rory, \u0026amp; Scott chat ...","content":"Ground Floor stars Skylar Astin \u0026amp; Rory Scovel are two bros that are today’s Comedy Bean Bag! Skylar, Rory, \u0026amp; Scott chat about the new season of TBS\u0026#39;s Ground Floor, which songs will be in Pitch Perfect 2, and Rory\u0026#39;s future comedy special that is in the works. Then, Scott’s old buddy Jewel’s stops by to try to get their band back together. Finally, librarian Markis Campbell of the Los Feliz Library shows up to tell us a little bit about the Los Feliz literacy drive and share some deep secrets.\r\n\r\n \r\n\r\nDon’t forget to vote now for your favorite episodes for the Best of CBB 2014 right now here: \u003ca href\u003d\"http://earwolf.polldaddy.com/s/best-of-cbb-2014\" rel\u003d\"nofollow\"\u003ehttp://earwolf.polldaddy.com/s/best-of-cbb-2014\u003c/a\u003e!\r\n\r\n \r\n\r\nAlso, pick yourself up the 2014 CBB LIVE Bundle over at the \u003ca href\u003d\"http://store.earwolf.com/store/digital/3840/2014-comedy-bang-bang-live-show-bundle\" rel\u003d\"nofollow\"\u003eEarwolf store\u003c/a\u003e!","categories":[]},{"title":"324 Colin Hanks, Lauren Lapkus, Stephanie Allynne, Mary Holland, Erin Whitehead","link":"https://soundcloud.com/comedybangbang/324-colin-hanks-lauren-lapkus-stephanie-allynne","author":"","publishedDate":"Sat, 29 Nov 2014 18:51:02 -0800","contentSnippet":"Returning champion Colin Hanks of FX's Fargo is here to talk about his humble beginnings on Comedy Bean Bag! Colin tells us all ...","content":"Returning champion Colin Hanks of FX\u0026#39;s Fargo is here to talk about his humble beginnings on Comedy Bean Bag! Colin tells us all about one of his first acting roles on Roswell, the status of his Tower Records documentary, and the record that got him hooked onto music. Then, Marla Charles, Carol Sheldon, Margie Donk, and Pam John arrive to talk about the wonderful Golden Duchess Cruise Lines cruise they recently took and share some fun facts about themselves during a game of Would You Rather!\n\n \n\nDon’t forget to vote now for your favorite episodes for the Best of CBB 2014 right now here: \u003ca href\u003d\"http://earwolf.polldaddy.com/s/best-of-cbb-2014\"\u003ehttp://earwolf.polldaddy.com/s/best-of-cbb-2014\u003c/a\u003e!\n\n \n\nAlso, pick yourself up the 2014 CBB LIVE Bundle over at the \u003ca href\u003d\"http://store.earwolf.com/store/digital/3840/2014-comedy-bang-bang-live-show-bundle\"\u003eEarwolf store\u003c/a\u003e!","categories":[]},{"title":"323 Tears for Fears, Reggie Watts, Paul F. Tompkins","link":"https://soundcloud.com/comedybangbang/323-tears-for-fears-reggie-watts-paul-f-tompkins","author":"","publishedDate":"Mon, 24 Nov 2014 01:02:34 -0800","contentSnippet":"The writers and performers of such iconic pop hits as “Mad World,” “Shout,” and “Everybody Wants To Rule The World,” Tears For ...","content":"The writers and performers of such iconic pop hits as “Mad World,” “Shout,” and “Everybody Wants To Rule The World,” Tears For Fears are in the studio as well as Scott’s old pal Reggie Watts on this week’s Comedy Bing Bong! We’ll hear all about how Curt \u0026amp; Roland used to sing in a church choir, the new re-issue of “Songs from the Big Chair,” the making of the iconic hit “Everybody Wants To Rule The World,” the future for the band, and Reggie gets to ask a very important question. Later, we’ll finally get to find out what’s going on with Cake Boss (Cake Boss!) after his recent run in with the law.\r\n\r\n \r\n\r\nGo get the 2014 CBB LIVE Bundle over at the \u003ca href\u003d\"http://store.earwolf.com/store/digital/3840/2014-comedy-bang-bang-live-show-bundle\" rel\u003d\"nofollow\"\u003eEarwolf store\u003c/a\u003e!\r\n\r\n ","categories":[]},{"title":"322 Chelsea Peretti, Seth Morris","link":"https://soundcloud.com/comedybangbang/322-chelsea-peretti-seth-morris","author":"","publishedDate":"Sun, 16 Nov 2014 23:34:30 -0800","contentSnippet":"One of the greats, Chelsea Peretti of Brooklyn Nine-Nine and Farts and Procreation fame returns to Comedy Bean Bag! Chelsea ...","content":"One of the greats, Chelsea Peretti of Brooklyn Nine-Nine and Farts and Procreation fame returns to Comedy Bean Bag! Chelsea tells us all about her new Netflix special “One of the Greats,” her dad’s reaction to when she got her RZ Cola, and her first LA experience. Then, foley artist Lou Ciello stops by to showcase some of his ASMR skills that made him a YouTube phenomana. Vote now for your favorite episodes for the Best of CBB 2014 right now here: \u003ca href\u003d\"http://earwolf.polldaddy.com/s/best-of-cbb-2014\"\u003ehttp://earwolf.polldaddy.com/s/best-of-cbb-2014\u003c/a\u003e!","categories":[]},{"title":"321 Ana Gasteyer, Jon Gabrus, Mookie Blaiklock","link":"https://soundcloud.com/comedybangbang/321-ana-gasteyer-jon-gabrus-mookie-blaiklock","author":"","publishedDate":"Mon, 10 Nov 2014 00:19:24 -0800","contentSnippet":"SNL Hall of Famer and Suburgatory's Ana Gasteyer joins the first timer club and Intern Gino returns on this week's Comedy Bean ...","content":"SNL Hall of Famer and Suburgatory's Ana Gasteyer joins the first timer club and Intern Gino returns on this week's Comedy Bean Bag! Ana tells us about her Broadway career post SNL, shares what her SNL dream cast would be, and plays a couple of tracks off her new record \"I'm Hip.\" Then, officer Jay Gutwill stops by to warn us and protect us from internet perverts. Plus, everyone shows off their pipes during a game of Riddle Me This!","categories":[]},{"title":"320 Alex Borstein, Brendon Small, Molly Bretthauer","link":"https://soundcloud.com/comedybangbang/320-alex-borstein-brendon-small-molly-bretthauer","author":"","publishedDate":"Sun, 02 Nov 2014 22:27:09 -0800","contentSnippet":"Family Guy \u0026amp; HBO's Getting On star Alex Borstein makes her debut on this week's Comedy Bean Bag! Alex chats about the ...","content":"Family Guy \u0026amp; HBO\u0026#39;s Getting On star Alex Borstein makes her debut on this week\u0026#39;s Comedy Bean Bag! Alex chats about the different Lois Griffin voices she does for the week, her stage show “Star Wars in 10 Minutes,” and getting into her character on Getting On. Then, Victor Diamond \u0026amp; his manager Tiny return to the show to do a scene from Star Wars and talk about their new venture involving heavy set teenagers. Plus, first time guest/educator Miss D. drops by the studio to speak on some of the best exercises that you can do.","categories":[]},{"title":"319 Halloween, Brett Gelman, Jon Daly, Allan McLeod, Nick Wiger, Caroline Anderson","link":"https://soundcloud.com/comedybangbang/319-halloween-brett-gelman-jon-daly-allan-mcleod-nick-wiger-caroline-anderson","author":"","publishedDate":"Wed, 29 Oct 2014 22:59:24 -0700","contentSnippet":"Welp, it appears that Scott's car broke down once again outside a spoOoOoky house on 1122 Boogie Woogie Avenue which can only ...","content":"Welp, it appears that Scott's car broke down once again outside a spoOoOoky house on 1122 Boogie Woogie Avenue which can only mean one thing. Rot Awfulman has again stumbled upon the Werewolf Studios and is in the presence of the ghoulish Beuford and Messmore le Barron, the innkeepers of Suicide House! Scott must choose the way he will die but not before Ghost Boy re-appears to frighten the only way a young ghost boy can. But wait, a knock on the door reveals Leo Carpazzi and his granddaughter Scaroline who debut a new song by the name of Spooky Orgy. Will Scott meet his end? WIll Leo’s new song have anything to do with his previous song Monster Fuck or Monster Fuck Pt. 2? Who will prevail in the terrifying Freestyle Battle? You’ll have to listen to Comedy Fang Fang to find out!","categories":[]},{"title":"318 Wyatt Cenac, Matt Besser, Jocelyn DeBoer","link":"https://soundcloud.com/comedybangbang/318-wyatt-cenac-matt-besser-jocelyn-deboer","author":"","publishedDate":"Sun, 26 Oct 2014 23:34:04 -0700","contentSnippet":"318 Wyatt Cenac, Matt Besser, Jocelyn DeBoer by Comedy Bang Bang","content":"318 Wyatt Cenac, Matt Besser, Jocelyn DeBoer by Comedy Bang Bang","categories":[]},{"title":"317 Natasha Lyonne, Paul F. Tompkins, Mary Holland","link":"https://soundcloud.com/comedybangbang/317-natasha-lyonne-paul-f-tompkins-mary-holland","author":"","publishedDate":"Mon, 20 Oct 2014 00:16:48 -0700","contentSnippet":"317 Natasha Lyonne, Paul F. Tompkins, Mary Holland by Comedy Bang Bang","content":"317 Natasha Lyonne, Paul F. Tompkins, Mary Holland by Comedy Bang Bang","categories":[]},{"title":"316 Dane Cook, Reggie Watts, Neil Campbell","link":"https://soundcloud.com/comedybangbang/316-dane-cook-reggie-watts-neil-campbell","author":"","publishedDate":"Wed, 15 Oct 2014 18:58:59 -0700","contentSnippet":"Dane Cook and Reggie Watts dig deep to talk comedy on this week's B-B-B-BONUS Comedy Bang Bang! Scott, Reggie and Dane share ...","content":"Dane Cook and Reggie Watts dig deep to talk comedy on this week\u0026#39;s B-B-B-BONUS Comedy Bang Bang! Scott, Reggie and Dane share their excitement for the mid-season premiere of season three of Comedy Bang Bang: The TV series, which premieres on IFC on Friday, October 17th \u0026amp; Dane’s new stand-up special Troublemaker which premieres on Showtime on Friday, October 17th as well by sharing stories from the set of CBB. Troubled teen Rick Faber also returns to update us on some of the immature behavior he has been doing toward nerds before going head to head with Dane \u0026amp; Reggie in a dang game of Would You Rather!","categories":[]},{"title":"315 Ken Marino, Casey Wilson, Joe Wengert","link":"https://soundcloud.com/comedybangbang/315-ken-marino-casey-wilson-joe-wengert","author":"","publishedDate":"Sat, 11 Oct 2014 19:12:23 -0700","contentSnippet":"Ken Marino \u0026amp; Casey Wilson of NBC’s Marry Me sing their hearts out on this week’s Comedy Bean Bag! After giving us an oral ...","content":"Ken Marino \u0026amp; Casey Wilson of NBC’s Marry Me sing their hearts out on this week’s Comedy Bean Bag! After giving us an oral history of their new show Marry Me, Ken \u0026amp; Casey collabo once more as they create a brand new going to commercial theme song. Then, Dr. Jerry Pensacola stops by to explain what steps you must take to get your blood singing. Plus, everyone breaks the mold during a game of Riddle Me This!","categories":[]},{"title":"314 Cameron Esposito, Paul F. Tompkins","link":"https://soundcloud.com/comedybangbang/314-cameron-esposito-paul-f-tompkins","author":"","publishedDate":"Sun, 05 Oct 2014 16:40:36 -0700","contentSnippet":"Comedian extraordinaire Cameron Esposito of Put Your Hands Together returns to tell us all about her new stand-up album Same ...","content":"Comedian extraordinaire Cameron Esposito of Put Your Hands Together returns to tell us all about her new stand-up album Same Sex Symbol on today\u0026#39;s Comedy Bing Bong! Cameron \u0026amp; Scott chat about eradicating men from the Earth, Portland food, and Cameron\u0026#39;s old job as a circus ringmaster when suddenly vigilante crime fighter J.W. Stillwater emerges from the shadows. J.W. enlists Cameron \u0026amp; Scott on the case of the continuing California drought by participating in his quiz called \u0026quot;Y\u0026#39;all Heard Any of These Names Before?\u0026quot;","categories":[]},{"title":"313 Ben Schwartz, Horatio Sanz, Paul Banks","link":"https://soundcloud.com/comedybangbang/313-ben-schwartz-horatio-sanz-paul-banks","author":"","publishedDate":"Sun, 28 Sep 2014 15:55:04 -0700","contentSnippet":"Ben Schwartz aka Benny Schwaz of House of Pies is here along with musical guest Paul Banks of Interpol on this week’s musical ...","content":"Ben Schwartz aka Benny Schwaz of House of Pies is here along with musical guest Paul Banks of Interpol on this week’s musical episode of Comedy Bing Bong! They talk about Interpol’s new album El Pintor and good heckles for bands before sound proofer Dante jumps into the conversation to show off his vocal chops. Later, Aaron Neville returns to challenge everyone to the Gumbo Challenge, sing some covers of commercials, and share some Don Pardo stories. Plus, Aaron shares some special photos with everyone during a game of Would You Rather!","categories":[]},{"title":"312 Andy Samberg, Lauren Lapkus","link":"https://soundcloud.com/comedybangbang/312-andy-samberg-lauren-lapkus","author":"","publishedDate":"Sun, 21 Sep 2014 19:48:16 -0700","contentSnippet":"Fall TV premieres are back baby! Brooklyn Nine-Nine star Andy Samberg returns to Comedy Bean Bag along with Scott’s nephew Todd ...","content":"Fall TV premieres are back baby! Brooklyn Nine-Nine star Andy Samberg returns to Comedy Bean Bag along with Scott’s nephew Todd to talk all things Hollywood, Todd \u0026amp; Scott’s potential sitcom, the new season of B-99, and eating pee popsicles. Then, a game of What Am I Thinking? is played before attempting to memorize the classic Hollywood Facts theme song. Later, Andy embodies Fallon as he gives Scott the complete Tonight Show experience and fun times are had during a game of Would You Rather!","categories":[]},{"title":"311 Joe Lo Truglio, Beth Dover","link":"https://soundcloud.com/comedybangbang/311-joe-lo-truglio-beth-dover","author":"","publishedDate":"Wed, 17 Sep 2014 16:41:31 -0700","contentSnippet":"Brooklyn Nine-Nine star \u0026amp; The State alumni Joe Lo Truglio is back on a bonus Comedy Bean Bag! Scott \u0026amp; Joe bro out over ...","content":"Brooklyn Nine-Nine star \u0026amp; The State alumni Joe Lo Truglio is back on a bonus Comedy Bean Bag! Scott \u0026amp; Joe bro out over giraffes, role models, and Denny’s. Joe then shares the spotlight as he and Scott help housewife Saman Thughgh with her plan to land a reality TV show by doing a little roleplaying. Finally, a romance between Joe \u0026amp; Samam unravels itself during a game of Would You Rather!","categories":[]},{"title":"310 Kevin Allison, Pamela Murphy, John Gemberling","link":"https://soundcloud.com/comedybangbang/310-kevin-allison-pamela-murphy-john-gemberling","author":"","publishedDate":"Sun, 14 Sep 2014 15:13:46 -0700","contentSnippet":"WARNING: Kevin Allison of the groundbreaking sketch comedy troupe The State \u0026amp; the RISK! podcast joins the first timer club ...","content":"WARNING: Kevin Allison of the groundbreaking sketch comedy troupe The State \u0026amp; the RISK! podcast joins the first timer club on today\u0026#39;s Comedy Bing Bong! Kevin lets us know the deets surrounding the upcoming The State reunion at Festival Supreme, the origin of his RISK! podcast, and how he became a faculty member at a Kink camp. Also joining us for the first time is entrepreneur Bridgette Murphy who tells us all about her Irish gift shop \u0026quot;Bridgette\u0026#39;s Irish Gifts\u0026quot; \u0026amp; a special gift that Scott received known as HP-DP-69B aka the Hewlett-Packard Sex Robot. Plus, they all become familiar with Riddle Me This!\n\n \n\nThis episode is sponsored by:\n\n \n\nNatureBox: Nutritious snacks straight to your door. Start your membership now by going to \u003ca href\u003d\"http://www.naturebox.com/bangbang\"\u003ewww.naturebox.com/bangbang\u003c/a\u003e and get a free sample box.\n\n \n\n \n\nR\u0026amp;R Games: Time’s Up by R\u0026amp;R Games is “the funniest game ever invented,” according to experts at BoardGameGeek. Go to \u003ca href\u003d\"http://www.rnrgames.com\"\u003ewww.rnrgames.com\u003c/a\u003e and use promo code BANGBANG for 20% off.\n\n \n\n \n\nPlated: Cook up delicious meals in your own kitchen. Go to \u003ca href\u003d\"http://www.plated.com\"\u003ewww.plated.com\u003c/a\u003e and use the code BANGBANG at checkout for two free plates with your first purchase.","categories":[]},{"title":"309 Nick Kroll, Jimmy Pardo, Claudia O'Doherty","link":"https://soundcloud.com/comedybangbang/309-nick-kroll-jimmy-pardo-claudia-odoherty","author":"","publishedDate":"Sun, 07 Sep 2014 19:33:18 -0700","contentSnippet":"Happy National Anthem to You! Kroll Show's Nick Kroll \u0026amp; Never Not Funny's Jimmy Pardo are here to chat about the legacy of ...","content":"Happy National Anthem to You! Kroll Show\u0026#39;s Nick Kroll \u0026amp; Never Not Funny\u0026#39;s Jimmy Pardo are here to chat about the legacy of Don Pardo, Nick\u0026#39;s entourage, and their favorite Ghostbuster songs on this week\u0026#39;s Comedy Bean Bag! Later, Claudia O\u0026#39;Doherty returns from Australia as a winner of yet another competition all thanks to her new book \u0026quot;Daze of Thunder.\u0026quot; Finally, Australian actor R. Shrift makes a surprise visit to tell us about his many TV shows and gives us a preview of his podcasts.","categories":[]},{"title":"308 Matt Gourley, Mark McConville, Jeremy Carter, Paul F. Tompkins: Superego","link":"https://soundcloud.com/comedybangbang/308-matt-gourley-mark-mcconville-jeremy-carter-paul-f-tompkins-superego","author":"","publishedDate":"Sun, 31 Aug 2014 20:48:37 -0700","contentSnippet":"You're in luck this Labor Day because Matt Gourley, Mark McConville, Jeremy Carter, and Paul F. Tompkins of the Superego ...","content":"You\u0026#39;re in luck this Labor Day because Matt Gourley, Mark McConville, Jeremy Carter, and Paul F. Tompkins of the Superego podcast are all here to celebrate their new 4th season! What is the origin story behind Superego? What lead to PFT joining the group recently? What will happen when Reverend Robert Parsimony, the ghost of H.R. Giger, nationally-syndicated food personality Bryson Tyson, and young boy/Spiderman 2 superfan Trevor meet together in one room? Tune in and find out!\n\n \n\nMake sure to go to \u003ca href\u003d\"http://www.gosuperego.com\"\u003ewww.gosuperego.com\u003c/a\u003e to download the season 4 premiere episode of Superego!","categories":[]},{"title":"307 Tenacious D, Lauren Lapkus, Joe Wengert","link":"https://soundcloud.com/comedybangbang/307-tenacious-d-lauren-lapkus-joe-wengert","author":"","publishedDate":"Mon, 25 Aug 2014 00:15:08 -0700","contentSnippet":"The masters of their craft, Jack Black and Kyle Gass of Tenacious D join the first timers club on this week's Comedy Bing Bong! ...","content":"The masters of their craft, Jack Black and Kyle Gass of Tenacious D join the first timers club on this week's Comedy Bing Bong! They talk about their life expectancy, hanging out in the Mr. Show days, and give us a 'sclusy regarding the spooky themed 2nd Annual Festival Supreme. Then, returning champ Regina Crimp is back to tell us about branching out into singing covers of other theme songs besides America's Funniest Home Videos and collabos with the D. Plus, Russ, CEO for ROSS Dress for Less drops by to share all the details about the new back to school sale at ROSS. That’s not all, The D perform some jingles for us live!","categories":[]},{"title":"306 Paul Rust, Harris Wittels, Michael Cassady, Don't Stop Or We'll Die","link":"https://soundcloud.com/comedybangbang/306-paul-rust-harris-wittels-michael-cassady-dont-stop-or-well-die","author":"","publishedDate":"Thu, 21 Aug 2014 00:49:04 -0700","contentSnippet":"Don't ever stop listening to this podcast or Paul Rust, Harris Wittels, and Michael Cassady from our favorite comedy-pop ...","content":"Don't ever stop listening to this podcast or Paul Rust, Harris Wittels, and Michael Cassady from our favorite comedy-pop crossover act Don't Stop or We'll Die will die from being unable to make your sides hurt from laughter here on a bonus Kobe Beef Bang Bang! We'll enter Harris' Foam Corner for some hot new foam, learn all about Paul's love for chemicals, and hear the boys play tracks off their new full length album \"Gorgeous.\" Plus, Harris breaks out his British character and Jay Leno stops by during a game of Riddle Me This! Bye!","categories":[]},{"title":"305 Howard Kremer, Kulap Vilaysack, Jon Gabrus","link":"https://soundcloud.com/comedybangbang/305-howard-kremer-kulap-vilaysack-jon-gabrus","author":"","publishedDate":"Sun, 17 Aug 2014 01:25:50 -0700","contentSnippet":"305 Howard Kremer, Kulap Vilaysack, Jon Gabrus by Comedy Bang Bang","content":"305 Howard Kremer, Kulap Vilaysack, Jon Gabrus by Comedy Bang Bang","categories":[]},{"title":"304 Jessica St. Clair, Lennon Parham, Lauren Lapkus, Jason Mantzoukas, Brian Huskey, Melissa Rauch, Andy Daly","link":"https://soundcloud.com/comedybangbang/304-jessica-st-clairlennon-parhamlauren-lapkusjason-mantzoukasbrian-huskeyandy-dalymelissa-r","author":"","publishedDate":"Sun, 10 Aug 2014 23:04:19 -0700","contentSnippet":"WOMP IT UP! LIVE from high above the Log flume ride in Six Flags Magic Mountain in Valencia, California, it's Marissa Wompler's ...","content":"WOMP IT UP! LIVE from high above the Log flume ride in Six Flags Magic Mountain in Valencia, California, it's Marissa Wompler's Birthday Party Womptacular with Miss Listler, Marissa's step dad Dr. Seth Wompler, Eric \"Gutterballs\" Gutterman, and possibly old friends, new friends, and frenemies. Will Traci Reardon and Marissa become friends? Is Danielle Bartiromo a ghost? What sort of birthday advice will Marissa's mentor Don DiMello have in store for her? Join us above the Log flume and don’t forget to Womp up the Jamz!","categories":[]},{"title":"303 Paul F. Tompkins, Loudon Wainwright III","link":"https://soundcloud.com/comedybangbang/303-paul-f-tompkins-loudon-wainwright-iii","author":"","publishedDate":"Sun, 03 Aug 2014 15:57:49 -0700","contentSnippet":"Need an experience to keep you from puttering around your home? Well, this week’s episode has it all including a rare ...","content":"Need an experience to keep you from puttering around your home? Well, this week’s episode has it all including a rare appearance from CBB favorite Paul F. Tompkins and returning champ/singer-songwriter Loudon Wainwright III! We’re treated to live songs performed by Loudon in celebration of his upcoming new record \u003ci\u003eHaven’t Got The Blues (Yet) \u003c/i\u003eand\u003ci\u003e \u003c/i\u003eLord Andrew Lloyd Webber stops by to tell us all about rebooting Cats with rap songs. Plus, we get a visit from our old pal Buddy Valastro aka the Cake Boss! (Cake Boss!)","categories":[]},{"title":"302 Mary Lynn Rajskub, Eddie Pepitone, Twin Shadow","link":"https://soundcloud.com/comedybangbang/302-mary-lynn-rajskub-eddie-pepitone-twin-shadow","author":"","publishedDate":"Wed, 30 Jul 2014 13:49:50 -0700","contentSnippet":"302 Mary Lynn Rajskub, Eddie Pepitone, Twin Shadow by Comedy Bang Bang","content":"302 Mary Lynn Rajskub, Eddie Pepitone, Twin Shadow by Comedy Bang Bang","categories":[]},{"title":"301 Jonah Ray, Kumail Nanjiani, Brendon Small","link":"https://soundcloud.com/comedybangbang/301-jonah-ray-kumail-nanjiani-brendon-small","author":"","publishedDate":"Sun, 27 Jul 2014 11:50:53 -0700","contentSnippet":"301 Jonah Ray, Kumail Nanjiani, Brendon Small by Comedy Bang Bang","content":"301 Jonah Ray, Kumail Nanjiani, Brendon Small by Comedy Bang Bang","categories":[]},{"title":"300 Jason Mantzoukas, Andy Daly","link":"https://soundcloud.com/comedybangbang/300-jason-mantzoukas-andy-daly","author":"","publishedDate":"Sun, 20 Jul 2014 18:30:45 -0700","contentSnippet":"300 Jason Mantzoukas, Andy Daly by Comedy Bang Bang","content":"300 Jason Mantzoukas, Andy Daly by Comedy Bang Bang","categories":[]},{"title":"299 Weird Al Yankovic, Claudia O'Doherty","link":"https://soundcloud.com/comedybangbang/299-weird-al-yankovic-claudia-o-doherty","author":"","publishedDate":"Mon, 14 Jul 2014 19:10:15 -0700","contentSnippet":"Returning champion and the titular “Weird Al” Yankovic of the new album Mandatory Fun is here on this week’s very special ...","content":"Returning champion and the titular “Weird Al” Yankovic of the new album \u003ca href\u003d\"https://itunes.apple.com/us/album/mandatory-fun/id891836396\"\u003e\u003ci\u003eMandatory Fun\u003c/i\u003e\u003c/a\u003e is here on this week’s very special Tuesday episode of Comedy Bang! Bang! which is a mandatory listen! “Weird Al” gives us a taste of his new album, explains what his process is like when writing a parody song, and tells us about his #8Videos8Days project. Then, a newcomer to the show who is a former internet troll \u0026amp; current contest winner Claudia O’Doherty drops by to talk about her trip to America all the way from Australia. Go pick up “Weird Al” Yankovic’s new album \u003ca href\u003d\"https://itunes.apple.com/us/album/mandatory-fun/id891836396\"\u003e\u003ci\u003eMandatory Fun\u003c/i\u003e \u003c/a\u003ewherever music is sold!\n\n \n\nThis episode is sponsored by:\n\nAudible: Go to \u003ca href\u003d\"http://www.audible.com/bangbang\"\u003ewww.audible.com/bangbang\u003c/a\u003e for a free audio book and 30 day free trial.\n\n \n\n \n\nLoot Crate: A subscription service for geeks and gamers. Get 10% off any subscription when going to \u003ca href\u003d\"http://www.lootcrate.com/bangbang\"\u003ewww.lootcrate.com/bangbang\u003c/a\u003e.\n\n \n\n \n\nCheapOair.com: The fastest way to compare and book cheap flights. Use promo code BANG to save even more on your trip.\n\n \n\n \n\nLynda.com: Helping you learn and keep you up to date on your computer’s hardware. Go to \u003ca href\u003d\"http://www.lynda.com/bangbang\"\u003ewww.lynda.com/bangbang\u003c/a\u003e to save.","categories":[]},{"title":"298 Paul Scheer, Dannah Phirman, Danielle Schneider, Tymberlee Hill, Andrea Savage","link":"https://soundcloud.com/comedybangbang/298-paul-scheer-the-hotwives-of-orlando","author":"","publishedDate":"Sat, 05 Jul 2014 21:10:22 -0700","contentSnippet":"Celebrity Paul Scheer of The League, NTSF:SD:SUV, and How Did This Get Made? fame always has always had his eye on the next big ...","content":"Celebrity Paul Scheer of The League, NTSF:SD:SUV, and How Did This Get Made? fame always has always had his eye on the next big thing on television. This time around he doesn’t disappoint as he brought along Shauna, Phe Phe, Veronica, and Allie of the new hit Hulu series The Hotwives of Orlando. Personal businesses, sex tapes, Muppet impressions. These hotwives have it all! So tune in to get to know these hotwives a little better as well as to hear them go head to head in a game of Would You Rather!\n\n \n\nDon’t miss the premiere of The Hotwives of Orlando on July 15th on \u003ca href\u003d\"http://www.hulu.com\"\u003ewww.hulu.com\u003c/a\u003e!\n\n \n\nThis episode is sponsored by:\n\n \n\n\u003ca href\u003d\"http://www.bonobos.com/\"\u003eBonobos.com\u003c/a\u003e: Use offer code BANGBANG to get 20% off your first purchase.\n\n \n\nLoot Crate: A subscription service for geeks and gamers. Get 10% off any subscription when going to \u003ca href\u003d\"http://www.lootcrate.com/bangbang\"\u003ewww.lootcrate.com/bangbang\u003c/a\u003e.\n\n \n\nCheapOair.com: The fastest way to compare and book cheap flights. Use promo code BANG to save even more on your trip.","categories":[]},{"title":"297 Nathan Fielder, Joe Wengert, James Adomian","link":"https://soundcloud.com/comedybangbang/297-nathan-fielder-joe-wengert-james-adomian","author":"","publishedDate":"Sun, 29 Jun 2014 10:11:27 -0700","contentSnippet":"297 Nathan Fielder, Joe Wengert, James Adomian by Comedy Bang Bang","content":"297 Nathan Fielder, Joe Wengert, James Adomian by Comedy Bang Bang","categories":[]},{"title":"296 David Wain, Michael Showalter, Neil Campbell","link":"https://soundcloud.com/comedybangbang/296-david-wain-michael-showalter-neil-campbell","author":"","publishedDate":"Mon, 23 Jun 2014 00:01:27 -0700","contentSnippet":"296 David Wain, Michael Showalter, Neil Campbell by Comedy Bang Bang","content":"296 David Wain, Michael Showalter, Neil Campbell by Comedy Bang Bang","categories":[]},{"title":"295 Alex Anfanger, Dan Schimpf, Lauren Lapkus","link":"https://soundcloud.com/comedybangbang/295-alex-anfanger-dan-schimpf-lauren-lapkus","author":"","publishedDate":"Wed, 18 Jun 2014 18:08:42 -0700","contentSnippet":"295 Alex Anfanger, Dan Schimpf, Lauren Lapkus by Comedy Bang Bang","content":"295 Alex Anfanger, Dan Schimpf, Lauren Lapkus by Comedy Bang Bang","categories":[]},{"title":"294 Ian Edwards, Brendon Small, Jessica St. Clair","link":"https://soundcloud.com/comedybangbang/294-ian-edwards-brendon-small-jessica-st-clair","author":"","publishedDate":"Sat, 14 Jun 2014 13:50:01 -0700","contentSnippet":"294 Ian Edwards, Brendon Small, Jessica St. Clair by Comedy Bang Bang","content":"294 Ian Edwards, Brendon Small, Jessica St. Clair by Comedy Bang Bang","categories":[]},{"title":"293 Phil Lord, Chris Miller, Jon Gabrus, Eugene Cordero","link":"https://soundcloud.com/comedybangbang/293-phil-lord-chris-miller-jon-gabrus-eugene-cordero","author":"","publishedDate":"Wed, 11 Jun 2014 15:14:22 -0700","contentSnippet":"293 Phil Lord, Chris Miller, Jon Gabrus, Eugene Cordero by Comedy Bang Bang","content":"293 Phil Lord, Chris Miller, Jon Gabrus, Eugene Cordero by Comedy Bang Bang","categories":[]},{"title":"292 Jenny Slate, Merrill Garbus, Jon Daly","link":"https://soundcloud.com/comedybangbang/292-jenny-slate-merrill-garbus-jon-daly","author":"","publishedDate":"Sun, 08 Jun 2014 11:56:54 -0700","contentSnippet":"292 Jenny Slate, Merrill Garbus, Jon Daly by Comedy Bang Bang","content":"292 Jenny Slate, Merrill Garbus, Jon Daly by Comedy Bang Bang","categories":[]},{"title":"291 Bob Odenkirk, Adam Resnick, Neil Casey, Fran Gillespie","link":"https://soundcloud.com/comedybangbang/291-bob-odenkirk-adam-resnick-neil-casey-fran-gillespie","author":"","publishedDate":"Wed, 04 Jun 2014 17:04:30 -0700","contentSnippet":"291 Bob Odenkirk, Adam Resnick, Neil Casey, Fran Gillespie by Comedy Bang Bang","content":"291 Bob Odenkirk, Adam Resnick, Neil Casey, Fran Gillespie by Comedy Bang Bang","categories":[]},{"title":"290 Todd Glass, James Adomian","link":"https://soundcloud.com/comedybangbang/290-todd-glass-james-adomian","author":"","publishedDate":"Sun, 01 Jun 2014 10:36:44 -0700","contentSnippet":"290 Todd Glass, James Adomian by Comedy Bang Bang","content":"290 Todd Glass, James Adomian by Comedy Bang Bang","categories":[]},{"title":"289 Paul F. Tompkins, Matt Gourley","link":"https://soundcloud.com/comedybangbang/289-paul-f-tompkins-matt-gourley","author":"","publishedDate":"Sun, 25 May 2014 12:11:07 -0700","contentSnippet":"289 Paul F. Tompkins, Matt Gourley by Comedy Bang Bang","content":"289 Paul F. Tompkins, Matt Gourley by Comedy Bang Bang","categories":[]},{"title":"288 The Sklar Brothers, Horatio Sanz","link":"https://soundcloud.com/comedybangbang/288-the-sklar-brothers-horatio-sanz","author":"","publishedDate":"Wed, 21 May 2014 13:56:07 -0700","contentSnippet":"288 The Sklar Brothers, Horatio Sanz by Comedy Bang Bang","content":"288 The Sklar Brothers, Horatio Sanz by Comedy Bang Bang","categories":[]},{"title":"287 Shane Torres, Lauren Lapkus","link":"https://soundcloud.com/comedybangbang/287-shane-torres-lauren-lapkus","author":"","publishedDate":"Sun, 18 May 2014 13:56:59 -0700","contentSnippet":"287 Shane Torres, Lauren Lapkus by Comedy Bang Bang","content":"287 Shane Torres, Lauren Lapkus by Comedy Bang Bang","categories":[]},{"title":"286 Bobby Moynihan, Paul F. Tompkins","link":"https://soundcloud.com/comedybangbang/286-bobby-moynihan-paul-f-tompkins","author":"","publishedDate":"Sun, 11 May 2014 13:46:33 -0700","contentSnippet":"286 Bobby Moynihan, Paul F. Tompkins by Comedy Bang Bang","content":"286 Bobby Moynihan, Paul F. Tompkins by Comedy Bang Bang","categories":[]},{"title":"285 Ben Schwartz","link":"https://soundcloud.com/comedybangbang/285-ben-schwartz","author":"","publishedDate":"Wed, 07 May 2014 18:10:12 -0700","contentSnippet":"285 Ben Schwartz by Comedy Bang Bang","content":"285 Ben Schwartz by Comedy Bang Bang","categories":[]},{"title":"284 The Thrilling Adventure Hour","link":"https://soundcloud.com/comedybangbang/284-the-thrilling-adventure-hour","author":"","publishedDate":"Mon, 05 May 2014 00:16:35 -0700","contentSnippet":"284 The Thrilling Adventure Hour by Comedy Bang Bang","content":"284 The Thrilling Adventure Hour by Comedy Bang Bang","categories":[]},{"title":"283 Jessica St. Clair,Lennon Parham,Jason Mantzoukas,Lauren Lapkus,Matt Besser,PFT,Paul R,Neil C","link":"https://soundcloud.com/comedybangbang/283-jessica-st-clairlennon-parhamjason-mantzoukaslauren-lapkusmatt-besserpftpaul-rneil-c","author":"","publishedDate":"Sun, 27 Apr 2014 12:46:15 -0700","contentSnippet":"283 Jessica St. Clair,Lennon Parham,Jason Mantzoukas,Lauren Lapkus,Matt Besser,PFT,Paul R,Neil C by Comedy Bang Bang","content":"283 Jessica St. Clair,Lennon Parham,Jason Mantzoukas,Lauren Lapkus,Matt Besser,PFT,Paul R,Neil C by Comedy Bang Bang","categories":[]},{"title":"282 Jessica St. Clair, Lennon Parham","link":"https://soundcloud.com/comedybangbang/282-jessica-st-clair-lennon-parham","author":"","publishedDate":"Sat, 19 Apr 2014 14:40:31 -0700","contentSnippet":"282 Jessica St. Clair, Lennon Parham by Comedy Bang Bang","content":"282 Jessica St. Clair, Lennon Parham by Comedy Bang Bang","categories":[]},{"title":"281 Matt Walsh, Tim Simons","link":"https://soundcloud.com/comedybangbang/281-matt-walsh-tim-simons","author":"","publishedDate":"Sun, 13 Apr 2014 20:44:42 -0700","contentSnippet":"281 Matt Walsh, Tim Simons by Comedy Bang Bang","content":"281 Matt Walsh, Tim Simons by Comedy Bang Bang","categories":[]},{"title":"280 \"Weird Al\" Yankovic, Paul F. Tompkins","link":"https://soundcloud.com/comedybangbang/280-weird-al-yankovic-paul-f","author":"","publishedDate":"Sun, 06 Apr 2014 14:20:31 -0700","contentSnippet":"280 \"Weird Al\" Yankovic, Paul F. Tompkins by Comedy Bang Bang","content":"280 \"Weird Al\" Yankovic, Paul F. Tompkins by Comedy Bang Bang","categories":[]},{"title":"279 Patton Oswalt, Lauren Lapkus, Will Hines","link":"https://soundcloud.com/comedybangbang/279-patton-oswalt-lauren","author":"","publishedDate":"Sun, 30 Mar 2014 19:30:32 -0700","contentSnippet":"279 Patton Oswalt, Lauren Lapkus, Will Hines by Comedy Bang Bang","content":"279 Patton Oswalt, Lauren Lapkus, Will Hines by Comedy Bang Bang","categories":[]},{"title":"278 Old 97's, Matt Berninger, James Adomian","link":"https://soundcloud.com/comedybangbang/278-old-97s-matt-berninger","author":"","publishedDate":"Mon, 24 Mar 2014 01:04:56 -0700","contentSnippet":"278 Old 97's, Matt Berninger, James Adomian by Comedy Bang Bang","content":"278 Old 97's, Matt Berninger, James Adomian by Comedy Bang Bang","categories":[]},{"title":"277 Chelsea Peretti, Paul Rust, Neil Campbell","link":"https://soundcloud.com/comedybangbang/277-chelsea-peretti-paul-rust","author":"","publishedDate":"Sun, 16 Mar 2014 00:21:40 -0700","contentSnippet":"277 Chelsea Peretti, Paul Rust, Neil Campbell by Comedy Bang Bang","content":"277 Chelsea Peretti, Paul Rust, Neil Campbell by Comedy Bang Bang","categories":[]},{"title":"276 LIVE from SXSW 2014 II; Matt Braunger, Matt Besser, Jon Gabrus","link":"https://soundcloud.com/comedybangbang/276-live-from-sxsw-2014-ii","author":"","publishedDate":"Tue, 11 Mar 2014 14:00:59 -0700","contentSnippet":"276 LIVE from SXSW 2014 II; Matt Braunger, Matt Besser, Jon Gabrus by Comedy Bang Bang","content":"276 LIVE from SXSW 2014 II; Matt Braunger, Matt Besser, Jon Gabrus by Comedy Bang Bang","categories":[]},{"title":"275 LIVE from SXSW 2014; Jonah Ray, Adam Cayton-Holland, James Adomian","link":"https://soundcloud.com/comedybangbang/275-live-from-sxsw-2014-jonah","author":"","publishedDate":"Mon, 10 Mar 2014 00:01:52 -0700","contentSnippet":"275 LIVE from SXSW 2014; Jonah Ray, Adam Cayton-Holland, James Adomian by Comedy Bang Bang","content":"275 LIVE from SXSW 2014; Jonah Ray, Adam Cayton-Holland, James Adomian by Comedy Bang Bang","categories":[]},{"title":"274 Jason Mantzoukas, Andy Daly","link":"https://soundcloud.com/comedybangbang/274-jason-mantzoukas-andy-daly","author":"","publishedDate":"Sat, 01 Mar 2014 20:54:18 -0800","contentSnippet":"274 Jason Mantzoukas, Andy Daly by Comedy Bang Bang","content":"274 Jason Mantzoukas, Andy Daly by Comedy Bang Bang","categories":[]},{"title":"273 Jim O'Heir, Horatio Sanz","link":"https://soundcloud.com/comedybangbang/273-jim-oheir-horatio-sanz","author":"","publishedDate":"Sun, 23 Feb 2014 21:31:48 -0800","contentSnippet":"273 Jim O'Heir, Horatio Sanz by Comedy Bang Bang","content":"273 Jim O'Heir, Horatio Sanz by Comedy Bang Bang","categories":[]},{"title":"272 Gillian Jacobs, Paul F. Tompkins","link":"https://soundcloud.com/comedybangbang/272-gillian-jacobs-paul-f","author":"","publishedDate":"Sun, 16 Feb 2014 19:44:42 -0800","contentSnippet":"272 Gillian Jacobs, Paul F. Tompkins by Comedy Bang Bang","content":"272 Gillian Jacobs, Paul F. Tompkins by Comedy Bang Bang","categories":[]},{"title":"271 Nick Thune, Molly Bretthauer","link":"https://soundcloud.com/comedybangbang/271-nick-thune-molly-bretthauer","author":"","publishedDate":"Wed, 12 Feb 2014 15:56:20 -0800","contentSnippet":"271 Nick Thune, Molly Bretthauer by Comedy Bang Bang","content":"271 Nick Thune, Molly Bretthauer by Comedy Bang Bang","categories":[]},{"title":"270 Jon Daly, James Adomian","link":"https://soundcloud.com/comedybangbang/270-jon-daly-james-adomian","author":"","publishedDate":"Sun, 09 Feb 2014 18:01:56 -0800","contentSnippet":"270 Jon Daly, James Adomian by Comedy Bang Bang","content":"270 Jon Daly, James Adomian by Comedy Bang Bang","categories":[]},{"title":"269 Doug Benson, Paul Hornschemeier, Matt Besser","link":"https://soundcloud.com/comedybangbang/269-doug-benson-paul","author":"","publishedDate":"Sun, 02 Feb 2014 16:19:28 -0800","contentSnippet":"269 Doug Benson, Paul Hornschemeier, Matt Besser by Comedy Bang Bang","content":"269 Doug Benson, Paul Hornschemeier, Matt Besser by Comedy Bang Bang","categories":[]},{"title":"268 Jimmy Pardo, Betsy Sodaro","link":"https://soundcloud.com/comedybangbang/268-jimmy-pardo-betsy-sodaro","author":"","publishedDate":"Wed, 29 Jan 2014 18:02:26 -0800","contentSnippet":"268 Jimmy Pardo, Betsy Sodaro by Comedy Bang Bang","content":"268 Jimmy Pardo, Betsy Sodaro by Comedy Bang Bang","categories":[]},{"title":"267 Jerrod Carmichael, Neil Campbell, Mookie Blaiklock","link":"https://soundcloud.com/comedybangbang/267-jerrod-carmichael-neil","author":"","publishedDate":"Sun, 26 Jan 2014 17:16:40 -0800","contentSnippet":"Hee Hee's back! While waiting for fan favorite Jerrod Carmichael to show up, head writer/executive producer of the Comedy Bang! ...","content":"Hee Hee\u0026#39;s back! While waiting for fan favorite Jerrod Carmichael to show up, head writer/executive producer of the Comedy Bang! Bang! TV show \u0026amp; G.O.A.T. freestyle rapper Neil Campbell stops by along with the return of a reincarnated Michael Jackson from Hell. They\u0026#39;ll discuss Men In Black, Captain EO, and a brand new MJ tour right before playing a phenomenal game of Would You Rather. Hee! Hee!","categories":[]},{"title":"266 Taran Killam, Paul Brittain","link":"https://soundcloud.com/comedybangbang/266-taran-killam-paul-brittain","author":"","publishedDate":"Sun, 19 Jan 2014 15:23:44 -0800","contentSnippet":"Comedy buds Taran Killam and Paul Brittain are back to chat about how to take compliments, if older people should be driving ...","content":"Comedy buds Taran Killam and Paul Brittain are back to chat about how to take compliments, if older people should be driving old cars, and why aren't birds shitting on us all the time. Later, Bever Hopox and Chico Hands aka the Calvins twins gallop into the studio to discuss the ostentatious, hypervacious, dualicacious world of prized horse fighting. It's a flip flopping good time!","categories":[]},{"title":"265 LIVE from RIOT LA; Paul F. Tompkins, Lauren Lapkus, Harris Wittels","link":"https://soundcloud.com/comedybangbang/265-live-from-riot-la-paul-f","author":"","publishedDate":"Wed, 15 Jan 2014 15:29:50 -0800","contentSnippet":"Recorded LIVE from the Downtown Independent Theater as part of the RIOT LA festival, it’s a b-b-b-onus episode of Big Bang ...","content":"Recorded LIVE from the Downtown Independent Theater as part of the RIOT LA festival, it’s a b-b-b-onus episode of Big Bang Theory Comedy! IT’S BEEN quite a while since high school student Traci Rearden has been on the show as she catches up with Scott about their time at prom. Harris Wittels also stops by with a fresh batch of Foam Corner and a mysterious vigilante hero hailing from Cumberbatch County, Florida simply known as JW Stillwater appears who fills us in on his life as a crime fighter.\n\n \n\n(Photos courtesy of \u003ca href\u003d\"http://liezlwashere.com/\"\u003eLiezl Estipona\u003c/a\u003e)","categories":[]},{"title":"264 Nick Kroll, Jenny Slate","link":"https://soundcloud.com/comedybangbang/264-nick-kroll-jenny-slate","author":"","publishedDate":"Sun, 12 Jan 2014 18:31:25 -0800","contentSnippet":"Stars of the Kroll Show, Nick Kroll \u0026amp; Jenny Slate are on this week’s Big Bang Theory Comedy to chat about the upcoming ...","content":"Stars of the Kroll Show, Nick Kroll \u0026amp; Jenny Slate are on this week’s Big Bang Theory Comedy to chat about the upcoming season of Kroll Show, how they met doing stand-up shows in New York, and their thoughts on public restrooms. Later, Liz and Pretty Liz of PubLIZity drop by to be totally honest about Pretty Liz’s new baby, pet names, and the current movie they are pitching. Honestly, it’s an amazing episode you don’t want to miss!","categories":[]},{"title":"263 Ben Schwartz, Horatio Sanz","link":"https://soundcloud.com/comedybangbang/263-ben-schwartz-horatio-sanz","author":"","publishedDate":"Sun, 05 Jan 2014 16:25:18 -0800","contentSnippet":"House of Pies star Ben Schwartz aka Benny Schwaz is here to share his new year's resolutions on another edition of Comedy Bing ...","content":"House of Pies star Ben Schwartz aka Benny Schwaz is here to share his new year's resolutions on another edition of Comedy Bing Bang Theory! After some wonderful duets, Coco Marx (Groucho Marx’s grandson) returns to tell us about his past in the celebrity sex tape biz, some of his new jokes, and his new office prank show. Then, the guys play the first Would You Rather of 2014! The End.","categories":[]},{"title":"Best of 2013 Pt 4","link":"https://soundcloud.com/comedybangbang/best-of-2013-pt-4","author":"","publishedDate":"Tue, 31 Dec 2013 15:37:16 -0800","contentSnippet":"And now the exciting conclusion to the best of 2013 countdown with special guest Paul F. Tompkins. What will be the number one ...","content":"And now the exciting conclusion to the best of 2013 countdown with special guest Paul F. Tompkins. What will be the number one episode of 2013? You'll have to tune in to find out!","categories":[]},{"title":"Best of 2013 Pt 3","link":"https://soundcloud.com/comedybangbang/best-of-2013-pt-3","author":"","publishedDate":"Sat, 28 Dec 2013 21:23:49 -0800","contentSnippet":"It's getting real close to the end with part three of the Comedy Bang! Bang! best of countdown as Scott and special guest Paul ...","content":"It's getting real close to the end with part three of the Comedy Bang! Bang! best of countdown as Scott and special guest Paul F. Tompkins count down numbers six through four as well as some b-b-b-bonus-s-s-s clips. Sit tight and look out for the final installment!","categories":[]},{"title":"Best of 2013 Pt 2","link":"https://soundcloud.com/comedybangbang/best-of-2013-pt-2","author":"","publishedDate":"Tue, 24 Dec 2013 01:42:01 -0800","contentSnippet":"The best of Comedy Bang! Bang! countdown continues with Scott and special guest Paul F. Tompkins as they go count down numbers ...","content":"The best of Comedy Bang! Bang! countdown continues with Scott and special guest Paul F. Tompkins as they go count down numbers eleven through seven of the best episodes YOU voted for along with additional b-b-b-bonus-s-s-s clips. Much love!","categories":[]},{"title":"Best of 2013 Pt 1","link":"https://soundcloud.com/comedybangbang/best-of-2013-pt-1","author":"","publishedDate":"Sun, 22 Dec 2013 00:42:55 -0800","contentSnippet":"Alas, we say farewell to another year but never fear because the best of 2013 episode of Comedy Bang! Bang! is here! There were ...","content":"Alas, we say farewell to another year but never fear because the best of 2013 episode of Comedy Bang! Bang! is here! There were sooo many good episodes this year that we had to step up the countdown to the next level. Making a rare appearance is special guest Paul F. Tompkins who helps Scott countdown numbers fifteen through twelve of the listener selected episodes of the year and some very special b-b-b-bonus-s-s-s clips. Stay tuned for Pt 2 to see which episodes YOU voted for made the list!","categories":[]},{"title":"2013 Holiday Spectacular","link":"https://soundcloud.com/comedybangbang/2013-holiday-spectacular","author":"","publishedDate":"Sun, 15 Dec 2013 16:39:30 -0800","contentSnippet":"Ho! Ho! Ho! Surfing Santa wipeout! It’s time once again for the year end holiday episode of Comedy Bing Bong! with guests ...","content":"Ho! Ho! Ho! Surfing Santa wipeout! It’s time once again for the year end holiday episode of Comedy Bing Bong! with guests galore! Jason Mantzoukas returns with singer-songwriter Nick Lowe who’ll play some festive songs from his new Christmas record “\u003ca href\u003d\"http://www.amazon.com/Quality-Street-Selection-Nick-Lowe/dp/B00DRGR142/ref\u003dsr_1_1?s\u003dmusic\u0026amp;ie\u003dUTF8\u0026amp;qid\u003d1387164826\u0026amp;sr\u003d1-1\u0026amp;keywords\u003dquality+street\"\u003eQuality Street: A Seasonal Selection For All The Family\u003c/a\u003e.” Along the way, we’ll hear a cowboy Christmas poem, a new Christmas theme song, hear from a Stallone brother, and much more. Merrill Holidays, babe!","categories":[]},{"title":"261 Horatio Sanz, Kulap Vilaysack, Shelby Fero","link":"https://soundcloud.com/comedybangbang/261-horatio-sanz-kulap","author":"","publishedDate":"Sat, 07 Dec 2013 19:19:37 -0800","contentSnippet":"The holidays are a time to spend with family so gather round the ol' laptop and listen to a special Bing! Bong! Comedy! with ...","content":"The holidays are a time to spend with family so gather round the ol' laptop and listen to a special Bing! Bong! Comedy! with Who Charted? co-host/Scott's wiiife Kulap Vilaysack and comedian Shelby Fero of the Analyze Fish family! We’ll hear about their holiday traditions and get a taste of the \u003ca href\u003d\"http://ear.wf/1jh4Q2L\"\u003eWho Charted? Holiday Bundle\u003c/a\u003e. Also joining in on the festivities is legendary singer Aaron Neville who tells us a bit about Kwanzaa through song!","categories":[]},{"title":"260 Mike Birbiglia, Brendon Small, Jon Gabrus","link":"https://soundcloud.com/comedybangbang/260-mike-birbiglia-brendon","author":"","publishedDate":"Wed, 04 Dec 2013 19:14:03 -0800","contentSnippet":"Award-winning (sleepwalking) comedian, author, and filmmaker Mike Birbiglia makes his second appearance along with intern Gino ...","content":"Award-winning (sleepwalking) comedian, author, and filmmaker Mike Birbiglia makes his second appearance along with intern Gino Lambardo on today’s bonus Bing! Bong! Comedy! Mike tells us about his new special My Girlfriend’s Boyfriend and focusing on a more joke heavy show on his upcoming 30 city tour. Coincidentally, first time guest Victor Diamond drops by with his manager Tiny to talk about his upcoming all Christmas Carol review.","categories":[]},{"title":"259 David Alan Grier, Lauren Lapkus, Joe Wengert","link":"https://soundcloud.com/comedybangbang/259-david-alan-grier-lauren","author":"","publishedDate":"Sun, 01 Dec 2013 20:26:41 -0800","contentSnippet":"It's a Comedy Bing! Bong! for the ages as accomplished actor, comedian, and yes and-er David Alan Grier makes his debut ...","content":"It's a Comedy Bing! Bong! for the ages as accomplished actor, comedian, and yes and-er David Alan Grier makes his debut appearance! We also get a blast from the past as the short haired singer Regina Crimp drops by to perform some of her amazing foley art. But that's not all, frozen yogurt shop owner Mr. G arrives soon after to share some of his concerns over his shop’s new website. So tune in for an episode that is sure to bring laughs from to coast to coast! Remember to cast your votes for the Best of 2013 CBB episode over at \u003ca href\u003d\"http://ear.wf/cbb2013\"\u003eblog.earwolf.com\u003c/a\u003e!","categories":[]},{"title":"258 Jimmy Pardo, Bill Callahan, Seth Morris","link":"https://soundcloud.com/comedybangbang/258-jimmy-pardo-bill-callahan","author":"","publishedDate":"Sun, 24 Nov 2013 18:50:36 -0800","contentSnippet":"We're never not thankful here at Comedy Bing! Bong! and this week is no exception as Never Not Funny's Jimmy Pardo returns ...","content":"We're never not thankful here at Comedy Bing! Bong! and this week is no exception as Never Not Funny's Jimmy Pardo returns along with first timer/singer-songwriter Bill Callahan! Jimmy gives us the deets on the \u003ca href\u003d\"http://pardcast.com/\"\u003e5th Annual Pardcast-a-thon\u003c/a\u003e and Bill performs songs from his latest album “\u003ca href\u003d\"http://www.amazon.com/Dream-River-Bill-Callahan/dp/B00E1SJDJG/ref\u003dsr_1_1?ie\u003dUTF8\u0026amp;qid\u003d1385350171\u0026amp;sr\u003d8-1\u0026amp;keywords\u003dbill+callahan+dream+river\"\u003eDream River\u003c/a\u003e” before Scott’s ex-stepfather Bob Ducca drops by to tell us about his recent life changing experience. Don’t forget to cast your votes for the Best of 2013 CBB episode over at \u003ca href\u003d\"http://ear.wf/cbb2013\"\u003eblog.earwolf.com\u003c/a\u003e!","categories":[]},{"title":"257 Will Forte, Paul F. Tompkins","link":"https://soundcloud.com/comedybangbang/257-will-forte-paul-f-tompkins","author":"","publishedDate":"Wed, 20 Nov 2013 18:55:17 -0800","contentSnippet":"SNL alum Will Forte is back to tell us a bit about his exciting role in Alexander Payne’s dramedy Nebraska on this week’s ...","content":"SNL alum Will Forte is back to tell us a bit about his exciting role in Alexander Payne’s dramedy Nebraska on this week’s b-b-b-bonus-s-s-s episode of Comedy Bing! Bong! Will begins to read the entire plot of Nebraska when the sudden sound of clanking chains is heard to reveal the haunting return of the ghost of Richard Harrow who’s on the hunt for turkeys, skeletons, and other ghostly things!","categories":[]},{"title":"256 Brendon Small, Cameron Esposito, James Adomian","link":"https://soundcloud.com/comedybangbang/256-brendon-small-cameron","author":"","publishedDate":"Sun, 17 Nov 2013 16:59:09 -0800","contentSnippet":"Creator, star, and driving force behind Metalocalypse, Brendon Small returns as well as Put Your Hands Together host/creator ...","content":"Creator, star, and driving force behind Metalocalypse, Brendon Small returns as well as \u003ca href\u003d\"http://losangeles.ucbtheatre.com/shows/view/3347\"\u003ePut Your Hands Together\u003c/a\u003e host/creator Cameron Esposito who’s making her first appearance on today’s Comedy Bing Bong! Cameron takes us through her memorable late night television debut experience and Brendon gives us a taste of his new one hour rock opera “Metalocalypse: The Doomstar Requiem A Klok Opera” right before Jesse “The Mind/Body/Soul” Ventura drops by to address the possibility of running for president.","categories":[]},{"title":"255 Rob Delaney, Mookie Blaiklock","link":"https://soundcloud.com/comedybangbang/255-rob-delaney-mookie","author":"","publishedDate":"Sat, 09 Nov 2013 01:23:36 -0800","contentSnippet":"Twitter expert, comedian extraordinaire, and author Rob Delaney returns on this week’s episode of Comedy Bing! Bong! After a ...","content":"Twitter expert, comedian extraordinaire, and author Rob Delaney returns on this week’s episode of Comedy Bing! Bong! After a chat about poop, Twitter headquarters, and Rob’s new book, “\u003ca href\u003d\"http://www.amazon.com/Rob-Delaney-Warrior-Yardstick-Cabbage/dp/081299308X/ref\u003dsr_1_1?ie\u003dUTF8\u0026amp;qid\u003d1383777282\u0026amp;sr\u003d8-1\u0026amp;keywords\u003drob+delaney\"\u003eRob Delaney: Mother. Wife. Sister. Human. Warrior. Falcon. Yardstick. Turban. Cabbage\u003c/a\u003e,” a reincarnated Michael Jackson makes a special visit straight from Hell. Hee! Hee!","categories":[]},{"title":"254 LIVE from Comedy Gives Back; Zach Galifianakis, David Wain, Andy Daly","link":"https://soundcloud.com/comedybangbang/254-live-from-comedy-gives","author":"","publishedDate":"Wed, 06 Nov 2013 19:02:04 -0800","contentSnippet":"Bearded bad boy Zach Galifianakis and director/scribe David Wain are both on this week’s special bonus LIVE episode of Comedy ...","content":"Bearded bad boy Zach Galifianakis and director/scribe David Wain are both on this week’s special bonus LIVE episode of Comedy Bang! Bang! from the Comedy Gives Back benefit for Malaria No More. Zach \u0026amp; David bro out about dubstep \u0026amp; parkour before they are joined by newcomer Jack Fitzgerald who everyone quickly finds out is a bit of a gadfly. Be a part of the Comedy Bang! Bang! One Dollar Challenge by donating over at \u003ca href\u003d\"http://www.tumblr.com/blog/earwolf/new/malarianomore.org/comedygivesback\"\u003emalarianomore.org/comedygivesback\u003c/a\u003e and help us finally stamp out malaria!","categories":[]},{"title":"253 Tim Heidecker, Jon Daly","link":"https://soundcloud.com/comedybangbang/253-tim-heidecker-jon-daly","author":"","publishedDate":"Sun, 03 Nov 2013 09:21:54 -0800","contentSnippet":"Titans of comedy Tim Heidecker and a newly Twitter verified Jon Daly are back on today's Comedy Bang! Bang! Unfortunately their ...","content":"Titans of comedy Tim Heidecker and a newly Twitter verified Jon Daly are back on today's Comedy Bang! Bang! Unfortunately their friendship quickly hits the danger zone when they have conflicting opinions on Guy Fieri. Will the #230PST bros be able to overcome the bump in the road that is their friendship? You’ll have to tune in to find out!","categories":[]},{"title":"252 Halloween, Steven Yeun, Paul Rust, Molly Bretthauer, Nick Wiger, Eva Anderson, Caroline Anderson","link":"https://soundcloud.com/comedybangbang/252-halloween-steven-yeun-paul","author":"","publishedDate":"Sun, 27 Oct 2013 19:44:25 -0700","contentSnippet":"Beware listeners, today's spOoOoky edition of Comedy Fang! Fang! might be too scary for the faint hearted but hopefully the ...","content":"Beware listeners, today\u0026#39;s spOoOoky edition of Comedy Fang! Fang! might be too scary for the faint hearted but hopefully the zombie killing expertise of The Walking Dead’s Steven Yeun will help you face your fears! Join Scott \u0026amp; Steven (if you dare) as they welcome a mad scientist by the name of Dr. Traygo who is going through an emotional crisis and lesbian vampire Dykula who’s looking for a good time. That’s not all, Leo Karpatze makes his haunting return along with The Hauntettes to debut the sequel to his original version of the Monster Mash!","categories":[]},{"title":"251 Amber Tamblyn, Todd Glass","link":"https://soundcloud.com/comedybangbang/251-amber-tamblyn-todd-glass","author":"","publishedDate":"Tue, 22 Oct 2013 21:09:02 -0700","contentSnippet":"Star of The Sisterhood of the Traveling Pants \u0026amp; first timer Amber Tamblyn stops by along with fan favorite Todd Glass to ...","content":"Star of The Sisterhood of the Traveling Pants \u0026amp; first timer Amber Tamblyn stops by along with fan favorite Todd Glass to celebrate Ovarytober on today\u0026#39;s special B-B-B-ONUS-S-S-s episode of Comedy Bing Bong! Amber tells us about recently becoming a regular on Two and a Half Men, Todd expresses his joy for the theme song Scott wrote for him, and they all pitch possible names for Todd\u0026#39;s new book. Plus, a delightful game of Would You Rather? that you won\u0026#39;t want to miss!","categories":[]},{"title":"250 Pete Holmes, Jon Gabrus, Pamela Murphy","link":"https://soundcloud.com/comedybangbang/250-pete-holmes-jon-gabrus","author":"","publishedDate":"Sun, 20 Oct 2013 18:16:20 -0700","contentSnippet":"The star of The Pete Holmes Show, infectious laugher, and today’s guest of honor Pete Holmes finally makes it weird on his ...","content":"The star of The Pete Holmes Show, infectious laugher, and today’s guest of honor Pete Holmes finally makes it weird on his inaugural Comedy Bing Bong appearance! Also joining both Scott \u0026amp; Pete is Gino Lambardo, a new intern from Long Island that is sure to give Marissa Wompler a run for her money. After a couple of solid segues \u0026amp; a convo snippet, extraordinary athlete Lisa Bartin drops by to fill the guys in on a terrible breakup  which occurred recently when she swam the English Channel.","categories":[]},{"title":"249 Bob Odenkirk, The Birthday Boys","link":"https://soundcloud.com/comedybangbang/249-bob-odenkirk-the-birthday","author":"","publishedDate":"Sun, 13 Oct 2013 23:14:04 -0700","contentSnippet":"Mr. Show \u0026amp; Breaking Bad’s Bob Odenkirk returns along with our favorite sketch group The Birthday Boys on today’s Comedy ...","content":"Mr. Show \u0026amp; Breaking Bad’s Bob Odenkirk returns along with our favorite sketch group The Birthday Boys on today’s Comedy Bang Boing! Bob takes us through the true final episode of Breaking Bad, he helps Scott find a new catchphrase, and tells us all about working with The Birthday Boys on their new IFC show which premieres Friday, October 18th (which you should absolutely tune in to if you know what’s good for ya!). Enhance your CBB listening experience by grabbing yourself an ice cold Coca-Cola, Pepsi, or Tab and enjoy that secret recipe taste!","categories":[]},{"title":"248 Eric Andre, Lauren Lapkus","link":"https://soundcloud.com/comedybangbang/248-eric-andre-lauren-lapkus","author":"","publishedDate":"Wed, 09 Oct 2013 19:56:21 -0700","contentSnippet":"It's the meeting of the fake talk show hosts as Eric Andre makes his makes his first appearance on this week's ...","content":"It's the meeting of the fake talk show hosts as Eric Andre makes his makes his first appearance on this week's b-b-b-bonus-s-s-s episode of Comedy Bang! Bang! After a chat about cross over episodes, ska, and bass lines, Scott’s missing nephew Todd shows up looking a bit different. Don't forget to collect every CBB LIVE 2013 Tour episode over at the \u003ca href\u003d\"http://www.earwolf.com/shop\"\u003eEarwolf store\u003c/a\u003e!","categories":[]},{"title":"247 Tim Meadows, Horatio Sanz","link":"https://soundcloud.com/comedybangbang/247-tim-meadows-horatio-sanz","author":"","publishedDate":"Sun, 06 Oct 2013 21:21:16 -0700","contentSnippet":"Comedy legend and Saturday Night Fever Live star Tim Meadows makes his first visit to the podcast on this week's Comedy Bang ...","content":"Comedy legend and Saturday Night \u003cdel\u003eFever\u003c/del\u003e Live star Tim Meadows makes his first visit to the podcast on this week\u0026#39;s Comedy Bang Bang! After Tim and Scott discuss the ins and outs of laser eye surgery and the SNL writing process, musician \u0026amp; esteemed author Chico Davis stops by to promote his book and share some classic stories from his days in the Los Angeles music scene, including his connections to some rock \u0026#39;n roll related tragedies as well as some tales from his time spent at the famed Viper Room on the Sunset Strip. Don’t forget to collect every CBB LIVE 2013 Tour episode over at the \u003ca href\u003d\"http://www.earwolf.com/shop\"\u003eEarwolf store\u003c/a\u003e!","categories":[]},{"title":"246 Casey Wilson, June Diane Raphael","link":"https://soundcloud.com/comedybangbang/246-casey-wilson-june-diane","author":"","publishedDate":"Sun, 29 Sep 2013 20:12:11 -0700","contentSnippet":"The writing team and stars of Ass Backwards, Casey Wilson \u0026amp; June Diane Raphael are here to predict future inventions on ...","content":"The writing team and stars of \u003ca href\u003d\"https://twitter.com/AssBackwardsMov\"\u003eAss Backwards\u003c/a\u003e, Casey Wilson \u0026amp; June Diane Raphael are here to predict future inventions on this week’s Comedy Bing! Bing! Casey \u0026amp; June let us know how their new movie \u003ca href\u003d\"https://itunes.apple.com/us/movie/ass-backwards/id682419153?ign-mpt\u003duo%3D4\"\u003eAss Backwards\u003c/a\u003e (which is now out on VOD) was loosely based on their life post college, Casey tells us about the times she has been hospitalized for dehydration, and June explains why toilet bowls were made for men. Then, twin sisters Janelle \u0026amp; Jolene Johnson drop by to inform us on their missing sister Janine. Think of this as your birthday present but only if today’s your birthday! Don’t forget to collect every CBB LIVE 2013 Tour episode over at the \u003ca href\u003d\"http://ear.wf/1cqhs8z\"\u003eEarwolf store\u003c/a\u003e!","categories":[]},{"title":"245 Amy Poehler, Paul F. Tompkins, Neil Campbell","link":"https://soundcloud.com/comedybangbang/245-amy-poehler-paul-f","author":"","publishedDate":"Sun, 22 Sep 2013 00:06:42 -0700","contentSnippet":"Cancel all your plans because Amy Poehler is back along with co-host Neil Campbell for a post-Emmys chat on today’s Comedy Bing ...","content":"Cancel all your plans because Amy Poehler is back along with co-host Neil Campbell for a post-Emmys chat on today’s Comedy Bing Bong! Amy gives us a sneak preview of the new season of Parks and Recreation, tells us about the reality shows she’s working on, and shares some important advice on improv. Then, special guest Alan Thicke stops  by to talk about what it was like on the set of “Growing Pains,” if he ever competes with his son over women, and he performs his very own Parks and Rec theme song. Plus, Scott, Amy, Neil, and Alan go head to head to be crowned G.O.A.T. in the Freestyle Rap Battle!","categories":[]},{"title":"244 Andy Samberg, Eddie Pepitone","link":"https://soundcloud.com/comedybangbang/244-andy-samberg-eddie","author":"","publishedDate":"Sun, 15 Sep 2013 01:10:41 -0700","contentSnippet":"What’s that? How will you deal with your life now that Andy Samberg isn’t live on your TV on Saturday nights anymore? Cheer up ...","content":"What’s that? How will you deal with your life now that Andy Samberg isn’t live on your TV on Saturday nights anymore? Cheer up because you’ll still be able to see him on FOX’s upcoming Brooklyn Nine-Nine and hear him remix the Hollywood Facts theme on today’s Comedy Bing Bong! Andy \u0026amp; Scott have a bro out sesh about DJs \u0026amp; Superbowl commercials before they meet entrepreneur Eddie Floatley who quickly creates panic (it’s his job) in the studio.","categories":[]},{"title":"243 Maria Bamford, James Adomian","link":"https://soundcloud.com/comedybangbang/243-maria-bamford-james","author":"","publishedDate":"Sun, 08 Sep 2013 18:24:28 -0700","contentSnippet":"IT’S BEEN a while since Maria Bamford has been on the show and this time she’s unexpectedly joined by the one and only Tom ...","content":"IT’S BEEN a while since Maria Bamford has been on the show and this time she’s unexpectedly joined by the one and only Tom Leykis. Maria shares her love of community building and what she’s been up to, including her stand-up special, “\u003ca href\u003d\"https://chill.com/mariabamfoo/the-special-special-special\"\u003eMaria Bamford: The Special Special Special!\u003c/a\u003e” until Tom interjects to tell us about his breakfast eating habits and gives us a glimpse into his shocking family life. Suddenly, through the power of meditation, Tom channels another friend of the show who we haven’t seen in a while.","categories":[]},{"title":"242 Thomas Lennon, Rob Huebel, Neko Case","link":"https://soundcloud.com/comedybangbang/242-thomas-lennon-rob-huebel","author":"","publishedDate":"Fri, 30 Aug 2013 17:17:12 -0700","contentSnippet":"Tom Lennon \u0026amp; Rob Huebel return along with singer/songwriter/first time guest Neko Case in shark leather attire to grill out ...","content":"Tom Lennon \u0026amp; Rob Huebel return along with singer/songwriter/first time guest Neko Case in shark leather attire to grill out on today’s special Labor Day episode of Comedy Bing Bong! Rob gives kids some tips for back to school, Tom makes a promise to everyone who watches \u003ca href\u003d\"http://hellbaby-movie.com/\"\u003eHell Baby\u003c/a\u003e, and Neko plays some songs off her new album “\u003ca href\u003d\"http://www.nekocase.com/\"\u003eThe Worse Things Get, The Harder I Fight, The Harder I Fight, The More I Love You\u003c/a\u003e.” Plus, they all compete in a Labor Day edition of Would You Rather! Did we mention it’s Labor Day?","categories":[]},{"title":"241 Paul Scheer, Nick Kroll","link":"https://soundcloud.com/comedybangbang/241-nick-kroll-paul-scheer","author":"","publishedDate":"Sun, 25 Aug 2013 16:03:01 -0700","contentSnippet":"Since The League returns on FXX soon why not have cast mates Paul Scheer AND Nick Kroll here to help fans find the show on its ...","content":"Since The League returns on FXX soon why not have cast mates Paul Scheer AND Nick Kroll here to help fans find the show on its new channel, share their favorite apps, and figure out what it would take for Sylvester Stallone to make \u003ca href\u003d\"https://docs.google.com/file/d/0BzQZA8NReU7pYjlmN2MzNTctNTRlMS00OTY1LTgyMmItNDBhODQ1NzMyOGZi/edit?pli\u003d1\"\u003eRocky Vs. Rambo\u003c/a\u003e a reality. It looks like their in luck when Sly \u0026amp; Frank Stallone drop by the studio to answer some important questions that include the possibility of remaking some Stallone classics and whether Rocky Vs. Rambo will ever see the light of day.","categories":[]},{"title":"240 Edgar Wright, Simon Pegg, Nick Frost","link":"https://soundcloud.com/comedybangbang/240-edgar-wright-simon-pegg","author":"","publishedDate":"Thu, 22 Aug 2013 16:08:34 -0700","contentSnippet":"The trio of filmmakers from The World’s End, Edgar Wright, Simon Pegg, and Nick Frost are on today’s B-B-B-B-ONUS episode of ...","content":"The trio of filmmakers from The World’s End, Edgar Wright, Simon Pegg, and Nick Frost are on today’s B-B-B-B-ONUS episode of Comedy Bang! Bang! They’ll explain how the Cornetto trilogy came to be, describe some of the themes of their film “The World’s End,” and wonder what’s been going on with Austin Powers. Then, giant stars Sean Connery and Sir Michael Caine walk into the room to share their love of friendship and tell us about the important rules of acting.","categories":[]},{"title":"239 Jay Mohr, Matt Besser","link":"https://soundcloud.com/comedybangbang/239-jay-mohr-matt-besser","author":"","publishedDate":"Sun, 18 Aug 2013 13:42:07 -0700","contentSnippet":"SNL alum and Mohr Stories host Jay Mohr makes his first appearance on today’s Comedy Bang! Bang! After a discussion on the ...","content":"SNL alum and Mohr Stories host Jay Mohr makes his first appearance on today’s Comedy Bang! Bang! After a discussion on the central time zone, Scott’s neighbor drops by to tell us all about being a new dad and how to keep a baby happy. Plus, a life changing game of Would You Rather!","categories":[]},{"title":"238 Jessica St. Clair, Lennon Parham, Jason Mantzoukas, Brian Huskey, Melissa Rauch","link":"https://soundcloud.com/comedybangbang/238-jessica-st-clair-lennon","author":"","publishedDate":"Sun, 11 Aug 2013 16:42:04 -0700","contentSnippet":"WOMP IT UP! We’re celebrating Marissa Wompler’s 17th Birthday Party LIVE from the Marina Del Rey condo HOA common area pool ...","content":"WOMP IT UP! We’re celebrating Marissa Wompler’s 17th Birthday Party LIVE from the Marina Del Rey condo HOA common area pool with Miss Listler, Marissa’s step dad Dr. Seth Wompler, and Eric “Gutterballs” Gutterman. It’s all fun in the sun until Marissa’s arch nemesis Danielle Bartiromo crashes the pool party. Grab yourself a tea, join us on the platform above the pool, and womp up the jamz!","categories":[]},{"title":"237 Jonah Ray, Nick Thune, Eugene Cordero","link":"https://soundcloud.com/comedybangbang/237-jonah-ray-nick-thune","author":"","publishedDate":"Wed, 07 Aug 2013 19:03:50 -0700","contentSnippet":"1/3 of the Nerdist podcast \u0026amp; host of Jonah Raydio, Jonah Ray makes his first appearance along with fan favorite Nick Thune ...","content":"1/3 of the Nerdist podcast \u0026amp; host of Jonah Raydio, Jonah Ray makes his first appearance along with fan favorite Nick Thune for a bro out sesh on this week’s b-b-b-bonus-s-s-s episode of Comedy Bang! Bang! After the guys confess their love of baseball movies, newcomer Tito Ben stops by to let us know all about his Eagle Rock plaza kiosk. Plus, an unforgettable game of Would You Rather? between bros!","categories":[]},{"title":"236 Rob Corddry, Paul F. Tompkins","link":"https://soundcloud.com/comedybangbang/236-rob-corddry-paul-f","author":"","publishedDate":"Sun, 04 Aug 2013 20:40:36 -0700","contentSnippet":"Rob Corddry finds his way to the Earwolf studios once again on today’s Comedy Bang! Bang! Rob talks to us about Hot Tub Time ...","content":"Rob Corddry finds his way to the Earwolf studios once again on today’s Comedy Bang! Bang! Rob talks to us about Hot Tub Time Machine 2, the 5th season of Childrens Hospital, and Herve Villechaize. Suddenly the ghostly presence of Richard Harrow appears to let us know about the 12 heavens, warn us about the true intentions of the tooth fairy, and take over a game of Would You Rather. Cha-Ching! Be sure to head on over to \u003ca href\u003d\"http://www.ifc.com\"\u003ewww.ifc.com\u003c/a\u003e to get tickets/info on the Comedy Bang! Bang! LIVE Tour!","categories":[]},{"title":"235 Doug Benson, Paul F. Tompkins","link":"https://soundcloud.com/comedybangbang/235-doug-benson-paul-f","author":"","publishedDate":"Sat, 27 Jul 2013 23:25:58 -0700","contentSnippet":"If you don’t already know, Doug Benson hates candy wrappers, screaming children, and sticky seats. Although, he loves movies ...","content":"If you don’t already know, Doug Benson hates candy wrappers, screaming children, and sticky seats. Although, he loves movies and he joins Scott on today’s Comedy Bang Bang to talk about Broadway, the first time they met, and being concert buddies. Our open door policy is in full effect as Lord Andrew Lloyd Webber returns to discuss important topics such as musicals, brunch, and barbecue. We’ll also learn a couple of new things about Doug \u0026amp; Lord Webber during a whimsical game of Would You Rather!","categories":[]},{"title":"234 Bill Hader, Seth Morris","link":"https://soundcloud.com/comedybangbang/234-bill-hader-seth-morris","author":"","publishedDate":"Wed, 24 Jul 2013 17:50:47 -0700","contentSnippet":"SNL superstar Bill Hader makes his inaugural appearance on this week’s B-B-B-BONUS episode of Comedy Bang! Bang! Bill regales ...","content":"SNL superstar Bill Hader makes his inaugural appearance on this week’s B-B-B-BONUS episode of Comedy Bang! Bang! Bill regales us with stories of his first SNL, going on a ride-along with a cop while shooting Superbad, and his wife’s upcoming directorial debut, The To Do List. Scott’s ex-stepfather Bob Ducca also drops by from a long soul searching venture to share some memories of summer from his youth. Sit back, open up a bag of butterscotch discs, and enjoy as Bill \u0026amp; Bob go head to head in a thrilling game of Would You Rather!","categories":[]},{"title":"233 Bob Odenkirk, Andy Daly","link":"https://soundcloud.com/comedybangbang/233-bob-odenkirk-andy-daly","author":"","publishedDate":"Sat, 20 Jul 2013 19:20:39 -0700","contentSnippet":"Today’s episode of Comedy Bang Bang will delight fans of both Mr. Show and the Royal family! Bob Odenkirk treats listeners to ...","content":"Today’s episode of Comedy Bang Bang will delight fans of both Mr. Show and the Royal family! Bob Odenkirk treats listeners to some special news that’s sure to please anyone who loves Mr. Show. Joining Bob is Byron Denniston, a Royal watcher from across the pond. He’ll educate us on all the happenings in the Royal family, share Princess Kate Middleton’s exclusive list of baby names, and address some of the rumors Bob has heard concerning the Royals.","categories":[]},{"title":"232 LIVE from San Diego Comic-Con; Andy Daly, Paul Rust","link":"https://soundcloud.com/comedybangbang/live-from-san-diego-comic-con","author":"","publishedDate":"Thu, 18 Jul 2013 01:54:20 -0700","contentSnippet":"That’s right, it’s a b-b-b-bonus episode of Comedy Bang! Bang! recorded live from San Diego Comic-Con! IT’S BEEN a while since ...","content":"That’s right, it’s a b-b-b-bonus episode of Comedy Bang! Bang! recorded live from San Diego Comic-Con! IT’S BEEN a while since we’ve heard what’s up with Hot Dog and since we heard a couple of New No-Nos from CBB favorite Paul Rust! What more can you ask for?","categories":[]},{"title":"231 Kumail Nanjiani, James Adomian","link":"https://soundcloud.com/comedybangbang/231-kumail-nanjiani-james","author":"","publishedDate":"Fri, 12 Jul 2013 14:39:12 -0700","contentSnippet":"Things get weird fast as Kumail Nanjiani returns and Paul Giamatti bursts through the studio to confess all the experiments ...","content":"Things get weird fast as Kumail Nanjiani returns and Paul Giamatti bursts through the studio to confess all the experiments he’s gone through while shooting his films. Kumail then tells us what we can expect on his upcoming Comedy Central one-hour special “Beta Male,” explains what’s the first thing he’s ever observed, and re-enacts the process of how the stand-up comedy series “The Meltdown with Jonah and Kumail” got picked up. Suddenly, Jesse “The Body, The Mind, The Soul” Ventura appears to grant wishes and make a special proposition to Kumail.","categories":[]},{"title":"230 Reggie Watts, Neil Campbell","link":"https://soundcloud.com/comedybangbang/reggie-watts-neil-campbell","author":"","publishedDate":"Wed, 10 Jul 2013 13:48:57 -0700","contentSnippet":"Reggie Watts and Neil Campbell are back in the hot seats on this week's B-B-B-BONUS Comedy Bang Bang! Scott, Reggie and Neil ...","content":"Reggie Watts and Neil Campbell are back in the hot seats on this week's B-B-B-BONUS Comedy Bang Bang! Scott, Reggie and Neil share their excitement for season two of Comedy Bang Bang: The TV series, which premieres on IFC on Friday July 12th, as well as reminisce about the process of creating the show. Reggie updates everyone on the current state of the Jish and Jash networks and debuts some new exclusive tracks before Neil performs a very memorable monologue. A classic Freestyle Rap Battle takes places as well as a hysterical Would You Rather, and we will be back with your regularly scheduled Bang Bang on Monday!","categories":[]},{"title":"229 Ben Schwartz, Paul F. Tompkins","link":"https://soundcloud.com/comedybangbang/229-ben-schwartz-paul-f","author":"","publishedDate":"Sun, 07 Jul 2013 12:12:32 -0700","contentSnippet":"Ben Schwartz and director extraordinaire Werner Herzog both return to the studio on today's Comedy Bang Bang! Scott shares his ...","content":"Ben Schwartz and director extraordinaire Werner Herzog both return to the studio on today's Comedy Bang Bang! Scott shares his enthusiasm for season two of the Comedy Bang Bang TV series, which premieres on IFC this Friday July 12th, and Ben and Scott discuss the new season of Ben's series House of Pies. Werner discusses the plight of working with a green screen, reveals what kind of vehicle he drives and what it's like working on a film with Thomas Cruise. The filmography of Prince and the pronunciation of the word \"marshmallow\" are mentioned before Werner clues us in on his favorite film of all time and Ben tries out a new character. Comedy Bang Bang will return with a very special B-B-B-BONUS episode this Thursday.","categories":[]},{"title":"Acapella Cuddle Puddle","link":"https://soundcloud.com/comedybangbang/228-john-hodgman-paul-f","author":"","publishedDate":"Sun, 30 Jun 2013 00:36:17 -0700","contentSnippet":"The immensely talented \u0026amp; hilarious John Hodgman stops by the studio for the first time EVER on today's Comedy Bang Bang! ...","content":"The immensely talented \u0026amp; hilarious John Hodgman stops by the studio for the first time EVER on today\u0026#39;s Comedy Bang Bang! Scott asks John all the hard-hitting questions and finds out everything you need to know, like where he isn\u0026#39;t from, and John talks about his new Netflix special RAGNAROK which is currently available for streaming. John shares stories from his college years at Yale before accidentally summoning friend of the show Ice-T to the studio. Ice reveals his controversial opinion on the Hobbit films before Scott makes a phone call and gets another favorite guest involved in the conversation.","categories":[]},{"title":"227 Brian Posehn, Jon Daly","link":"https://soundcloud.com/comedybangbang/227-brian-posehn-jon-daly","author":"","publishedDate":"Wed, 26 Jun 2013 17:43:26 -0700","contentSnippet":"Nerd Poker's Brian Posehn stops by the studio on this week's special B-B-B-BONUS Thursday episode of Comedy Bang Bang! Scott ...","content":"Nerd Poker's Brian Posehn stops by the studio on this week's special B-B-B-BONUS Thursday episode of Comedy Bang Bang! Scott and Brian reminisce about the old Mr. Show days, break down Brian's latest comedy album \u003ca href\u003d\"http://www.amazon.com/The-Fartist-Brian-Posehn/dp/B00CM9JKOO/ref\u003dsr_1_2?ie\u003dUTF8\u0026amp;qid\u003d1372294000\u0026amp;sr\u003d8-2\u0026amp;keywords\u003dthe+fartist\"\u003eTHE FARTIST\u003c/a\u003e track-by-track, and talk about Brian's job writing Deadpool comics. Mall McCartney (or is it Paul McCartney?) sneaks his way in through the ever-open door to share some of his insider Beatles knowledge and attempt to give Brian and Scott hip new nicknames. We'll be back with your regularly scheduled Bang Bang on Monday, don't miss it!","categories":[]},{"title":"226 Paul Feig, Horatio Sanz","link":"https://soundcloud.com/comedybangbang/226-paul-feig-horatio-sanz","author":"","publishedDate":"Sun, 23 Jun 2013 15:32:51 -0700","contentSnippet":"Comedy juggernaut Paul Feig returns to the podcast for the first time since 2011 on today's Comedy Bang Bang! Paul shares his ...","content":"Comedy juggernaut Paul Feig returns to the podcast for the first time since 2011 on today's Comedy Bang Bang! Paul shares his philosophy on improvising, discusses recording ADR jokes and talks about his latest feature THE HEAT, which opens in theaters nationwide this Friday. Victor Ramos, head of the Aspira after school program for inner city youth, stops by the show to promote his controversial curriculum. Victor explains how he deals with cyber-bullying and teen pregnancy before Scott poses quite the conundrum in a \"squeaker\" of a game of Would You Rather? Comedy Bang Bang returns with a special B-B-B-BONUS episode this Thursday.","categories":[]},{"title":"225 Taran Killam, Paul Brittain","link":"https://soundcloud.com/comedybangbang/225-taran-killam-paul-brittain","author":"","publishedDate":"Sun, 16 Jun 2013 18:54:29 -0700","contentSnippet":"Hey kiddos! Saturday Night Live’s Taran Killam and Paul Brittain make their first time Comedy Bang Bang appearance! They let us ...","content":"Hey kiddos! Saturday Night Live’s Taran Killam and Paul Brittain make their first time Comedy Bang Bang appearance! They let us know what is was like being office mates at SNL, the difference between an accent \u0026amp; a dialect, and give us a refresher on the sci-fi action film Demolition Man. Then musicians Mark Johnson Sr. \u0026amp; Lon Smudge drop by to share their amazing tale of rockin’ wool to rock ‘n’ roll and sing some of their classic dad rock tunes!","categories":[]},{"title":"224 Live From Austin; Paul Scheer, Martin Starr, Brandon Johnson, Neil Campbell","link":"https://soundcloud.com/comedybangbang/224-live-from-austin-paul","author":"","publishedDate":"Wed, 12 Jun 2013 21:28:29 -0700","contentSnippet":"This special B-B-B-BONUS Comedy Bang Bang was recorded live on June 6th at the Scottish Rite Theater in Austin, Texas with the ...","content":"This special B-B-B-BONUS Comedy Bang Bang was recorded live on June 6th at the Scottish Rite Theater in Austin, Texas with the stars of Adult Swim's NTSF:SD:SUV! Martin Starr, Brandon Johnson, and depressed teen Rick Faber join Scott to talk about Martin's affiliation with the DARE organization, Brandon's porn habits and Rich's improv training. Vin Diesel's scoliosis-ridden twin brother Bill Diesel drops by the show share some Diesel family wisdom and promote his Vine account before the guests and Scott throw down in a Freestyle Rap Contest for the record books!","categories":[]},{"title":"223 Seth Rogen","link":"https://soundcloud.com/comedybangbang/223-seth-rogen","author":"","publishedDate":"Sun, 09 Jun 2013 16:27:38 -0700","contentSnippet":"The legendary Seth Rogen and his infectious laugh join Scott for the first time in Comedy Bang Bang history! Seth shares ...","content":"The legendary Seth Rogen and his infectious laugh join Scott for the first time in Comedy Bang Bang history! Seth shares stories from the set of \"Superbad\", discusses weird Kirk Cameron movies and clues us in on the origin of his hilarious directorial debut THIS IS THE END, which opens in theaters nationwide this Wednesday. Seth also takes questions from Twitter, revealing his controversial opinion on kale and the tragic story behind his love of pepperoni pizza. Will Scott make Seth cry in this grueling, WTF-style interview or will their game of Fart, Mary, Kiss ease the tension? Listen and find out!","categories":[]},{"title":"222 Paul F. Tompkins, Gillian Jacobs, Mike Hanford","link":"https://soundcloud.com/comedybangbang/222-paul-f-tompkins-gillian","author":"","publishedDate":"Sun, 02 Jun 2013 18:49:09 -0700","contentSnippet":"Take a break from grabbing that tasty air and enjoy a fresh episode of Comedy Bing Bong! The iconic Garry Marshall is back with ...","content":"Take a break from grabbing that tasty air and enjoy a fresh episode of Comedy Bing Bong! The iconic Garry Marshall is back with Gillian Jacobs to deal with some unfinished business that occurred since the last time they were on the show and we’re also joined by extreme adventure skier Ducky Powell who has a sweet message to share with us. It’s truly a gnarly episode you won’t want to miss!","categories":[]},{"title":"221 Andy Richter, Paul F. Tompkins","link":"https://soundcloud.com/comedybangbang/221-andy-richter-paul-f","author":"","publishedDate":"Sun, 26 May 2013 19:13:08 -0700","contentSnippet":"Announcer extraordinaire Andy Richter makes his record breaking 25th appearance and uses his co-hosting duties to get into the ...","content":"Announcer extraordinaire Andy Richter makes his record breaking 25th appearance and uses his co-hosting duties to get into the origins of Cake Boss (Cake Boss!) on today’s Comedy Bang Bang! We’ll hear about his earliest cake memory, he’ll reveal some secrets of the Cake Council, and we’ll find out what his next project will be as he goes on his forced cakebbatical. Plus, we’re treated to a real nail biting game of Would You Rather!","categories":[]},{"title":"220 Lennon Parham, Jessica St. Clair","link":"https://soundcloud.com/comedybangbang/220-lennon-parham-jessica-st","author":"","publishedDate":"Sun, 19 May 2013 13:54:33 -0700","contentSnippet":"Get ready for a Womp Up the Jamz edition of Comedy Bang Bang! Our intern Marissa Wompler decides to show up again along with ...","content":"Get ready for a Womp Up the Jamz edition of Comedy Bang Bang! Our intern Marissa Wompler decides to show up again along with her couples counselor Miss Listler. They’ll get into Marissa’s current state of mind as she will soon be a big sister, Listler’s 7-Eleven incident, and a video competition with the prize of taking Marissa to the prom. Have yourself a PayDay, treat yourself to a DiGiorno, and Womp It Up!","categories":[]},{"title":"219 Adam Scott, Harris Wittels, Chelsea Peretti","link":"https://soundcloud.com/comedybangbang/219-adam-scott-harris-wittels","author":"","publishedDate":"Sun, 12 May 2013 16:57:31 -0700","contentSnippet":"2 years ago, a momentous recording occurred in the Earwolf studios. Now, all the participants have returned once more to ...","content":"2 years ago, a momentous recording occurred in the Earwolf studios. Now, all the participants have returned once more to recreate the magic. You asked for it and it’s finally happening, Adam Scott, Harris Wittels, and Chelsea Peretti are here for the Farts \u0026amp; Pro threequel! You won’t believe the amazing characs that they got for us this time around. Creak, slam, sit and be mesmerized by the Farts Crew!","categories":[]},{"title":"218 4th Anniversary, Wain, Lapkus, St. Clair, PFT, Mantzoukas, Rust, Campbell","link":"https://soundcloud.com/comedybangbang/218-4th-anniversary-david-wain","author":"","publishedDate":"Sun, 05 May 2013 19:33:11 -0700","contentSnippet":"Join us as we celebrate the Four Year Anniversary of Comedy Bang Bang: The Podcast! Acclaimed director David Wain returns with ...","content":"Join us as we celebrate the Four Year Anniversary of Comedy Bang Bang: The Podcast! Acclaimed director David Wain returns with co-host Traci Rearden to experience the high capacity of our open door policy as a furious Marissa Wompler \u0026amp; a disinterested Mike the Janitor drop by. And if that’s not enough, our good friend Jason Mantzoukas wanders in to wish us a happy anniversary right before a couple of record execs who go by the Bachelor Brothers barge in to make a proposition to Scott which could effect the future of CBB. It’s a Comedy Bing Bong for the ages filled with tension, surprises, and “My wife!” for all!","categories":[]},{"title":"217 Marc Maron","link":"https://soundcloud.com/comedybangbang/217-marc-maron","author":"","publishedDate":"Wed, 01 May 2013 20:56:31 -0700","contentSnippet":"Lock the gates! We have an incredible one on one, getting into the actors pain interview with Marc Maron of the WTF podcast on ...","content":"Lock the gates! We have an incredible one on one, getting into the actors pain interview with Marc Maron of the WTF podcast on today’s special Thursday episode of Comedy Bing Bong! Marc tells us what we can expect on his new show “Maron,” takes us through his past TV deals, and shares what advice he would give to a younger Marc Maron. Will things get deep enough to make Marc shed tears? Tune in to find out!","categories":[]},{"title":"216 Kristen Schaal, Michaela Watkins, Neil Campbell","link":"https://soundcloud.com/comedybangbang/216-kristen-schaal-michaela","author":"","publishedDate":"Sun, 28 Apr 2013 17:02:16 -0700","contentSnippet":"Most people would say that Kristen Schaal sparked a ton of controversy on her last Comedy Bang Bang appearance, we at CBB can ...","content":"Most people would say that Kristen Schaal sparked a ton of controversy on her last Comedy Bang Bang appearance, we at CBB can neither confirm or deny this (it totally did). Co-host/licensed therapist Dr. Sherri Levine joins us to discuss which actors are delusional, vagina shame, and to listen to a special mash-up of a voicemail from Kristen’s mom \u0026amp; a certain joke her mom didn’t approve of. Representative of Georgia Buford Dorsey then stops by to share some tips he picked up over the years on how to conduct your life and to play game of Would You Rather!","categories":[]},{"title":"215 Bobby Moynihan, Paul F. Tompkins","link":"https://soundcloud.com/comedybangbang/time-bobby-2","author":"","publishedDate":"Sun, 21 Apr 2013 19:17:24 -0700","contentSnippet":"IT’S BEEN quite a while since Sir Andrew Lloyd Webber has been on Comedy Bean Bag and this time he’s here for a special ...","content":"IT’S BEEN quite a while since Sir Andrew Lloyd Webber has been on Comedy Bean Bag and this time he’s here for a special comprehensive interview of his entire career! Shortly after expressing his love for Vampire Weekend, Scott \u0026amp; Lord ALW are caught off guard by the return of the stabby lil’ orphan boy Fourvel. Equipped with a bandolier full of his little brother Threevel’s scraps, he claims to be here to apologize but does he have other motives? Tune in to find out!","categories":[]},{"title":"214 Jen Kirkman, Pamela Murphy","link":"https://soundcloud.com/comedybangbang/you-have-to-take-action","author":"","publishedDate":"Wed, 17 Apr 2013 22:03:52 -0700","contentSnippet":"Comedian and author Jen Kirkman explains why she’s never been on the show on today’s b-b-b-bonus episode of Comedy Bang Bang! ...","content":"Comedian and author Jen Kirkman explains why she’s never been on the show on today’s b-b-b-bonus episode of Comedy Bang Bang! Jen talks about her new book \u003ca href\u003d\"http://www.amazon.com/Can-Barely-Take-Care-Myself/dp/1451667000/ref\u003dsr_1_1?ie\u003dUTF8\u0026amp;qid\u003d1366259419\u0026amp;sr\u003d8-1\u0026amp;keywords\u003djen+kirkman\"\u003eI Can Barely Take Care of Myself\u003c/a\u003e, her fear of finding a dead body, and shares an embarrassing story that occurred during Morrissey’s Hollywood High show. Then activist Karen Porter stops by to motivate us to take action and to join Jen in their first game of Would You Rather!","categories":[]},{"title":"213 Jerrod Carmichael, Horatio Sanz","link":"https://soundcloud.com/comedybangbang/star-graves","author":"","publishedDate":"Sun, 14 Apr 2013 18:23:37 -0700","contentSnippet":"Comedian extraordinaire Jerrod Carmichael returns just in time to do his taxes on today’s Comedy Bang Bang! Jerrod shares his ...","content":"Comedian extraordinaire Jerrod Carmichael returns just in time to do his taxes on today’s Comedy Bang Bang! Jerrod shares his love of triumphant white people music, why he saves his checks, and what he’s working on this year. The proprietor of Star Graves, Joe France’s then appears to tell us about the different routes he takes on his dead celebrity tour, the specially tailored tours he would take Scott \u0026amp; Jerrod to, and unbelievable tales of the (possibly late) great Larry Fine. Respect the dead!","categories":[]},{"title":"212 Brendon Walsh, James Adomian, Neil Campbell","link":"https://soundcloud.com/comedybangbang/comedy-bleep-bleep","author":"","publishedDate":"Sun, 07 Apr 2013 20:23:53 -0700","contentSnippet":"Are you [bleep] ready for another [bleep] incredible episode of Comedy Bang Bang? Neil Campbell is taking over co-hosting ...","content":"Are you [bleep] ready for another [bleep] incredible episode of Comedy Bang Bang? Neil Campbell is taking over co-hosting duties today as we welcome back Brendon Walsh aka B Money Dubbz to get a taste of his new comedic persona. Suddenly, Gordon Ramsay himself stops by to tear us a new [bleep] but then calms down to listen to an excerpt of Neil’s new one man show. It’s the kind of episode that will make you [bleep] as you [bleep].","categories":[]},{"title":"211 Jon Hamm, Nick Kroll","link":"https://soundcloud.com/comedybangbang/april-fools","author":"","publishedDate":"Sun, 31 Mar 2013 16:42:08 -0700","contentSnippet":"Happy April Fools! The joke is on us as today’s co-host Nick Kroll joins Scott to talk about Kroll Show season 2, sandwiches, ...","content":"Happy April Fools! The joke is on us as today’s co-host Nick Kroll joins Scott to talk about Kroll Show season 2, sandwiches, and showcase his Christopher Walken impression as they wait for Jon Hamm to arrive. Eventually Jon arrives to chat about the return of Mad Men, shooting the pilot of Mad Men with the crew from The Sopranos, and Capitol One commercials. And if that’s not enough for you, we are introduced to El Chupacabra’s brother El Chupacabro!","categories":[]},{"title":"210 Adam Brody, Lauren Lapkus, Joe Wengert","link":"https://soundcloud.com/comedybangbang/a-spiritual-journey","author":"","publishedDate":"Sun, 24 Mar 2013 18:30:20 -0700","contentSnippet":"Be brave as you join The OC’s Adam Brody and today’s co-host/high school junior Traci Rearden as they go on a spiritual journey ...","content":"Be brave as you join The OC’s Adam Brody and today’s co-host/high school junior Traci Rearden as they go on a spiritual journey to the far off land of Comedy Bang Bang! They’ll talk about piercings, surfing, and what their 50 year plans look like. Spiritual medium Shelby Orangina then stops by to brief us on her short venture into the drink business, help everyone communicate with those who have passed on to another realm, and use her abilities during a game of Would You Rather.","categories":[]},{"title":"209 Don't Stop Or We'll Die, Howard Kremer","link":"https://soundcloud.com/comedybangbang/the-bisco-boys","author":"","publishedDate":"Thu, 21 Mar 2013 18:52:42 -0700","contentSnippet":"Who Charted’s Howard “Dragon Boy Suede” Kremer \u0026amp; fan favorites Paul Rust, Harris Wittels, and Michael Cassady aka Don’t ...","content":"Who Charted’s Howard “Dragon Boy Suede” Kremer \u0026amp; fan favorites Paul Rust, Harris Wittels, and Michael Cassady aka Don’t Stop or We’ll Die are in the studio to jam out in today’s very special musical b-b-b-bonus s-s-s-show! They’ll get into what the future holds for Analyze Phish, why Paul got in trouble for his New No Nos, and debut some new tracks. Fortunately, the guys are pros at a game of Fortunately, Unfortunately. Unfortunately, it gets a little crazy during a game of Would You Rather. Fortunately, we hear Dragon Boy Suede \u0026amp; Don’t Stop Or We’ll Die finally collab!","categories":[]},{"title":"208 Steven Yeun, Doug Benson, Paul F. Tompkins","link":"https://soundcloud.com/comedybangbang/zombie-candles","author":"","publishedDate":"Thu, 21 Mar 2013 18:51:52 -0700","contentSnippet":"The Walking Dead’s Steven Yeun joins the Bang! Bang! universe along with today’s co-host/lover of movies Doug Benson! After a ...","content":"The Walking Dead’s Steven Yeun joins the Bang! Bang! universe along with today’s co-host/lover of movies Doug Benson! After a chat about hair in movies/tv, haunted hotels, and what we can expect on the upcoming episodes of The Walking Dead, our old pal Buddy Valastro aka Cake Boss (Cake Boss) stops by. We’ll hear who are some of the worst pie guys around, the story behind the most erotic cake that Cake Boss has ever made, and a game of Would You Rather for the ages. Check out the full video at \u003ca href\u003d\"http://youtube.com/Earwolf\"\u003eYoutube.com/Earwolf\u003c/a\u003e!","categories":[]},{"title":"207 LIVE from SXSW II;Ken Marino,Rob Huebel,Natasha Leggero,Martin Starr,Reggie Watts,James Adomian","link":"https://soundcloud.com/comedybangbang/live-from-sxsw-2013-ii","author":"","publishedDate":"Thu, 21 Mar 2013 18:51:38 -0700","contentSnippet":"What’s this!? A b-b-b-bonus second episode of Comedy Bang! Bang! recorded live at the South by Southwest Festival! Featuring ...","content":"What’s this!? A b-b-b-bonus second episode of Comedy Bang! Bang! recorded live at the South by Southwest Festival! Featuring co-host Reggie Watts, as well as special guests Ken Marino, Rob Huebel, Natasha Leggero, and Martin Starr of Burning Love. What else could make this better you ask? Maybe Jesse Ventura crashing the party to spout conspiracy theories, wrestle, and join in on a game of Would You Rather will satisfy your podcast needs!","categories":[]},{"title":"206 Live from SXSW 2013; Michael Cera, Sarah Silverman, Tim \u0026 Eric, Reggie Watts","link":"https://soundcloud.com/comedybangbang/live-from-sxsw-2013","author":"","publishedDate":"Thu, 21 Mar 2013 18:51:00 -0700","contentSnippet":"This week’s Comedy Bang Bang was recorded live at the South by Southwest Festival 2013 in Austin, Texas with the stars of Jash! ...","content":"This week’s Comedy Bang Bang was recorded live at the South by Southwest Festival 2013 in Austin, Texas with the stars of Jash! Michael Cera, Sarah Silverman, Tim \u0026amp; Eric, and Reggie Watts join Scott to talk about coming together to form a \u003ca href\u003d\"http://jash.com/\"\u003ecomedy collective\u003c/a\u003e, eating diapers, and to play a game of Would You Rather! Check out the full video at \u003ca href\u003d\"http://youtube.com/Earwolf\"\u003eYoutube.com/Earwolf\u003c/a\u003e!","categories":[]},{"title":"205 Anthony Jeselnik, Eugene Mirman, Nathan Fielder, Eugene Cordero","link":"https://soundcloud.com/comedybangbang/titans-of-comedy","author":"","publishedDate":"Thu, 21 Mar 2013 18:50:45 -0700","contentSnippet":"It’s an all star studded show as Anthony Jeselnik, Eugene Mirman, and Nathan Fielder aka the Titans of Comedy stop by for a ...","content":"It’s an all star studded show as Anthony Jeselnik, Eugene Mirman, and Nathan Fielder aka the Titans of Comedy stop by for a larger than life episode of Comedy Bang! Bang! They talk about Anthony’s new show The Jeselnik Offensive, Nathan’s new show Nathan For You, and offending people on Twitter. Then get ready to smirk \u0026amp; smile as we are joined by Queens barber Jazz Jazz as he tells us about his road trips, his new business idea, and plays a game of Would You Rather?","categories":[]},{"title":"204 Zach Galifianakis, Jon Daly, Neil Campbell","link":"https://soundcloud.com/comedybangbang/the-pepper-men","author":"","publishedDate":"Thu, 21 Mar 2013 18:50:30 -0700","contentSnippet":"Pepper heads rejoice as fan favorites Zach Galifianakis \u0026amp; Jon Daly join us to talk about their Red Hot Chili Peppers fan ...","content":"Pepper heads rejoice as fan favorites Zach Galifianakis \u0026amp; Jon Daly join us to talk about their Red Hot Chili Peppers fan club on today’s Comedy Bang Bang! We get to hear about their podcast devoted to the Chili Peps, the awesome theme song that they sing before every meeting of the fan club, and some unbelievable facts about the Red Hots themselves. Plus, Neil Campbell drops by to tell us about his recent venture into playwriting.","categories":[]},{"title":"203 \"Weird Al\" Yankovic, Paul F. Tompkins","link":"https://soundcloud.com/comedybangbang/the-vicar-of-yanks","author":"","publishedDate":"Thu, 21 Mar 2013 18:50:05 -0700","contentSnippet":"Two immense stars from the world of music, “Weird Al” Yankovic \u0026amp; Lord Andrew Lloyd Webber are on today’s Comedy Bean Bag! ...","content":"Two immense stars from the world of music, “Weird Al” Yankovic \u0026amp; Lord Andrew Lloyd Webber are on today’s Comedy Bean Bag! After chatting with Lord Andrew Lloyd Webber about English accents, the Little Prince, and nautical bed bugs, the Vicar of Yanks himself joins in on the conversation. There will be talk of drugs, what we shouldn’t expect from the next “Weird Al” album, and an intense game of Would You Rather? Homonyms!","categories":[]},{"title":"202 Nick Thune, James Adomian, Lauren Lapkus","link":"https://soundcloud.com/comedybangbang/philip-traumatic-seymour","author":"","publishedDate":"Thu, 21 Mar 2013 18:49:31 -0700","contentSnippet":"Oscar season is upon us so who better to join us than Oscar-nominated actor Philip Seymour Hoffman and fan favorite Nick Thune ...","content":"Oscar season is upon us so who better to join us than Oscar-nominated actor Philip Seymour Hoffman and fan favorite Nick Thune on this week’s bonus episode of Comedy Bang Bang! Philip gives us a preview of his upcoming Orson Welles project right before Scott’s nephew Todd interrupts the program. We then play a game of Fortunately, Unfortunately until a special guest graces us with his presence!","categories":[]},{"title":"201 Jon Glaser, Matt Besser","link":"https://soundcloud.com/comedybangbang/end-scene","author":"","publishedDate":"Thu, 21 Mar 2013 18:49:09 -0700","contentSnippet":"First timer Jon Glaser and past guest Pope Benedict XVI join us to talk finales on today’s Comedy Bang Bang! Jon gives a taste ...","content":"First timer Jon Glaser and past guest Pope Benedict XVI join us to talk finales on today’s Comedy Bang Bang! Jon gives a taste of what we can expect on the Delocated series finale and where his role on Parks and Recreation might possibly lead. Pope Benedict XVI tells us some of the reasons why he is retiring, what he will do now as the Grand Wizard, and shares some of his best impressions. Then they ponder their favorite ways to blow kisses during a super stuffed game of Would You Rather!","categories":[]},{"title":"200 Jason Mantzoukas, Andy Daly","link":"https://soundcloud.com/comedybangbang/halfway-to-china","author":"","publishedDate":"Thu, 21 Mar 2013 18:48:38 -0700","contentSnippet":"Happy 200th episode of Comedy Bang Bang! Take a break from reading the funny papers and tune in as Jason Mantzoukas joins Scott ...","content":"Happy 200th episode of Comedy Bang Bang! Take a break from reading the funny papers and tune in as Jason Mantzoukas joins Scott to talk about his role on Enlightened, movie theater handies, and anything else in the news. Old friend Don Dimello sends over the snake skin wearing Cactus Tony to shed some light on the recent controversy at the daycare he runs during Don’s late night productions, tells us about his one year of service for the Croatian armed services, and gives us a look into his other job at the Arclight theater. Check out the full video at \u003ca href\u003d\"http://youtube.com/Earwolf\"\u003eYoutube.com/Earwolf\u003c/a\u003e!","categories":[]},{"title":"199 Gillian Jacobs, Paul F. Tompkins","link":"https://soundcloud.com/comedybangbang/garry-unmarried","author":"","publishedDate":"Thu, 21 Mar 2013 18:48:20 -0700","contentSnippet":"Old pals Gillian Jacobs and Garry Marshall return to give us an update on their relationship on today’s Comedy Bing Bong! Want ...","content":"Old pals Gillian Jacobs and Garry Marshall return to give us an update on their relationship on today’s Comedy Bing Bong! Want to know what went wrong in their marriage? How about the truth behind Garry’s deceased wife Barbara? Will there be enough cursing for Garry’s grandkids to enjoy? All these questions will be answered including a very competitive game of Would You Rather?!","categories":[]},{"title":"198 Jeffrey Ross, Ron Sexsmith, Amy Phillips, Neil Campbell","link":"https://soundcloud.com/comedybangbang/arent-you-glad","author":"","publishedDate":"Thu, 21 Mar 2013 18:48:01 -0700","contentSnippet":"Aren’t you glad that the Roastmaster General Jeffrey Ross and Canadian singer-songwriter Ron Sexsmith are making their Comedy ...","content":"Aren’t you glad that the Roastmaster General Jeffrey Ross and Canadian singer-songwriter Ron Sexsmith are making their Comedy Bang Bang debut!? That’s not all, Sarah Silverman joins us to sing some of her telegrams and author Cam Billmoth reads an excerpt from his new book Letters To Mom. Plus, we play a heated game of Would You Rather? and Ron treats us to a song from his new album “Forever Endeavour.”","categories":[]},{"title":"197 Tim Heidecker, Paul Rust, Jon Daly","link":"https://soundcloud.com/comedybangbang/please-claire-ify","author":"","publishedDate":"Thu, 21 Mar 2013 18:47:46 -0700","contentSnippet":"Tim Heidecker is here to tell us about his new venture as Vice President of Alternative Merchandising for The Who on this ...","content":"Tim Heidecker is here to tell us about his new venture as Vice President of Alternative Merchandising for The Who on this week’s Comedy Bang Bang! Paul Rust is our cheesed off co-host who helps Scott demystify some American myths and brings in some brand new New No-Nos. Bill Cosby-Bukowski also drops by to talk about his love of Kroll Show, explain exactly what #230pst is, and performs a special inauguration inspired Jelloem. Plus, Tim becomes George Burns during a game of Would You Rather?","categories":[]},{"title":"196 Jeff Garlin, James Adomian","link":"https://soundcloud.com/comedybangbang/a-different-huelliverse","author":"","publishedDate":"Thu, 21 Mar 2013 18:47:31 -0700","contentSnippet":"Jeff Garlin is back on today’s special Thursday episode of Comedy Bang Bang! Jeff explains why sarcasm is easiest thing to do ...","content":"Jeff Garlin is back on today’s special Thursday episode of Comedy Bang Bang! Jeff explains why sarcasm is easiest thing to do in comedy, does some of his favorite impressions, and tells us about his new podcast \u003ca href\u003d\"http://www.earwolf.com/show/by-the-way-in-conversation-with-jeff-garlin/\"\u003eBy The Way, In Conversation with Jeff Garlin\u003c/a\u003e. The ghost of Huell Howser appears to share what the afterlife is like, he takes Scott \u0026amp; Jeff through time, and says his final farewell.","categories":[]},{"title":"195 Billy Eichner, Reggie Watts, Matt Besser","link":"https://soundcloud.com/comedybangbang/making-the-snow-angel","author":"","publishedDate":"Thu, 21 Mar 2013 18:47:06 -0700","contentSnippet":"Out of the street and into the studio, Billy Eichner of Funny or Die’s Billy on the Street is on today’s Comedy Bang Bang! ...","content":"Out of the street and into the studio, Billy Eichner of Funny or Die’s Billy on the Street is on today’s Comedy Bang Bang! Billy shares his take on George Carlin’s “Stuff” routine, explains where the idea for his show came about, and tells us about meeting Meryl Streep. Scott’s partner in crime Reggie Watts stops by to treat us to some brand new fresh sounds for 2013. The one and only Frosty the Snowman has a short time with us to talk about his failed show Catch Me If You Can, his current problem with an officer, and joins Billy \u0026amp; Reggie for a super sized game of Would You Rather?","categories":[]},{"title":"194 Nick Kroll, Chelsea Peretti","link":"https://soundcloud.com/comedybangbang/me-gusta-characters","author":"","publishedDate":"Thu, 21 Mar 2013 18:46:35 -0700","contentSnippet":"Friends of the show, Nick Kroll and Chelsea Peretti are here for a character filled episode of Comedy Bang Bang! Chelsea tells ...","content":"Friends of the show, Nick Kroll and Chelsea Peretti are here for a character filled episode of Comedy Bang Bang! Chelsea tells us about her recent nauseating airplane experience and Nick quickly lets us know what to expect on the upcoming Kroll Show before having to leave. Luckily our open door policy is still in effect so Chelsea’s ex-boyfriend Chance stops by to read us some of his spoken word poetry, El Chupacabra brings along Baby to reunite with his paternal twin Tootie, and Fabrice Fabrice demands to not be censored during a game of Would You Rather? KOO KOO RI-KOO!!","categories":[]},{"title":"193 Kristen Schaal, Neil Campbell, Pamela Murphy","link":"https://soundcloud.com/comedybangbang/what-else-what-else","author":"","publishedDate":"Thu, 21 Mar 2013 18:46:21 -0700","contentSnippet":"Kristen Schaal makes her first in-studio appearance on today’s special Thursday episode of Comedy Bang Bang! Kristen schools ...","content":"Kristen Schaal makes her first in-studio appearance on today’s special Thursday episode of Comedy Bang Bang! Kristen schools co-host Nancy Cooper on rare pennies, microphone techniques, and invites her to Los Angeles for a 24 hour comedy training experience. Teenager Rick Faber then stops by to share his true feelings about being an awful teenager, some of the terrible antics his group of friends have gotten into, and has a confession to make during a game of Would You Rather?","categories":[]},{"title":"192 Ben Schwartz, Horatio Sanz","link":"https://soundcloud.com/comedybangbang/goodfelines","author":"","publishedDate":"Thu, 21 Mar 2013 18:46:01 -0700","contentSnippet":"Fan favorite and “House of Pies” star Ben Schwartz tells us about his plans for the new year on today’s Comedy Bang Bang! Ben ...","content":"Fan favorite and “House of Pies” star Ben Schwartz tells us about his plans for the new year on today’s Comedy Bang Bang! Ben \u0026amp; Scott recall performing together in Ben’s improv show “Snowpants,” recreate Ben’s favorite Bane sketch, and talk about wet dreams. Newcomer to the show Shelly Driftwood drops by to share some incredible stories from his life that involve his buddy relationship with Brett Butler, Easter Island, and a rolling affair. Plus, Shelly Driftwood tells us about his script “GoodFelines” during a game of Would You Rather?","categories":[]},{"title":"2012 Holiday Spectacular","link":"https://soundcloud.com/comedybangbang/2012-holiday-spectacular","author":"","publishedDate":"Thu, 21 Mar 2013 18:45:39 -0700","contentSnippet":"It’s that time of year where you try to not get burned when roasting chestnuts over an open fire and have the whole family ...","content":"It’s that time of year where you try to not get burned when roasting chestnuts over an open fire and have the whole family gather round the ol’ computer for a special holiday podcast treat! Scott welcomes fan favorite Harris Wittels as he tells us about his new book/stocking stuffer \u003ca href\u003d\"http://www.amazon.com/Humblebrag-The-Art-False-Modesty/dp/1455514187/ref\u003dsr_1_1?ie\u003dUTF8\u0026amp;qid\u003d1355642967\u0026amp;sr\u003d8-1\u0026amp;keywords\u003dhumblebrag\"\u003eHumblebrag: The Art of False Modesty\u003c/a\u003e and showcases a brand new edition of Harris’ Foam Corner. Bjork, Neil Young, and Billy Braggart serenade us with some holiday cheer and Paul Rust has a couple of New Ho Ho Hos for us. Ice-T gives us a history lesson on Santa Claus and Bill Cosby-Bukowski makes up a holiday themed Jelloem. Then first timer Liz joins in on the festivities to talk about her new reality show “Publicity.” Merry Christmas!","categories":[]},{"title":"190 Demetri Martin, James Adomian, Pamela Murphy","link":"https://soundcloud.com/comedybangbang/you-know-what-i-mean","author":"","publishedDate":"Thu, 21 Mar 2013 18:35:22 -0700","contentSnippet":"Did you ever notice that Demetri Martin has never been on Comedy Bang Bang? Well Demetri is here in studio to tell us about ...","content":"Did you ever notice that Demetri Martin has never been on Comedy Bang Bang? Well Demetri is here in studio to tell us about growing up in the Jersey Shore, gift giving, and how he celebrates the holidays. Don’t you hate it when the ghost of Orson Welles appears to warn us about the end of the world? At least stand up comedian Nancy Cooper drops by to cheer us up with some of her observational jokes. You know what I mean? Woof Woof!","categories":[]},{"title":"189 Chris Fairbanks, Paul F. Tompkins","link":"https://soundcloud.com/comedybangbang/the-pancake-man","author":"","publishedDate":"Thu, 21 Mar 2013 18:12:23 -0700","contentSnippet":"One of our favorite film directors Werner Herzog and one of America’s favorite comedians Chris Fairbanks are here on today’s ...","content":"One of our favorite film directors Werner Herzog and one of America’s favorite comedians Chris Fairbanks are here on today’s Comedy Bang Bang! Werner lets us know about his upcoming acting debut and Chris reveals the truth behind pancakes and flapjacks. Will Werner give up directing? Why are pancakes plaguing the nation? Does role play come into a game of Would You Rather? All these questions and more will be answered once you give this episode a listen!","categories":[]},{"title":"188 Judd Apatow, Graham Parker, Jessica St. Clair","link":"https://soundcloud.com/comedybangbang/attack-of-the-shits","author":"","publishedDate":"Thu, 21 Mar 2013 18:12:02 -0700","contentSnippet":"Comedy Maestro Judd Apatow is here for his very first appearance on Comedy Bang Bang! 16 Year-Old Intern Marissa Wompler joins ...","content":"Comedy Maestro Judd Apatow is here for his very first appearance on Comedy Bang Bang! 16 Year-Old Intern Marissa Wompler joins us as well for a discussion about inviting herself over Judd’s for a sleepover with his daughter Maude, his new film This Is 40, and his first time meeting Albert Brooks. Also, Judd lends an ear to Marissa’s recent incident during Spook Fest, talks about having his kids in his movies, and plays a game of Would You Rather? Plus, Graham Parker stops by to tell us about his reunion with the Rumour, how he got involved with Judd Apatow, and plays a song off his latest album “Three Chords Good.” Womp up the volume! Don't forget to \u003ca title\u003d\"Comedy Bang Bang Best Of Poll\" href\u003d\"http://blog.earwolf.com/post/36579477815\"\u003evote on the Comedy Bang Bang Best Of poll\u003c/a\u003e!","categories":[]},{"title":"187 Nat Faxon, Lennon Parham","link":"https://soundcloud.com/comedybangbang/finger-chimes","author":"","publishedDate":"Thu, 21 Mar 2013 18:11:38 -0700","contentSnippet":"Academy Award-winner Nat Faxon reveals his most secret pain on today’s Comedy Bang Bang! Special co-host/DJ Forsythia drops by ...","content":"Academy Award-winner Nat Faxon reveals his most secret pain on today’s Comedy Bang Bang! Special co-host/DJ Forsythia drops by to bring up listenership to her late night radio show, lifts spirits by playing some of her favorite songs, and tells us about the struggles of becoming a woman at the age of 14. Also, Nat describes the premise of the show Ben and Kate, shares the truth behind Hall \u0026amp; Oates’ “I Can’t Go For That,” and talks about his pet collection. Plus, Forsythia has something to tell her mother during a game of Would You Rather?","categories":[]},{"title":"186 Paul F. Tompkins, Julie Klausner, Jake Fogelnest","link":"https://soundcloud.com/comedybangbang/new-york-mainstays","author":"","publishedDate":"Thu, 21 Mar 2013 18:11:10 -0700","contentSnippet":"Fellow podcasters and first timers Julie Klausner and Jake Fogelnest are here on today’s Comedy Bang Bang! Jake \u0026amp; Julie ...","content":"Fellow podcasters and first timers Julie Klausner and Jake Fogelnest are here on today’s Comedy Bang Bang! Jake \u0026amp; Julie recall the first time they met, each describe their podcasts “The Fogelnest Files” and “How Was Your Week” respectively, and share their love of BuzzFeed’s Katie Notopoulos. Garry Marshall returns to reveal his secret name, tell us about his new family sitcom based on The Trachtenburg Family Slideshow Players, and plays a game of Would You Rather? You will hear tales of Garry’s past and we\u0026#39;ll finally answer the age old question as to if there is indeed a Scope brand toothpaste.","categories":[]},{"title":"185 Chris Hardwick, Ike Barinholtz","link":"https://soundcloud.com/comedybangbang/cum-scanners","author":"","publishedDate":"Thu, 21 Mar 2013 17:39:15 -0700","contentSnippet":"Every once in a while a bro might want to come hang out so who better to stop by than the Nerdist himself Chris Hardwick on ...","content":"Every once in a while a bro might want to come hang out so who better to stop by than the Nerdist himself Chris Hardwick on today’s special mid-week episode of Comedy Bang Bang! Chris tells us about his upcoming Comedy Central special Mandroid, explains the meaning of dookie cookie, and answers the question as to why priests can’t marry. The always hilarious stand-up comedian JT McDowell drops by to hit the turf, showcase his Julia Child impression, and play a game of Would You Rather? that will make you say WTF!","categories":[]},{"title":"184 Aziz Ansari, Bob Odenkirk, Neil Campbell, Mike Hanford, James Adomian","link":"https://soundcloud.com/comedybangbang/pop-and-politics","author":"","publishedDate":"Thu, 21 Mar 2013 17:38:54 -0700","contentSnippet":"Parks and Recreation’s Aziz Ansari returns for today’s special election episode of Comedy Bang Bang! Aziz talks about the ...","content":"Parks and Recreation’s Aziz Ansari returns for today’s special election episode of Comedy Bang Bang! Aziz talks about the inspiration behind his tour Buried Alive, the cast on Parks \u0026amp; Rec, and being scared of Gout. Bob Odenkirk, Mike Hanford, and Neil Campbell stop by to reunite with Scott as the political parodists The Washington Monugents to tickle some ribs and kick out some topical jams. Also joining us is political commentator Pat Buchanan who tells us his feelings on this election and plays a game of Would You Rather?","categories":[]},{"title":"183 Halloween, Brett Gelman, Jon Daly, Allan McLeod, James Adomian","link":"https://soundcloud.com/comedybangbang/return-to-suicide-house","author":"","publishedDate":"Thu, 21 Mar 2013 17:38:34 -0700","contentSnippet":"It looks like Scott Achingman has stumbled upon the Werewolf Studios once more to find himself inside of Suicide House with ...","content":"It looks like Scott Achingman has stumbled upon the Werewolf Studios once more to find himself inside of Suicide House with none other than the dreadful Beuford and Messmore le Barron. After some catching up, they are joined by Caine Sherman of the Historical Society to tour Suicide House and figure out if it deserves to have historical status. However, the tour is interrupted by Beuford \u0026amp; Messmore’s father Maximilian Blanc who reveals the many others trapped within the many doors of Suicide House. Will Suicide House get historical status? Will Ghost Boy make an appearance? Will we break a record with the Freestyle Rap Contest? You’ll have to listen to Comedy Fang Fang to find out!","categories":[]},{"title":"182 Tim Heidecker, Joe Wengert, Lauren Lapkus","link":"https://soundcloud.com/comedybangbang/repeat-your-keyword","author":"","publishedDate":"Thu, 21 Mar 2013 17:38:05 -0700","contentSnippet":"It’s more Bang Bang for your buck buck on today’s special Wednesday episode of Comedy Bang Bang! Friend of the show and star of ...","content":"It’s more Bang Bang for your buck buck on today’s special Wednesday episode of Comedy Bang Bang! Friend of the show and star of the upcoming film The Comedy, Tim Heidecker returns to tell us about the failed pilot of his popular comic strip Stitches, gives us a little insight on his upcoming film The Comedy, and talks about his opportunity to portray Paul Rodgers in the forthcoming Bad Company quadrilogy. Newcomers Arthur Steinborn \u0026amp; Diane stop by to share their favorite Stitches comic strips, we try to find Diane a date, and Arthur explains his system to remember anyone’s name. Jackpot.","categories":[]},{"title":"181 Casey Wilson, Adam Pally","link":"https://soundcloud.com/comedybangbang/happy-endings","author":"","publishedDate":"Thu, 21 Mar 2013 17:37:43 -0700","contentSnippet":"Two cast members from the hit ABC show Happy Endings, Casey Wilson and Adam Pally came to play on this week’s Comedy Bang Bang! ...","content":"Two cast members from the hit ABC show Happy Endings, Casey Wilson and Adam Pally came to play on this week’s Comedy Bang Bang! Adam \u0026amp; Casey share stories of their parents, talk couples Halloween costumes, and give us a little taste of what to expect on the new season of Happy Endings. Unfortunately, Casey becomes terrified during our women themed Freestyle Rap Battle. Fortunately, she redeems herself with a Sex and the City impression off during a game of Would You Rather?","categories":[]},{"title":"180 Gillian Jacobs, Paul F. Tompkins, Lauren Lapkus","link":"https://soundcloud.com/comedybangbang/friends-without-words","author":"","publishedDate":"Thu, 21 Mar 2013 17:37:29 -0700","contentSnippet":"Community’s Gillian Jacobs returns to bury the hatchet with Scott on today’s Comedy Bang Bang! Gillian brings awareness to the ...","content":"Community’s Gillian Jacobs returns to bury the hatchet with Scott on today’s Comedy Bang Bang! Gillian brings awareness to the fact that the Zynga corporation is out to get her and wedding bells are heard when she falls for co-host Garry Marshall. Also joining us is first time guest and college senior Tracy to share what she learned on her travels in Italy. Will the newly married Garry \u0026amp; Gillian prevail over Tracy in a game of Would You Rather? You will have to listen to find out!","categories":[]},{"title":"179 Adam DeVine, Paul Scheer, Kay Cannon, Hana Mae Lee","link":"https://soundcloud.com/comedybangbang/pitch-slapped","author":"","publishedDate":"Thu, 21 Mar 2013 17:37:12 -0700","contentSnippet":"We’re devoting today’s very special episode of Comedy Bang Bang to the movie Pitch Perfect! Writer of the film Kay Cannon and ...","content":"We’re devoting today’s very special episode of Comedy Bang Bang to the movie Pitch Perfect! Writer of the film Kay Cannon and stars Adam DeVine \u0026amp; Hana Mae Lee join us to discuss pool scenes, target demographics, and which songs were sung for the auditions. That’s not all, studio rep Scott Jeffries returns to express his excitement for Pitch Perfect, explains how he got involved with Scientology, and plays a game of Would You Rather? with us that will surely make you shit your pants!","categories":[]},{"title":"178 Rob Corddry, Jessica St. Clair","link":"https://soundcloud.com/comedybangbang/motor-boating-around-town","author":"","publishedDate":"Thu, 21 Mar 2013 17:36:56 -0700","contentSnippet":"School's back in session so it was only a matter of time before our 16 year-old intern Marissa Wompler made her way back to the ...","content":"School's back in session so it was only a matter of time before our 16 year-old intern Marissa Wompler made her way back to the studio to help co-host today’s Comedy Bang Bang! Marissa gets schooled on Grimace, The Fat Boys and motor boating by none other than Rob Corddry! Rob also offers Marissa some expert advice on her recent heartbreak. Plus, we get one special turd of information about what’s to come up on the season finale of Childrens Hospital. Womp It Up!","categories":[]},{"title":"177 B.J. Novak, Wyatt Cenac, Keegan-Michael Key, Jordan Peele","link":"https://soundcloud.com/comedybangbang/penises-abounding","author":"","publishedDate":"Thu, 21 Mar 2013 17:36:26 -0700","contentSnippet":"A star studded panel of guests who haven’t been on the show due to geographical reasons, B.J. Novak and Wyatt Cenac join us for ...","content":"A star studded panel of guests who haven’t been on the show due to geographical reasons, B.J. Novak and Wyatt Cenac join us for today’s Comedy Bang Bang! We talk to B.J. about leaving The Office and Wyatt Cenac tells us what is coming up on The Daily Show. We also welcome internet critics Van Davion and Mike Smith to share some insights on how television can be funnier. Plus, we play a riveting game of Would You Rather? Don’t forget to tip your mailman!","categories":[]},{"title":"176 Amy Poehler, Jason Mantzoukas, James Adomian","link":"https://soundcloud.com/comedybangbang/out-of-bleeps","author":"","publishedDate":"Thu, 21 Mar 2013 17:35:52 -0700","contentSnippet":"The funniest person in the universe, Amy Poehler, reveals which foreign show that Parks and Recreation is based on this week on ...","content":"The funniest person in the universe, Amy Poehler, reveals which foreign show that Parks and Recreation is based on this week on Comedy Bang Bang! Fan favorite Jason Mantzoukas uses his co-hosting duties to help countdown the Twelve Days of the Emmys, obsess about thirtysomething, and talk politics. Talk radio host Tom Leykis drops by as well to share the ins and outs of Leykis 101. We play a new game called Speed Round and show off our skills during the Freestyle Rap Battle. Plus, a irresistibly delicious game of Would You Rather?","categories":[]},{"title":"175 Justin Kirk, Paul F. Tompkins","link":"https://soundcloud.com/comedybangbang/mop-water","author":"","publishedDate":"Thu, 21 Mar 2013 17:35:35 -0700","contentSnippet":"The Fall Season is upon us and who better to join us other than star of stage and screen Justin Kirk! Justin stops by to talk ...","content":"The Fall Season is upon us and who better to join us other than star of stage and screen Justin Kirk! Justin stops by to talk about his new show Animal Practice, working on Angels in America, and his first role in the theatre. We are also joined by the mysterious Mike the Janitor who might have a connection to Andrew Lloyd Webber. Don’t forget to pick up the \u003ca href\u003d\"http://store.earwolf.com/collections/featured/products/comedy-bang-bang-2012-live-tour\"\u003eComedy Bang! Bang! LIVE Summer Tour\u003c/a\u003e episodes!","categories":[]},{"title":"174 Lizzy Caplan, John Mulaney, Nick Kroll","link":"https://soundcloud.com/comedybangbang/series-regulars","author":"","publishedDate":"Thu, 21 Mar 2013 17:35:12 -0700","contentSnippet":"Oh, hello Comedy Bang Bang listeners. First time guest Lizzy Caplan joins us this week with return guests John Mulaney and Nick ...","content":"Oh, hello Comedy Bang Bang listeners. First time guest Lizzy Caplan joins us this week with return guests John Mulaney and Nick Kroll! They discuss Lizzy’s new film The Bachelorette, more info on the Party Down movie, and LL Cool Jason Alexander. Series regulars, George St Geegland \u0026amp; Gil Faizon drop in to talk about auditioning for The Newsroom, their new show Black Shenanigans, and Robert Evans’s barf. Plus, a ghostly game of Would You Rather? Don’t forget to pick up the Comedy Bang! Bang! LIVE Summer Tour episodes!","categories":[]},{"title":"173 Paul F. Tompkins, Paul Scheer, Brent Weinbach","link":"https://soundcloud.com/comedybangbang/ride-like-hell","author":"","publishedDate":"Thu, 21 Mar 2013 17:34:44 -0700","contentSnippet":"This week’s Comedy Bang Bang is a special co-host edition with none other than Werner Herzog! We’re also treated to the R\u0026amp;B ...","content":"This week’s Comedy Bang Bang is a special co-host edition with none other than Werner Herzog! We’re also treated to the R\u0026amp;B stylings of the crowd pleasing Brent Weinbach! That’s not all, producer Scott Jeffries drops by to help keep the show on track and to promote the film Premium Rush. Plus, the guys become buddies during a game of Would You Rather? Don’t forget to pick up the \u003ca href\u003d\"http://store.earwolf.com/collections/featured/products/comedy-bang-bang-2012-live-tour\"\u003eComedy Bang! Bang! LIVE Summer Tour\u003c/a\u003e episodes!","categories":[]},{"title":"172 Todd Glass, Brian Huskey","link":"https://soundcloud.com/comedybangbang/this-is-a-safe-zone","author":"","publishedDate":"Thu, 21 Mar 2013 17:34:26 -0700","contentSnippet":"Scott is back from the Comedy Bang! Bang! tour and brings one of the best guests you can get on a show, Todd Glass! Todd joins ...","content":"Scott is back from the Comedy Bang! Bang! tour and brings one of the best guests you can get on a show, Todd Glass! Todd joins us with his own jingle, shares how he took a bit too many pot cookies, and discusses his stance on spanking jokes. Plus, we welcome children’s book author Glenn Maxx to the safe zone to talk about his multi-part saga and to read an excerpt of his book for the first time. Don’t forget to pick up the \u003ca href\u003d\"http://store.earwolf.com/collections/featured/products/comedy-bang-bang-2012-live-tour\"\u003eComedy Bang! Bang! LIVE Summer Tour\u003c/a\u003e episodes!","categories":[]},{"title":"171 Megan Mullally, Nick Kroll, Stephanie Hunt","link":"https://soundcloud.com/comedybangbang/scrog-secretions","author":"","publishedDate":"Thu, 21 Mar 2013 17:34:12 -0700","contentSnippet":"Today’s episode of Comedy Bang Bang is an episode of firsts! Childrens Hospital‘s Megan Mullally makes her first appearance on ...","content":"Today’s episode of Comedy Bang Bang is an episode of firsts! Childrens Hospital‘s Megan Mullally makes her first appearance on the program to talk Emmy nominations, the Party Down movie, and her musical group Nancy and Beth. The other half of Nancy and Beth, Stephanie Hunt, joins us as well for the first time to accompany Megan in serenading us with magical songs that will be sure to make you whistle. That’s not all, we welcome energy expert David Eros for the first time to the show to give spiritual interpretations to Scott, Megan, Stephanie, and El Chupacabra! Don’t forget to pick up the \u003ca href\u003d\"http://store.earwolf.com/collections/featured/products/comedy-bang-bang-2012-live-tour\"\u003eComedy Bang! Bang! LIVE Summer Tour\u003c/a\u003e episodes!","categories":[]},{"title":"170 Martin Starr, Lennon Parham, Neil Campbell","link":"https://soundcloud.com/comedybangbang/new-scoop","author":"","publishedDate":"Thu, 21 Mar 2013 17:33:42 -0700","contentSnippet":"Word on the street is that Martin Starr of Freaks and Geeks, Party Down, and NTSF:SD:SUV:: is a first time guest on this week’s ...","content":"Word on the street is that Martin Starr of Freaks and Geeks, Party Down, and NTSF:SD:SUV:: is a first time guest on this week’s Comedy Bang Bang! You didn’t hear it from me but Martin joins Scott for a text session with David Caruso, to showcase his remix abilities, and some robot talk. Rumor has it that Scott pays a favor to his great aunt by welcoming another first time guest, Ethel Branscome to share a special announcement! No clues to who the third guest could be except that their name is spelled EXACTLY the same as Neil Campbell and that he drops in to read some Gossip Blind Items! Sources say that you should also warm up your sniffers for a salacious game of Would You Rather? Don’t forget to pick up the \u003ca href\u003d\"http://store.earwolf.com/collections/featured/products/comedy-bang-bang-2012-live-tour\"\u003eComedy Bang! Bang! LIVE Summer Tour\u003c/a\u003e episodes!","categories":[]},{"title":"169 Jay Chandrasekhar, Paul F. Tompkins","link":"https://soundcloud.com/comedybangbang/immortal-mustache","author":"","publishedDate":"Thu, 21 Mar 2013 17:33:22 -0700","contentSnippet":"The owner of one of the five one-way tickets used to board the Rocket Ship to Fame, Broken Lizard’s Jay Chandrasekhar makes his ...","content":"The owner of one of the five one-way tickets used to board the Rocket Ship to Fame, Broken Lizard’s Jay Chandrasekhar makes his first appearance! He talks about his early sketch days, the importance of mustaches, how Super Troopers almost never existed, and his new movie The Babymakers. Also, the return of the Cake Boss himself, Buddy Valastro joins Scott and Jay to reveal the secret of cheesecake, answer the question of how long he’s been making cakes, and to scream and yell about his appearance on Comedy Bang! Bang! the TV show where he was asked to scream and yell. All of this including a hellish game of Would You Rather? Don't forget to pick up the \u003ca href\u003d\"http://store.earwolf.com/collections/featured/products/comedy-bang-bang-2012-live-tour\"\u003eComedy Bang! Bang! LIVE Summer Tour\u003c/a\u003e episodes!","categories":[]},{"title":"168 Bob Odenkirk, Matt Besser","link":"https://soundcloud.com/comedybangbang/breaking-bread","author":"","publishedDate":"Thu, 21 Mar 2013 17:33:07 -0700","contentSnippet":"Today's episode of Comedy Bang Bang will bring you revelations from two of the most famous and powerful men in the world. ...","content":"Today's episode of Comedy Bang Bang will bring you revelations from two of the most famous and powerful men in the world. That's maybe an overstatement, but if you're a fan of Mr. Show or Breaking Bad than you'll be hanging onto every word as Bob Odenkirk treats listeners to some tasty tidbits of Breaking Bad gossip and several brand new sketches written by the Mr. Show team. Joining Bob is a man known the world over for his relationship with the big man upstairs and the little boys in the congregation: Pope Benedict XVI! He teaches Scott and Bob a thing or two about joke writing and indulges us in a round of Would You Rather. Visit the Earwolf store to pick up the first of the Comedy Bang! Bang! Summer 2012 Tour downloads featuring Brett Gelman and Jon Daly.","categories":[]},{"title":"167 Jessica St. Clair, Paul Rust, Jerrod Carmichael","link":"https://soundcloud.com/comedybangbang/new-no-nos","author":"","publishedDate":"Thu, 21 Mar 2013 17:32:51 -0700","contentSnippet":"Intern Marissa Wompler, fear-based comic Jerrod Carmichael, and controversial comedian Paul Rust join Scott in a riveting ...","content":"Intern Marissa Wompler, fear-based comic Jerrod Carmichael, and controversial comedian Paul Rust join Scott in a riveting discussion of penis pencils, politics, and a game of Would You Rather. New No-No: If you’re going to listen to this podcast, then guess what! We get to make you laugh. That’s what you get for listening! Who’s laughing now? You are!","categories":[]},{"title":"166 Adam Scott, Harris Wittels, Chelsea Peretti","link":"https://soundcloud.com/comedybangbang/farts-and-procreation-2","author":"","publishedDate":"Thu, 21 Mar 2013 17:32:37 -0700","contentSnippet":"Last year, an episode of Comedy Bang Bang was made that, to put it simply, changed the world. Nearly a year later, can the ...","content":"Last year, an episode of Comedy Bang Bang was made that, to put it simply, changed the world. Nearly a year later, can the magic be replicated? We've brought back Harris Wittels, Adam Scott, and Chelsea Peretti, and they're here for more songs, characters, foam, two-man shows, life advice, and plugs! Is the world ready to be changed again? It better be!","categories":[]},{"title":"165 Andy Kindler, Loudon Wainwright III, Amy Phillips","link":"https://soundcloud.com/comedybangbang/hoo-ah","author":"","publishedDate":"Thu, 21 Mar 2013 17:32:20 -0700","contentSnippet":"Need a cleansing experience, in addition to your 8-to-12-week smoothie diet? This week's show has everything you need to purge ...","content":"Need a cleansing experience, in addition to your 8-to-12-week smoothie diet? This week's show has everything you need to purge the soul. Andy Kindler trots out his Jay Leno and Al Pacino impersonations, Loudon Wainwright III performs several songs off his new album \"\u003ca title\u003d\"Amazon - Older Than My Old Man Now\" href\u003d\"http://www.amazon.com/Older-Than-Old-Man-Explicit/dp/B007HI8M9O/ref\u003dsr_1_2?ie\u003dUTF8\u0026amp;qid\u003d1341174733\u0026amp;sr\u003d8-2\u0026amp;keywords\u003dOlder+Than+My+Old+Man+Now\"\u003eOlder Than My Old Man Now\u003c/a\u003e,\" and Oscar winner (Sir?) Gwyneth Paltrow, wife of Chris \"Coldplay\" Martin, honors us with her presence. Plus, the group plays Who Said It! Hee hee! Shamone! Dah!","categories":[]},{"title":"164 Tony Clifton, Ben Schwartz","link":"https://soundcloud.com/comedybangbang/clifton-was-here","author":"","publishedDate":"Thu, 21 Mar 2013 17:31:54 -0700","contentSnippet":"International Singing Sensation Tony Clifton, joined by Cliftonettes Maxim and Phoenix, tells exclusive stories about Andy ...","content":"International Singing Sensation Tony Clifton, joined by Cliftonettes Maxim and Phoenix, tells exclusive stories about Andy Kaufman, Jim Carrey, and Nicolas Cage, as well as cracking some off-color jokes. Plus, \"House of Pies\" star Ben Schwartz competes head-to-head against Scott in a cutthroat game of What Am I Thinking. Don't forget to pick up your tickets to \u003ca title\u003d\"Comedy Bang! Bang! LIVE\" href\u003d\"http://www.ifc.com/shows/comedy-bang-bang/tour\"\u003eComedy Bang! Bang! LIVE\u003c/a\u003e in a city near you!","categories":[]},{"title":"163 Ken Marino, Steve Agee, Janet Varney, Deanna Russo","link":"https://soundcloud.com/comedybangbang/burning-love","author":"","publishedDate":"Thu, 21 Mar 2013 17:31:37 -0700","contentSnippet":"Today's audio sound recording of Comedy Bang Bang is the perfect companion to everyone's favorite reality show, Burning Love! ...","content":"Today's audio sound recording of Comedy Bang Bang is the perfect companion to everyone's favorite reality show, Burning Love! Mark Orlando and two of his lovely lady suitors, Carly and Tamara G, are joining Scott to answer the tough questions: Can a monkey heart love like a human one? What should you do about hard-to-hide boners? What happens when the rules of Would You Rather?, like the rules of love, are shaken? All accompanied by commentary from Steve Agee, today's episode will fill you with lust, love, and laughs.\n\u003ca href\u003d\"http://www.ifc.com/\"\u003e Click here\u003c/a\u003e for more info about the upcoming Comedy Bang! Bang! LIVE tour! Bad bye!","categories":[]},{"title":"162 Andy Samberg, Adam Pally","link":"https://soundcloud.com/comedybangbang/best-bro-hang","author":"","publishedDate":"Thu, 21 Mar 2013 17:31:21 -0700","contentSnippet":"The bros are back in town! Andy Samberg, whose film That's My Boy opens this weekend, and Scott's weed dealer Bro have ...","content":"The bros are back in town! Andy Samberg, whose film That's My Boy opens this weekend, and Scott's weed dealer Bro have reunited, and this time they have a good rapport (unless you were to ask Bro about it). The boys talk Hangin' with Mr. Cooper, Bro's paradise, and Woody Allen. Plus the debut of a new feature, \"Bobby Moynihan Talk.\" This is a good week to be a bro!","categories":[]},{"title":"161 Reggie Watts,Tim Heidecker,Andy Daly,Jon Daly","link":"https://soundcloud.com/comedybangbang/highly-illogical","author":"","publishedDate":"Thu, 21 Mar 2013 17:30:55 -0700","contentSnippet":"Comedy Bang! Bang! on IFC has been a long time coming and in less than a week you'll be able to catch the premiere! To ease the ...","content":"Comedy Bang! Bang! on IFC has been a long time coming and in less than a week you'll be able to catch the premiere! To ease the pain of the wait, we're bringing you a full week of Earwolf podcasts heralding the show's arrival. I know it's highly illogical, but we've brought in bandleader Reggie Watts and producer/guest Tim Heidecker to talk to two of the the interesting strangers who made their way from the podcast to the television show. Stay tuned to Earwolf all week to hear Scott, Reggie, and special guests like Will Forte and Dave Koechner preparing you for the premiere of Comedy Bang! Bang! on IFC. Tune into IFC this Friday at 10/9 central to see Zach Galifianakis, Gillian Jacobs, Thomas Lennon, Will Forte, and some guy named Andy Daly.","categories":[]},{"title":"160 Sarah Silverman,Kyle Dunnigan","link":"https://soundcloud.com/comedybangbang/slow-dance-boner","author":"","publishedDate":"Thu, 21 Mar 2013 17:30:38 -0700","contentSnippet":"This week we dive into the personal lives of comedy power couple Sarah Silverman and Kyle Dunnigan. A new game, Shorts or ...","content":"This week we dive into the personal lives of comedy power couple Sarah Silverman and Kyle Dunnigan. A new game, Shorts or Jeans, is played, and we're visited by two strange guests. Check out the \u003ca title\u003d\"Comedy Bang Bang - IFC\" href\u003d\"http://www.ifc.com/shows/comedy-bang-bang\"\u003eComedy Bang Bang on IFC website\u003c/a\u003e to watch a full episode of the show!","categories":[]},{"title":"159 Alison Brie,Jason Mantzoukas,Saul Goodman","link":"https://soundcloud.com/comedybangbang/apicklelypse","author":"","publishedDate":"Thu, 21 Mar 2013 17:30:16 -0700","contentSnippet":"Alison Brie and Jason Mantzoukas both costar in critically acclaimed movies and television shows...but a PODCAST? I know it ...","content":"Alison Brie and Jason Mantzoukas both costar in critically acclaimed movies and television shows...but a PODCAST? I know it seems unlikely, but they are in the Earwolf studio to tell the untold story of Rizzoli \u0026amp; Isles and see if they can\u0026#39;t find love through What Am I Thinking? and Would You Rather?! We also have a visitor from Albuquerque who is doling out legal advice if you need it. Plus, we have Comedy Bang Bang on IFC teasers, so give it a listen!","categories":[]},{"title":"158 Jordan Peele,Gillian Jacobs","link":"https://soundcloud.com/comedybangbang/words-with-friends","author":"","publishedDate":"Thu, 21 Mar 2013 17:29:40 -0700","contentSnippet":"If you like television, you'll love this week's episode of Comedy Bang Bang! From the newly renewed NBC comedy Community, ...","content":"If you like television, you'll love this week's episode of Comedy Bang Bang! From the newly renewed NBC comedy Community, Gillian Jacobs is here to seek forgiveness for her iPhone indiscretions and give us just a taste of how she got her big television break. Also joining us is the of American Idol's Jermaine \"The Gentle Giant\" Jones who is using Comedy Bang Bang as the platform to tell the pure, unadulterated truth behind his departure from the Fox reality hit. How will these television superstars fair against each other in a game of Would You Rather? That's for me to know and you to find out...by listening to the podcast, that is.","categories":[]},{"title":"157 Bobcat Goldthwait,Paul F Tompkins","link":"https://soundcloud.com/comedybangbang/god-bless-america","author":"","publishedDate":"Thu, 21 Mar 2013 17:29:27 -0700","contentSnippet":"You love Bobcat Goldthwait for his stand-up comedy, his performance of Zed in Police Academy, and as the director of movies ...","content":"You love Bobcat Goldthwait for his stand-up comedy, his performance of Zed in Police Academy, and as the director of movies like Shakes the Clown and World's Greatest Dad. You're about to fall in love with him for his showbiz secrets and his prowess at Fart, Marry/Mary, Kiss! Bobscratch shares tales of his red carpet antics and tells us about his brand new film God Bless America. Mr. Goldfarb isn't the only director on the show, as Mr. Marshall (please, call him Garry) returns to the show and gives us a sneak peek on his modern adaptation of a not-so-modern television franchise. These happy days truly are yours and mine!","categories":[]},{"title":"156 3rd Anniversary,Zach Galifianakis,St. Vincent,Special Guests","link":"https://soundcloud.com/comedybangbang/anniversary-party","author":"","publishedDate":"Thu, 21 Mar 2013 17:29:08 -0700","contentSnippet":"What do you need to throw the perfect anniversary party? You need some tunes, you need some bros, and if you're Comedy Bang ...","content":"What do you need to throw the perfect anniversary party? You need some tunes, you need some bros, and if you're Comedy Bang Bang you need some celebrity guests! Put on your party hats and boogie shoes for an hour and a half of Zach Galifianakis, Harris Wittels, Brett Gelman, El Chupacabra, Marissa Wompler, Cake Boss, and a posthumous visit from Christopher Hitchens. We're making new friends in musicians St. Vincent and Toph Shay, and we're playing everyone's favorite party games like Harris' Foam Corner. Make like Zach and get yourself a cupcake to celebrate the the three-year anniversary of Comedy Bang Bang!","categories":[]},{"title":"155 Patton Oswalt,Chris Tallman","link":"https://soundcloud.com/comedybangbang/fingerbang-lindbergh","author":"","publishedDate":"Thu, 21 Mar 2013 17:28:49 -0700","contentSnippet":"Are you ready for the final episode of the third year of Comedy Bang Bang? What do you want more than anything from this ...","content":"Are you ready for the final episode of the third year of Comedy Bang Bang? What do you want more than anything from this episode of Comedy Bang Bang? To finally get that one-on-one exclusive interview with Patton Oswalt we keep trying to give you? You got it! Want to find out about the inner workings of Comedy Bang Bang and Earwolf from our very own Mark Van Driel? You got that too! Do you want to learn a brand new game that will send Jing It or Ding It running? Just wait 'til you hear Fart, Mary, Kiss! Join us next week as we enter year four of existence!","categories":[]},{"title":"154 Lennon Parham,Jessica St. Clair","link":"https://soundcloud.com/comedybangbang/finger-guns","author":"","publishedDate":"Thu, 21 Mar 2013 17:28:34 -0700","contentSnippet":"With the Spring 2012 semester coming to a close, we are contractually obligated to have our 15 year-old intern Marissa Wompler ...","content":"With the Spring 2012 semester coming to a close, we are contractually obligated to have our 15 year-old intern Marissa Wompler visit. I cannot reiterate how much this is not our choice, especially now that she's accompanied by her faculty mentor Miss Listler. We try to make the best of it with the return of Jukebox Jury and a game of What Am I Thinking?, but try as we might we can't seem to pry Marissa away from her constant need to yell and discuss her changing body. Once again, our apologies.","categories":[]},{"title":"153 Will Forte,Leo Allen","link":"https://soundcloud.com/comedybangbang/jing-it-or-ding-it","author":"","publishedDate":"Thu, 21 Mar 2013 17:28:19 -0700","contentSnippet":"We're back again with more previously unreleased Comedy Bang Bang hilarity. This time first time guests Leo Allen and Will ...","content":"We're back again with more previously unreleased Comedy Bang Bang hilarity. This time first time guests Leo Allen and Will Forte remember some of their favorite rejected SNL pitches, discuss the tragedy of divorce, and try their hand at a brand new game: JING IT OR DING IT!","categories":[]},{"title":"152 Ed Helms,Seth Morris","link":"https://soundcloud.com/comedybangbang/behind-the-irony-curtain","author":"","publishedDate":"Thu, 21 Mar 2013 17:28:05 -0700","contentSnippet":"This week we're giving you Comedy Bang Bang listeners a little treat: Two previously unreleased episodes with some ...","content":"This week we're giving you Comedy Bang Bang listeners a little treat: Two previously unreleased episodes with some behind-the-curtain commentary courtesy of Scott Aukerman. Today's episode features Seth Morris in the role he was born to play: Himself! We also meet a brand new character from first-time guest Ed Helms. If you like learning how the bread is made, come back on Thursday for another look inside the Comedy Bang Bang vault.","categories":[]},{"title":"151 Fred Savage,Jackie Clarke,Gil Ozeri","link":"https://soundcloud.com/comedybangbang/fan-fiction","author":"","publishedDate":"Thu, 21 Mar 2013 17:27:49 -0700","contentSnippet":"What would you do if I sang out of tune? I'd tell you to shut up because we have actor and director Fred Savage on the show and ...","content":"What would you do if I sang out of tune? I'd tell you to shut up because we have actor and director Fred Savage on the show and he's giving us secrets and scoops from the set of The Wonder Years as well as NBC's Best Friends Forever, which he directed. We've also invited a couple of Fred's fans to join us, Pam and Len Bicell, who treat us to some sensual fan-fiction and an equally sensual round of Would You Rather?! Now make like Fred Savage and vote for Comedy Bang Bang in The Comedy Awards!","categories":[]},{"title":"150 Bobby Moynihan,Paul F. Tompkins","link":"https://soundcloud.com/comedybangbang/time-bobby","author":"","publishedDate":"Thu, 21 Mar 2013 17:27:33 -0700","contentSnippet":"It's a tale as old as time: A precocious orphan with a heart of gold and a love for musical theater meets a living legend of ...","content":"It's a tale as old as time: A precocious orphan with a heart of gold and a love for musical theater meets a living legend of Broadway. Such is the story of Fourvel and Lord Andrew Lloyd Webber, an unlikely pair who met during today's Comedy Bang Bang. Are things going to change for the better for Fourvel? Will Lord ALW's television debut be a SMASH hit? When are we recording this episode? All of these questions and more will be answered right here on Comedy Bang Bang!","categories":[]},{"title":"149 Live At SXSW,Tim Heidecker,James Adomian,Seth Morris,Reggie Watts","link":"https://soundcloud.com/comedybangbang/live-from-sxsw-2012","author":"","publishedDate":"Thu, 21 Mar 2013 17:27:20 -0700","contentSnippet":"This week's Comedy Bang Bang was recorded live at the South by Southwest Festival 2012 in Austin, Texas. Our guest for the ...","content":"This week's Comedy Bang Bang was recorded live at the South by Southwest Festival 2012 in Austin, Texas. Our guest for the prestigious affair is the one and only Tim Heidecker who shows off his prowess in comedy, music, and headwear. To comment on all the delicious cuisine Austin has to offer is Merrill Shindler, who just might have found a new best friend in Bob Ducca. And since we have Reggie Watts around to perform the theme song and music breaks, it only makes sense that we should challenge our guests to a Freestyle Rap Battle! A great big Texas-sized thank you to everyone who came out to the show!","categories":[]},{"title":"148 Jason Mantzoukas,Andy Daly","link":"https://soundcloud.com/comedybangbang/wipeout","author":"","publishedDate":"Thu, 21 Mar 2013 17:26:59 -0700","contentSnippet":"Put down your Entertainment Weekly and tune into Comedy Bang Bang! We have Jason Mantzoukas of comedy, film, and cinema fame ...","content":"Put down your Entertainment Weekly and tune into Comedy Bang Bang! We have Jason Mantzoukas of comedy, film, and cinema fame here to count down the Twelve Nights of Oscars and more importantly, try to get through to a friend in need. Also joining us is first time guest Dalton Wilcox, a cowboy poet who don't know much about this big city way of life. Sharp eared listeners might hear some cameo appearances from past Comedy Bang Bang favorites, so stay tuned on Twitter to let us know what you think! \u003ca href\u003d\"http://www.ifc.com/coming-soon\"\u003eClick here\u003c/a\u003e to see a sneak peek of the Comedy Bang Bang television show for IFC.","categories":[]},{"title":"147 Paul F. Tompkins,Greg Proops,James Adomian","link":"https://soundcloud.com/comedybangbang/raisin-norman-bates","author":"","publishedDate":"Thu, 21 Mar 2013 17:26:35 -0700","contentSnippet":"You are entering Comedy Bang Bang, a magical place not far from Planet Centaur where 40 year-old raptors hail cabs and the ...","content":"You are entering Comedy Bang Bang, a magical place not far from Planet Centaur where 40 year-old raptors hail cabs and the object of your affection is alive in your wallet. A place where Ice T and Jesse Ventura can seek tough answers and pitch television shows, and where Greg Proops can explores the depths of the thesaurus. This is Comedy Bang Bang. For a sneak peak at the Comedy Bang Bang television show, tune in to IFC this Friday March 9th following the season finale of Portlandia.","categories":[]},{"title":"146 Reggie Watts,Ben Schwartz,Matt Besser","link":"https://soundcloud.com/comedybangbang/climbing-the-ladder","author":"","publishedDate":"Thu, 21 Mar 2013 17:26:19 -0700","contentSnippet":"Sorry you guys, but we did NOT get Ice Ben Schwartz or Ice Reggie Watts for the podcast this week. You'll have to settle for ...","content":"Sorry you guys, but we did NOT get Ice Ben Schwartz or Ice Reggie Watts for the podcast this week. You'll have to settle for their American doppelgangers who join the world-famous Scottabot and the legendary Bjork for a sexy, funny, sexy, musical, sexy episode of Comedy Bang Bang. Pop open a six pack of pudding and enjoy!","categories":[]},{"title":"145 David Wain,James Adomian","link":"https://soundcloud.com/comedybangbang/a-family-affair","author":"","publishedDate":"Thu, 21 Mar 2013 17:26:07 -0700","contentSnippet":"We all love David Wain, but do we really KNOW David Wain? This week's Comedy Bang Bang is the only place on the internet to get ...","content":"We all love David Wain, but do we really KNOW David Wain? This week's Comedy Bang Bang is the only place on the internet to get in-depth info about Wain's personal life with the added perspective of his father and four-year-old son. I think we all already know plenty about Gary Busey's personal life, but regardless, he is here to speak about his exotic bird collection and recent economic hardships, among other things. Plus David is breaking out the tunes both on his keyboard and in a freestyle rap battle. This is the type of episode you'll want to pass down to your own children and grandchildren!","categories":[]},{"title":"143 Weird Al Yankovic,Todd Glass,Amy Phillips","link":"https://soundcloud.com/comedybangbang/grammy-spectacular","author":"","publishedDate":"Thu, 21 Mar 2013 17:25:41 -0700","contentSnippet":"Can I ask you a question? Are you ready for a star studded tribute to the most important Awards Show of the season? This year ...","content":"Can I ask you a question? Are you ready for a star studded tribute to the most important Awards Show of the season? This year Comedy Bang Bang is paying tribute to The Grammys with guests like musical comedy legend \"Weird Al\" Yankovic, brilliant comedian Todd Glass, and Hollywood starlet Liza Minnelli. Get Grammy predictions from these industry insiders and listen to a thrilling game of Would You Rather? with a conclusion you'll never see coming. Enjoy!","categories":[]},{"title":"142 Tim \u0026 Eric,James Adomian","link":"https://soundcloud.com/comedybangbang/popcorn-com","author":"","publishedDate":"Thu, 21 Mar 2013 17:25:26 -0700","contentSnippet":"Have you seen Tim \u0026amp; Eric's Billion Dollar Movie yet? We'll you'll be clamoring to see it after this in-depth interview with ...","content":"Have you seen Tim \u0026amp; Eric\u0026#39;s Billion Dollar Movie yet? We\u0026#39;ll you\u0026#39;ll be clamoring to see it after this in-depth interview with the titular Tim Heidecker and Eric Wareheim. They reveal all the deets about making a movie for \u0026quot;The Big S\u0026quot; and share with us the \u0026quot;Four Quarters of Success\u0026quot; that have brought them so much fame. Plus we have first time guest Dr. Bronner who teaches us an important lesson about generosity and togetherness as well as personal hygiene. And yes, all you Tim and Eric diehards, you WILL get to hear their beloved \u0026quot;Mike \u0026amp; The Dope\u0026quot; characters, so pop some corn and enjoy the podcast!","categories":[]},{"title":"141 Tig Notaro,Ronna \u0026 Beverly","link":"https://soundcloud.com/comedybangbang/ladies-night","author":"","publishedDate":"Thu, 21 Mar 2013 17:25:13 -0700","contentSnippet":"How about we get some ladies up in the Comedy Bang Bang studio? Tig Notaro has left the Professor Blastoff hatch and is making ...","content":"How about we get some ladies up in the Comedy Bang Bang studio? Tig Notaro has left the Professor Blastoff hatch and is making her triumphant return as Comedy Bang Bang\u0026#39;s master impressionist and character actress. In keeping with the theme we\u0026#39;ve invited (well, they barged in) Ronna Glickman and Beverly Ginsberg of the popular Ronna \u0026amp; Beverly Podcast. You\u0026#39;ll get a glimpse inside Scott\u0026#39;s marital home, a taste of Tig\u0026#39;s life on the road, and a schmear of Ronna and Beverly\u0026#39;s advice for divorcees.","categories":[]},{"title":"140 Nick Offerman,James Adomian","link":"https://soundcloud.com/comedybangbang/ron-swanson-off","author":"","publishedDate":"Thu, 21 Mar 2013 17:24:58 -0700","contentSnippet":"I think we have a new best friend and his name is Nick Offerman! The ex-con and star of Parks and Recreation makes his Comedy ...","content":"I think we have a new best friend and his name is Nick Offerman! The ex-con and star of Parks and Recreation makes his Comedy Bang Bang debut this week and gives all you Parks and Rec die-hards a glimpse into the tear-jerking story of how Ron Swanson came to be. Also joining us is Paul Giamatti who trades audition and rejection stories with Nick. To put it simply: This episode is diminutive!","categories":[]},{"title":"138 Andy Richter,Paul F. Tompkins","link":"https://soundcloud.com/comedybangbang/ghost-protocol","author":"","publishedDate":"Thu, 21 Mar 2013 17:24:32 -0700","contentSnippet":"If you Googled \"A funny podcast to start 2012\" than you're in the right place! And before you go Googling \"Who are the guests?\" ...","content":"If you Googled \"A funny podcast to start 2012\" than you're in the right place! And before you go Googling \"Who are the guests?\" I'll tell you: Andy Richter and Werner Herzog! And instead of using Google to find out if they play Would You Rather?, what Andy is doing to get in shape, or how Werner's war on nature is going, just give this episode a listen and you'll get your answers!","categories":[]},{"title":"Best of 2011 Pt 1","link":"https://soundcloud.com/comedybangbang/best-of-2011-pt-1","author":"","publishedDate":"Thu, 21 Mar 2013 17:24:08 -0700","contentSnippet":"As the year winds down, let us revisit some of the highlights from Comedy Bang Bang in 2011. Joined by audience favorite Paul ...","content":"As the year winds down, let us revisit some of the highlights from Comedy Bang Bang in 2011. Joined by audience favorite Paul F. Tompkins, Scott Aukerman is counting down numbers ten through six of the viewer selected top episodes of the year. Check back in on Thursday to hear which episodes topped the list and we will see you next year at the movies!","categories":[]},{"title":"2011 Holiday Spectacular","link":"https://soundcloud.com/comedybangbang/2011-holiday-spectacular","author":"","publishedDate":"Thu, 21 Mar 2013 17:23:40 -0700","contentSnippet":"It's that time of year again! You've hung up your proverbial podcast stocking and Comedy Bang Bang is here to stuff it full of ...","content":"It's that time of year again! You've hung up your proverbial podcast stocking and Comedy Bang Bang is here to stuff it full of your favorite guests, characters, games, raps, and more! Happy Holidays!","categories":[]},{"title":"134 Kevin Nealon,Ben Schwartz,Amy Phillips","link":"https://soundcloud.com/comedybangbang/bride-of-chucky","author":"","publishedDate":"Thu, 21 Mar 2013 17:22:42 -0700","contentSnippet":"This week's Comedy Bang Bang serves as a forum to learn about show business from some of the industry's biggest names. From ...","content":"This week's Comedy Bang Bang serves as a forum to learn about show business from some of the industry's biggest names. From Kevin Nealon auditioning for Cheers to Ben Schwartz freelancing for Saturday Night Live, you'll have an earful of exclusive knowledge before you can say \"What's Up Hotdog?\" And while Kevin and Ben have their fair share of insider stories, you'll never believe what Jennifer Tilly has to say about her movies, her manager, her sister, and her breasts. Be sure to pick up your tickets for the \u003ca href\u003d\"http://www.ticketfly.com/event/80839\"\u003e2011 Comedy Bang Bang Nativity Pageant\u003c/a\u003e and start getting  yourself in the Christmas spirit with \u003ca href\u003d\"http://store.earwolf.com/collections/featured/products/the-complete-comedy-bang-bang-christmas-collection\"\u003eThe Complete Comedy Bang Bang Christmas Collection\u003c/a\u003e.","categories":[]},{"title":"133 Patton Oswalt,Chris Tallman","link":"https://soundcloud.com/comedybangbang/fortunately-unfortunately","author":"","publishedDate":"Thu, 21 Mar 2013 17:22:26 -0700","contentSnippet":"Patton Oswalt is back in the Comedy Bang Bang hot seat! Fortunately, he has a new movie coming out and he's ready to give us ...","content":"Patton Oswalt is back in the Comedy Bang Bang hot seat! Fortunately, he has a new movie coming out and he's ready to give us all sorts of exclusive information. Unfortunately, we still have our open door policy and a gentleman named Leslie Schecter finds his way into the studio. Fortunately, Patton was still game for Would You Rather? and Fortunately Unfortunately despite this rude interruption. Unfortunately, Leslie hangs around for the rest of the episode. Fortunately, you can forget all about his rudeness and relive your favorite Comedy Bang Bang moments by heading to the Earwolf blog and voting for the CBB Best of 2011. This episode is sponsored by audible. Support the Comedy Bang Bang and get a free audiobook at http://www.audiblepodcast.com/bangbang","categories":[]},{"title":"132 David Wain,Margret Cho,James Adomian,Grant Lee Phillips","link":"https://soundcloud.com/comedybangbang/occupy-thanksgiving","author":"","publishedDate":"Thu, 21 Mar 2013 17:22:02 -0700","contentSnippet":"At the intersection of comedy, music, and fashion lies this week's Comedy Bang Bang. Margaret Cho and Grant-Lee Phillips ...","content":"At the intersection of comedy, music, and fashion lies this week's Comedy Bang Bang. Margaret Cho and Grant-Lee Phillips provide the score for the episode in addition to delighting us with tales of the 90s and fun rounds of What Am I Thinking? and Would You Rather?! David Wain is the comedy legend you'd expect him to be, but by the end of the episode you'll be in awe of his keyboard skills. Dov Charney came here to talk about American Apparel and he does. That part is pretty straightforward. But throw it all together and you have a podcast stew to whet your pre-Thanksgiving appetite. Speaking of stew, head over to the Earwolf store and pick up \u003ca href\u003d\"http://store.earwolf.com/collections/featured/products/the-complete-comedy-bang-bang-christmas-collection\" rel\u003d\"nofollow\"\u003eThe Complete Comedy Bang Bang Christmas Collection\u003c/a\u003e. All proceeds go to the LA Regional Food Bank.","categories":[]},{"title":"131 Andy Daly,Jason Mantzoukas","link":"https://soundcloud.com/comedybangbang/mayor-of-hollywood","author":"","publishedDate":"Thu, 21 Mar 2013 17:21:28 -0700","contentSnippet":"It's sure been a while since Jason Mantzoukas popped in for an episode of Comedy Bang Bang. And I don't know about you, but I ...","content":"It's sure been a while since Jason Mantzoukas popped in for an episode of Comedy Bang Bang. And I don't know about you, but I could really use a good interruption from a total stranger! We get the best of both worlds this week as Scott and Jason are joined by Chip Gardner, former television personality and (hopefully) future Honorary Mayor of Hollywood. Enjoy, and if Chip's spiritual wellness inspires you to give, consider buying The Complete Comedy Bang Bang Christmas Collection. All proceeds go to the LA Regional Food Bank.","categories":[]},{"title":"130 Bobby Moynihan,Jenny Slate,Elizabeth Laime","link":"https://soundcloud.com/comedybangbang/tall-napoleon","author":"","publishedDate":"Thu, 21 Mar 2013 17:20:57 -0700","contentSnippet":"This is not a prank! We really do have Jenny Slate from SNL and Elizabeth Laime from the Totally Laime Podcast on the show! ...","content":"This is not a prank! We really do have Jenny Slate from SNL and Elizabeth Laime from the Totally Laime Podcast on the show! Joining them is legendary actor Fagin Platt, son of Oliver Platt (the Canadian-American actor currently starring in the Showtime original series, The Big C with Laura Linney). If you listen carefully you might hear a surprise cameo from a legendary basketball player and prankster. Be sure to check out the new \u003ca href\u003d\"http://www.youtube.com/earwolf\" rel\u003d\"nofollow\"\u003eEarwolf Youtube channel\u003c/a\u003e for clips, videos, and exclusive content like a sneak peek at next week's episode on Wednesday. Lastly, if you're looking to make some purchases on Amazon, please do so through our \u003ca href\u003d\"http://www.amazon.com/?tag\u003dcomedybb-20\"\u003eaffiliate link\u003c/a\u003e and a portion of the money will go to Earwolf.","categories":[]},{"title":"129 Halloween,Brett Gelman,Jon Daly,Allan McCloud,Neil Campbell","link":"https://soundcloud.com/comedybangbang/comedy-fang-fang","author":"","publishedDate":"Thu, 21 Mar 2013 17:20:31 -0700","contentSnippet":"It seems as though every year around this time something awfully spooky washes over this podcast and takes it in a devilish ...","content":"It seems as though every year around this time something awfully spooky washes over this podcast and takes it in a devilish direction. I'm sorry to say that this year is no different, with guests like the dreadful Beuford and Messmore le Barron of Suicide House and the frightful Ghost Boy. Hopefully the positive energy of Neil Campbell will be enough to prevent your nightmares, but I won't make any promises! If you find yourself too scared following this episode, follow these directions: Listen to the \u003ca href\u003d\"http://store.earwolf.com/collections/featured/products/comedy-bang-bang-the-podcast-live-from-bumbershoot-2011\" rel\u003d\"nofollow\"\u003eBumbershoot Comedy Bang Bang recordings\u003c/a\u003e, and swaddle yourself in a warm \u003ca href\u003d\"http://store.earwolf.com/\" rel\u003d\"nofollow\"\u003eComedy Bang Bang t-shirt\u003c/a\u003e. If that doesn't work, well then I suppose we've done our job. Muahaha!","categories":[]},{"title":"127 Paul Scheer,Nick Swardson,Brody Stevens","link":"https://soundcloud.com/comedybangbang/national-pleasure","author":"","publishedDate":"Thu, 21 Mar 2013 17:19:34 -0700","contentSnippet":"How many ingredients are in pizza? Can you high five an orangutan? What does the moon do when we're not looking? The answers to ...","content":"How many ingredients are in pizza? Can you high five an orangutan? What does the moon do when we're not looking? The answers to these questions and more can be found in today's Comedy Bang Bang! Nick Swardson finally found his way back to the studio and is joined by two first time guests: Comedian Brody Stevens and Nic Cage stand-in (and brother) Bob Cage. They guess the misheard lyrics, get on their soap boxes, and ponder \"Would You Rather?\" their way into Comedy Bang Bang history! And hey, you too can be part of Comedy Bang Bang history too if you pick up either of our new shirts from the \u003ca href\u003d\"http://store.earwolf.com/\" rel\u003d\"nofollow\"\u003eEarwolf Store\u003c/a\u003e!","categories":[]},{"title":"123 Amy Poehler,The Bangles,Adam Pally","link":"https://soundcloud.com/comedybangbang/no-scoop-for-you","author":"","publishedDate":"Thu, 21 Mar 2013 17:18:19 -0700","contentSnippet":"Break the monotony of this Manic Monday with a new Comedy Bang Bang featuring Amy Poehler, The Bangles, and possibly the ...","content":"\u003cdiv\u003eBreak the monotony of this Manic Monday with a new Comedy Bang Bang featuring Amy Poehler, The Bangles, and possibly the biggest guest we've ever had, David Fiene! Amy and Scott gab about the original UCB pilot and the alternative comedy scene of the '90s, but that's nothing compared to the showbiz stories David has to offer. David came up with some of the biggest legends of comedy (I'm not going to namedrop, but he certainly will) and has walls and walls of quotes and advice for young comedic upstarts. Match that with the dulcet tones of The Bangles and the rap stylings of our guests and you've got an hour and a half of aural decadence. Would you rather listen to this episode or go about your humdrum day? I thought so!\u003c/div\u003e","categories":[]},{"title":"122 Zach Galifianakis,Paul F. Tompkins,Yo La Tengo","link":"https://soundcloud.com/comedybangbang/shanghaied-by-irene","author":"","publishedDate":"Thu, 21 Mar 2013 17:17:47 -0700","contentSnippet":"Welcome to Comedy Bang Bang! As today is our first day on Funny Or Die, we've pulled out all the stops and brought in some of ...","content":"\u003cp\u003eWelcome to Comedy Bang Bang! As today is our first day on Funny Or Die, we've pulled out all the stops and brought in some of the most talented folks we know. Folks like Zach Galifianakis from The Hangover and Between Two Ferns. Folks like famed film director (and friend of Paul F. Tompkins) Werner Herzog. And who better to score this star-struck episode than Yo La Tengo, gods of alt rock. If this is your first episode, enjoy! If you're a long time listener: Be on your best behavior, we're having company!\n\u003c/p\u003e","categories":[]},{"title":"121 Jimmy Pardo,Paul Rust,Rob Delaney","link":"https://soundcloud.com/comedybangbang/bro-ing-out","author":"","publishedDate":"Thu, 21 Mar 2013 17:17:30 -0700","contentSnippet":"On a hot summer day, what could be better than chilling out with a bunch of bros? Nothing, that's what! Rob Delaney, Jimmy ...","content":"On a hot summer day, what could be better than chilling out with a bunch of bros? Nothing, that's what! Rob Delaney, Jimmy Pardo, and Paul Rust join Scott for the ultimate Comedy Bang Bang chill sesh. They play some games, chat about some hot topics, and participate in other bro activities (brotivities, if you will). Grab some bros of your own, and dig in!","categories":[]},{"title":"119 Gillian Jacobs,Andy Daly","link":"https://soundcloud.com/comedybangbang/andi-callahan-rn","author":"","publishedDate":"Thu, 21 Mar 2013 17:16:45 -0700","contentSnippet":"They say laughter is the best medicine. If that is the case, take out your IV and put it your earbuds because we have a great ...","content":"They say laughter is the best medicine. If that is the case, take out your IV and put it your earbuds because we have a great new episode of Comedy Bang Bang for you! We have two first time guests: Gillian Jacobs and Andi Callahan. We all know Gillian from NBC's Community and if you aren't a fan of Andi yet, you will be once you hear his hilarious tales of working as a nurse. The laughs just keep coming this week, so protect your funny bone and get me 119 CCs of CBB, stat!","categories":[]},{"title":"115 Paul Rudd,David Wain,Ken Marino","link":"https://soundcloud.com/comedybangbang/the-plug-in-drug","author":"","publishedDate":"Thu, 21 Mar 2013 17:14:45 -0700","contentSnippet":"Paul Rudd freestyle raps in this episode. There is a lot more I could tell you, but that should have sold it. Does he talk with ...","content":"Paul Rudd freestyle raps in this episode. There is a lot more I could tell you, but that should have sold it. Does he talk with David Wain and Ken Marino about Wet Hot American Summer? Yes, of course, but he also freestyle raps. They play What Am I Thinking? and Would You Rather? but you probably already know that because you're already listening because I told you that Paul Rudd freestyle raps in this episode. Kind of a lot. What else needs to be said?","categories":[]},{"title":"114 Edgar Wright,Joe Cornish,Matt Besser","link":"https://soundcloud.com/comedybangbang/hats-off-to-caruso","author":"","publishedDate":"Thu, 21 Mar 2013 17:14:21 -0700","contentSnippet":"The Earwolf studio is experiencing a British Invasion! They're coming to Attack the Block and we're too Spaced to call the Hot ...","content":"The Earwolf studio is experiencing a British Invasion! They're coming to Attack the Block and we're too Spaced to call the Hot Fuzz. It feels like Earwolf Vs. The World and hopefully we won't end up (Shaun of the) Dead (okay, I'm done now). Joe Cornish and Edgar Wright are our special guests who earn their keep in a heated game of Hollywood Facts and a rousing round of Would You Rather. Representing for the US of A is songwriter and entrepreneur Martin Riley who helps us with the creative process of penning a tune for a special occasion. Go see Attack the Block and check out Martin's friend Matt Besser on Earwolf's very own competition show The Earwolf Challenge.","categories":[]},{"title":"113 Bobby Moynihan,Seth Morris","link":"https://soundcloud.com/comedybangbang/skanking-hayride","author":"","publishedDate":"Thu, 21 Mar 2013 17:14:03 -0700","contentSnippet":"Stars- They're just like us! Bobby Moynihan from Saturday Night Live joins us this week and proves his comedy nerd cred with an ...","content":"Stars- They're just like us! Bobby Moynihan from Saturday Night Live joins us this week and proves his comedy nerd cred with an impressive knowledge of SNL history that will embarrass even the nerdiest of listeners. Our old friend Ozzie Patinkin (no relation) of the Bakery for Dogs returns and tells us about dog treats, dog costumes, dog amputation, dog guns, and so on and so forth. Another old friend is back: Hollywood Facts! It joins Would You Rather? in this episode that defies reality and begs the question \"How far would you go for a Plane Break?\"","categories":[]},{"title":"111 Harris Wittels,Auction Winner David Guy Levy,???","link":"https://soundcloud.com/comedybangbang/hi-how-are-you","author":"","publishedDate":"Thu, 21 Mar 2013 17:12:51 -0700","contentSnippet":"Two Comedy Bang Bangs in one week? Why, this must be a Christmas miracle! I bet this is how all those homeless people felt when ...","content":"Two Comedy Bang Bangs in one week? Why, this must be a Christmas miracle! I bet this is how all those homeless people felt when David Guy Levy, producer of the upcoming film Terri, generously gave to the LA Food Bank this past Christmas. However, as you'll learn from this episode, his donation was not completely selfless: He got to co-host Comedy Bang Bang! Along with mostly-enjoyed guest Harris Wittels and a special surprise guest he brought himself, David guides us through segments like Harris' Phone Corner and the What's Up Hot Dog Memorial Plugs. Be sure to see Terri this weekend! David supports us so let's support him!","categories":[]},{"title":"110 Myq Kaplan,Colin Hanks,Paul Scheer","link":"https://soundcloud.com/comedybangbang/thumbs-yes","author":"","publishedDate":"Thu, 21 Mar 2013 17:12:15 -0700","contentSnippet":"With a cascade of puns, a round of \"no, but\" style improvisation, an appearance of cake bugs, and latent racism, this is a ...","content":"With a cascade of puns, a round of \"no, but\" style improvisation, an appearance of cake bugs, and latent racism, this is a classic Comedy Bang Bang waiting to happen. Our guests are Colin Hanks and Myq Kaplan who match wits on What Am I Thinking? while throwing down on Would You Rather?. We also have an appearance by Kylie Bloom (I think) who is the editor of Spa Magazine (I think) and shares the Cake Boss' gift of the second sight (that one I know for sure). I can neither confirm nor deny the appearance of a certain deceased hip hop legend, but I can tell you that you will give this episode a Thumbs Yes!","categories":[]},{"title":"109 Andy Samberg,Adam Pally","link":"https://soundcloud.com/comedybangbang/the-andy-samberg-special","author":"","publishedDate":"Thu, 21 Mar 2013 17:11:43 -0700","contentSnippet":"This is a show for lovers of Hollywood, pizza, marijuana, and plane breaks. Our guest this week is Andy Samberg from The Lonely ...","content":"This is a show for lovers of Hollywood, pizza, marijuana, and plane breaks. Our guest this week is Andy Samberg from The Lonely Island and Saturday Night Live who gives us the inside scoop on creating a record and working with talents like Justin Timberlake and Lady Gaga. There is an unfortunate appearance by Scott's weed guy Bro, but we make up for it with a great game of Would You Rather and the first Comedy Bang Bang semi-prank call. And yes, there are plane breaks.","categories":[]},{"title":"107 John Mulaney,Nick Kroll","link":"https://soundcloud.com/comedybangbang/maybe-its-maybelline","author":"","publishedDate":"Thu, 21 Mar 2013 17:10:55 -0700","contentSnippet":"In podcasting, you do a lot of things you don't want to do. This episode isn't one of those things! Our guests are the ...","content":"In podcasting, you do a lot of things you don\u0026#39;t want to do. This episode isn\u0026#39;t one of those things! Our guests are the hilarious John Mulaney and Nick Kroll. You know what that means? We\u0026#39;ll hear some of their classic characters like Freckle Face and John\u0026#39;s Uncle Cowboy. Learn \u0026quot;how the bread is made\u0026quot; on Saturday Night Live and how Law \u0026amp; Order has informed John\u0026#39;s comedy career. Come for the Plane Break, stay for the Plugs!","categories":[]},{"title":"Best of 2010 Paul F. Tompkins,Nick Kroll,Thomas Lennon,James Adomian,Tig Notaro,Reggie Watts,Seth Morris,Andy Daly,Jon Daly,Brett Gelman","link":"https://soundcloud.com/comedybangbang/the-best-of-2010","author":"","publishedDate":"Thu, 21 Mar 2013 17:08:08 -0700","contentSnippet":"'Tis the season to relive your favorite comedy bits from the year! You voted and the answers are in for the best characters, ...","content":"\u003cp\u003e'Tis the season to relive your favorite comedy bits from the year! You voted and the answers are in for the best characters, guests, songs, and episodes of Comedy Bang Bang: The Podcast 2010. Scott and some of Earwolf's closest friends count down the awards while lifting the curtain on what goes into making Comedy Bang Bang so special and hilarious. Thanks for listening this year and happy holidays!\u003c/p\u003e","categories":[]},{"title":"Bonus: Live from SF Sketch Fest","link":"https://soundcloud.com/comedybangbang/live-from-sf-sketchfest","author":"","publishedDate":"Thu, 21 Mar 2013 17:06:50 -0700","contentSnippet":"In the first Doug Loves Movies/Comedy Bang Bang: The Podcast cross-over event, Scott brings on his friends Doug Benson, Dana ...","content":"\u003cp\u003eIn the first Doug Loves Movies/Comedy Bang Bang: The Podcast cross-over event, Scott brings on his friends Doug Benson, Dana Gould, Paul F. Tompkins, Michael Ian Black, and of course the theme-song composer Reggie Watts. The show gets its first ever appearance of a Tony Award winner in Dame Sir Andrew Lloyd Webber, and experiences what it's like to do the same type of show they do in a studio in front of real live people.\u003c/p\u003e","categories":[]},{"title":"Best of 2011 Pt 2","link":"https://soundcloud.com/comedybangbang/best-of-2011-pt-2","author":"","publishedDate":"Thu, 21 Mar 2013 17:06:03 -0700","contentSnippet":"And now the thrilling conclusion of the Comedy Bang Bang Best of 2011! We're counting down the top five episodes as chosen by ...","content":"And now the thrilling conclusion of the Comedy Bang Bang Best of 2011! We're counting down the top five episodes as chosen by the listeners and throwing in some of your favorite segments and characters like The New Year Chicken, Vampire Jesus, \"Deaf Al\" Yankovic, Kajagoogoo, and more! Join Scott Aukerman, Paul F. Tompkins, and special guest Andy Richter on this epic-sode and come back next week for a fresh new 2012 episode of Comedy Bang Bang!","categories":[]},{"title":"106.1 Andy Richter,Paul. F. Tompkins","link":"https://soundcloud.com/comedybangbang/its-a-fucking-podcast-pt-1","author":"","publishedDate":"Thu, 21 Mar 2013 17:05:26 -0700","contentSnippet":"If you aren't yet glad you survived the rapture, you will be once you hear this episode of Comedy Bang Bang! Not only do we ...","content":"If you aren't yet glad you survived the rapture, you will be once you hear this episode of Comedy Bang Bang! Not only do we have the hilarious and talented Andy Richter, but we receive a visit from Earwolf's very own Harold Camping: CAKE BOSS! Buddy Valastro tells us what heaven is like, just in case the rapture is upon us, and presents us with yet another bone-chilling tale of cake and death. There is just enough time for Who Said It before we put Buddy's cake trance on hold for next week. Catch the exciting conclusion next Tuesday on Earwolf.","categories":[]},{"title":"102 Tim Heidecker,Neil Hamburger","link":"https://soundcloud.com/comedybangbang/behind-the-music","author":"","publishedDate":"Thu, 21 Mar 2013 17:04:06 -0700","contentSnippet":"To all the listeners who have requested Tim Heidecker: We hope you're happy. Tim makes his inaugural appearance to talk ...","content":"To all the listeners who have requested Tim Heidecker: We hope you're happy. Tim makes his inaugural appearance to talk about...his music? His show? The music on his show? We're still not sure. Neil Hamburger stops by to set his finances straight and get the word out about his new iPhone app (which has nothing to do with Mountain Dew) before joining the somewhat-agreeable Tim in a game of Dead or Alive. I don't want to tip off the biggest surprise of the episode, but prepare yourself to hear some classic songs of yesteryear in a whole new light. If you'd like to book Tim or one of his multiple musical projects contact P.D.A. out of Little Rock, or just go to his Tumblr.","categories":[]},{"title":"93 Reggie Watts,James Adomian","link":"https://soundcloud.com/comedybangbang/and-the-oscar-goes-to","author":"","publishedDate":"Thu, 21 Mar 2013 16:59:58 -0700","contentSnippet":"And the Oscar for Outstanding Episode of a Comedy Podcast goes to: THIS EPISODE OF Comedy Bang Bang: The Podcast! Additionally, ...","content":"\u003cp\u003eAnd the Oscar for Outstanding Episode of a Comedy Podcast goes to: THIS EPISODE OF Comedy Bang Bang: The Podcast! Additionally, the Oscar for Outstanding Former Musician Who is Now a Comedian and Does the Theme Song goes to Reggie Watts! Of course, the Oscar for Outstanding Call-Back to a Previous Episode goes to Jeremy Piven. We just have one more, the Oscar for Outstanding New Feature which will go to Oscar Trivia. No Oscars for Paul Giamatti because he's fat and bald and doesn't bathe.\u003c/p\u003e","categories":[]},{"title":"92 Andy Richter,Jessica St. Clair","link":"https://soundcloud.com/comedybangbang/hows-your-boner","author":"","publishedDate":"Thu, 21 Mar 2013 16:59:38 -0700","contentSnippet":"Hey guyz it's Marissa Wompler and Scott was all like \"if you want to be an intern you have to write about the show\" and I was ...","content":"\u003cp\u003eHey guyz it's Marissa Wompler and Scott was all like \"if you want to be an intern you have to write about the show\" and I was like \"um ok I guess.\" So, ummm....i kind of dont remember what happened. that guy Andy Richter was there. do you guys know who that is? hes like from Conan or something. umm so yeah, he was there and he talked about boners and stuff. we played this really STUPID game called \"Guess the Celebrities' Real Name\" but we also played this really really fun game called \"What Am I Thinking\" and i was really really good at it and it was super fun and I think I'm going to play it at my next sleep-over. if you want to leave me valentines and stuff you can leave them in the comments with catch-phrases and stuff. KBYEZ!\u003c/p\u003e","categories":[]},{"title":"79 Eugene Mirman,Jackie Clarke,Mookie Blaiklok","link":"https://soundcloud.com/comedybangbang/whod-fuck-tom-brady","author":"","publishedDate":"Thu, 21 Mar 2013 16:55:11 -0700","contentSnippet":"Comedy Bang Bang is always trying to do great things for mankind, whether through helping out a poor delinquent child or ...","content":"\u003cp\u003eComedy Bang Bang is always trying to do great things for mankind, whether through helping out a poor delinquent child or bringing in amazing comedians for us all to enjoy. This episode does both! Claire Woodruff (who does not have a robot arm) was sentenced to court-ordered podcasting, and boy does she fit the minimum community service requirements! Zing-Talker Eugene Mirman makes his Comedy Bang Bang debut to support his potential sponsors and talk about his upcoming show Bob's Burgers. Scott once again opens up to us about his past, this time about his first date. Scott and Eugene show their competitive side when they place bets on the famous \"ball pillow challenge\" and follow it up with a rousing game of What Am I Thinking? Don't forget to leave us a comment, or email Claire herself over at \u003ca href\u003d\"mailto:drwoodruff@me.com\"\u003edrwoodruff@me.com\u003c/a\u003e.\u003c/p\u003e","categories":[]},{"title":"75 Mike Birbiglia,Henry Phillips,Matt Besser","link":"https://soundcloud.com/comedybangbang/the-farting-fuck-faces","author":"","publishedDate":"Thu, 21 Mar 2013 16:53:47 -0700","contentSnippet":"This week's theme on Comedy Bang Bang is well-adjusted adults who take criticism well and never had issues being accepted as ...","content":"\u003cp\u003eThis week's theme on Comedy Bang Bang is well-adjusted adults who take criticism well and never had issues being accepted as adolescents. Sleepwalker Mike Birbiglia shares with us, in Mike Birbiglia-style detail, how he and Nathan Lane became friends, what it's like to do comedy at a college, and how close he was to becoming a world class break dancer. Songstress Henry Phillips sings about the joys of Los Angeles, how much he enjoyed high school, and how to just say \"Oops\" when something goes awry. Punk-Billionaire-Genius Mark Zuckerberg shares some data with Scott regarding their shared love of The Beatles, The Big Lebowski, and Asian women. Pop culture aficionados will enjoy a rare trailer for the film Nowhere Boy, which is one short game of Fortunately Unfortunately away from a fantastic round of plugs. Enjoy, and while I've got you here, you should go check the Earwolf Store for awesome t-shirts and downloads!\u003c/p\u003e","categories":[]},{"title":"70 Aimee Mann,Jon Wurster,Ted Leo,Paul F. Tompkins,","link":"https://soundcloud.com/comedybangbang/rock-n-roll-dreams","author":"","publishedDate":"Thu, 21 Mar 2013 16:52:26 -0700","contentSnippet":"They say all musicians secretly want to be comedians, but today's guests do not seem to keep any secret of their comedic ...","content":"\u003cp\u003eThey say all musicians secretly want to be comedians, but today's guests do not seem to keep any secret of their comedic leanings. Aimee Mann, Ted Leo, and Jon Wurster all have serious comedy cred, between touring with Paul F. Tompkins, making music videos with Paul F. Tompkins, and performing on radio shows with Paul F. Tompkins. Speaking of Paul F. Tompkins, artist Mr. Brainwash makes his first appearance to discuss making art (and science) for the people. Listen to musicians doing what they do best (critiquing music), and what they do worst (short-form improv), and french artists doing what they do best (pronouncing the word \"mustard\") and what they do worst (pronouncing the word \"mustard\").\u003c/p\u003e","categories":[]}]}}, "responseDetails": null, "responseStatus": 200}