{"responseData": {"feed":{"feedUrl":"http://rss.earwolf.com/comedy-bang-bang","title":"Comedy Bang Bang: The Podcast","link":"http://www.earwolf.com/show/comedy-bang-bang/","author":"","description":"Join host Scott Aukerman (\"Comedy Bang! Bang!\" on IFC, \"Mr. Show\") for a weekly podcast that blends conversation and character work from today's funniest comedians. While Scott begins by traditionally interviewing the celebrities, the open-door policy means an assortment of eccentric oddballs can pop by at any moment to chat, compete in games, and engage in comic revelry. With all that,andregular bonus episodes, we bet your favorite part will still be the plugs!","type":"rss20","entries":[{"title":"351 Sean Clements, Hayes Davenport, Ben Rodgers, Hayley Huntley","link":"http://www.earwolf.com/episode/cbb-the-movie/","author":"","publishedDate":"Mon, 18 May 2015 00:04:42 -0700","contentSnippet":"Sean Clements and Hayes Davenport of the cult hit podcast Hollywood Handbook are finally making their Comedy Bang Bang debut! ...","content":"Sean Clements and Hayes Davenport of the cult hit podcast Hollywood Handbook are finally making their Comedy Bang Bang debut! Sean \u0026amp; Hayes speak on the good ol days of baseball, their upcoming film Spies vs. Spies, and the history of phones. Then, ac...","categories":[]},{"title":"350 Andy Richter, Andy Daly","link":"http://www.earwolf.com/episode/helmets-aqueduct-crucifixion-boobs/","author":"","publishedDate":"Mon, 11 May 2015 00:04:23 -0700","contentSnippet":"Comedy legend Andy Richter of Conan is back to celebrate the 350th episode of Comedy Bing! Bong! Andy tells us about his dating ...","content":"Comedy legend Andy Richter of Conan is back to celebrate the 350th episode of Comedy Bing! Bong! Andy tells us about his dating life, how meeting your heroes is sometimes awkward, and the Fast \u0026amp; Furious movies. Then, royal watcher Byron Denniston ret...","categories":[]},{"title":"349 6th Anniv. Paul F. Tompkins, Lauren Lapkus, Thomas Middleditch, Neil Campbell, Mike Hanford, Joe Wengert, Paul Scheer, Erin Whitehead","link":"http://www.earwolf.com/episode/the-6th-anniversary-show/","author":"","publishedDate":"Mon, 04 May 2015 01:03:08 -0700","contentSnippet":"6 years ago and no score today a comedy podcast was born. My, oh, my how time has flown by! ITS BEEN 6 years of Comedy Bang! ...","content":"6 years ago and no score today a comedy podcast was born. My, oh, my how time has flown by! ITS BEEN 6 years of Comedy Bang! Bang! The Podcast and old friends and new friends stop by to celebrate. Expect to hear from some show favorites like a boss o...","categories":[]},{"title":"348 Cameron Esposito, Paul F. Tompkins, Matt Gourley","link":"http://www.earwolf.com/episode/is-yall-my-daddy/","author":"","publishedDate":"Mon, 27 Apr 2015 00:04:37 -0700","contentSnippet":"Y'all hear 'em sireens? That's right Cameron Esposito of Put Your Hands Together is back along with her new legal guardian ...","content":"Y'all hear 'em sireens? That's right Cameron Esposito of Put Your Hands Together is back along with her new legal guardian vigilante J.W. Stillwater! They'll tell us all about living together, pitching projects in Hollywood, and J.W.'s missing father...","categories":[]},{"title":"347 Kevin Pollak, Seth Morris","link":"http://www.earwolf.com/episode/foley-slumber-party/","author":"","publishedDate":"Thu, 23 Apr 2015 00:05:32 -0700","contentSnippet":"Kevin Pollak, director of the new documentary Misery Loves Comedy finally makes his first appearance on todays emergency ...","content":"Kevin Pollak, director of the new documentary Misery Loves Comedy finally makes his first appearance on todays emergency B-B-B-ONUS-S-S Comedy Bing Bong! Ever wanted to know why comedians do what they do? What about helpful tips to get out of jury du...","categories":[]},{"title":"346 Tom Green, Mary Holland, Erin Whitehead","link":"http://www.earwolf.com/episode/that-is-wild/","author":"","publishedDate":"Mon, 20 Apr 2015 01:00:56 -0700","contentSnippet":"Proud Canadian Tom Green makes his first appearance as wonderful co-host/high school graduate Trabitha Tarteen joins Scott on ...","content":"Proud Canadian Tom Green makes his first appearance as wonderful co-host/high school graduate Trabitha Tarteen joins Scott on this week's Comedy Bing Bong! Tom takes us through the seasons, gives us some great Halloween costume advice, and shares his...","categories":[]},{"title":"345 Kyle Bornheimer, Paul Brittain","link":"http://www.earwolf.com/episode/shifting-bouncy/","author":"","publishedDate":"Mon, 13 Apr 2015 00:04:05 -0700","contentSnippet":"First timer Kyle Bornheimer of the new film The Last Time You Had Fun and SNL alum/return timer Paul Brittain are on today's ...","content":"First timer Kyle Bornheimer of the new film The Last Time You Had Fun and SNL alum/return timer Paul Brittain are on today's Comedy Bing Bong! We get great TV advice and all the deets on Kyles movie before Paul answers a knocking door to reveal a new...","categories":[]},{"title":"344 Ryan Hansen, Jamie Chung, Horatio Sanz, Jocelyn DeBoer, Paul F. Tompkins","link":"http://www.earwolf.com/episode/classic-switcheroo/","author":"","publishedDate":"Thu, 09 Apr 2015 00:04:01 -0700","contentSnippet":"Ryan Hansen and Jamie Chung of Hulu's Resident Advisors get it percolatin' on a B-B-B-ONUS-S-S Comedy Bing Bong! They'll tell ...","content":"Ryan Hansen and Jamie Chung of Hulu's Resident Advisors get it percolatin' on a B-B-B-ONUS-S-S Comedy Bing Bong! They'll tell us all about the fun they had while creating all these hours of content before The Hooray Shows Horatio Sanz walks into the...","categories":[]},{"title":"343 Alicia Witt, Jon Gabrus, Brendon Small","link":"http://www.earwolf.com/episode/athletes-head/","author":"","publishedDate":"Mon, 06 Apr 2015 02:19:53 -0700","contentSnippet":"A real triple threat -- actress, singer-songwriter, and pianist Alicia Witt gets the first timer treatment as Intern Gino ...","content":"A real triple threat -- actress, singer-songwriter, and pianist Alicia Witt gets the first timer treatment as Intern Gino returns to co-host on today's Comedy Bing Bong! We hear about Alicias time as a teenager on the TV show Cybill, the album cover...","categories":[]},{"title":"342 Thomas Middleditch, Kumail Nanjiani, Martin Starr, Paul F. Tompkins","link":"http://www.earwolf.com/episode/a-silicon-valley-p-cast/","author":"","publishedDate":"Mon, 30 Mar 2015 00:04:26 -0700","contentSnippet":"The stars of HBO's Silicon Valley, Thomas Middleditch, Kumail Nanjiani, and Martin Starr share some spoilers from both the ...","content":"The stars of HBO's Silicon Valley, Thomas Middleditch, Kumail Nanjiani, and Martin Starr share some spoilers from both the first and the upcoming second season season of their show on todays Comedy Bing! Bong! They also talk about the history of TV b...","categories":[]},{"title":"341 Stars, Claudia O'Doherty, Neil Campbell","link":"http://www.earwolf.com/episode/banging-the-table-with-stars/","author":"","publishedDate":"Mon, 23 Mar 2015 00:04:57 -0700","contentSnippet":"The tables are being banged on as lead-singers Torquil \u0026 Amy of Stars join Scott on this weeks Comedy Bing! Bong! Theyll tell ...","content":"The tables are being banged on as lead-singers Torquil \u0026amp; Amy of Stars join Scott on this weeks Comedy Bing! Bong! Theyll tell us about the bands origin story, making each other sing embarrassing lyrics, and play songs off their latest album No One Is...","categories":[]},{"title":"340 LIVE from SXSW 2015 II: Tig Notaro, Stephanie Allynne, Mary Holland, Lauren Lapkus, James Adomian","link":"http://www.earwolf.com/episode/live-from-sxsw-2015-ii/","author":"","publishedDate":"Thu, 19 Mar 2015 01:24:15 -0700","contentSnippet":"This week's B-B-B-ONUS-S-S Comedy Bing! Bong! was recorded LIVE from the South by Southwest Festival in Austin, Texas with ...","content":"This week's B-B-B-ONUS-S-S Comedy Bing! Bong! was recorded LIVE from the South by Southwest Festival in Austin, Texas with Professor Blastoff's own Tig Notaro! Tig shares a story with us that is sure to keep Austin weird and tells us about her new Sh...","categories":[]},{"title":"339 LIVE from SXSW 2015: Lauren Lapkus, Colin Hanks, Nick Kroll, Horatio Sanz","link":"http://www.earwolf.com/episode/live-from-sxsw-2015/","author":"","publishedDate":"Mon, 16 Mar 2015 00:04:35 -0700","contentSnippet":"Comedy Bing! Bong! makes its way back to the South by Southwest Festival in Austin, Texas and Scott brings along his nephew ...","content":"Comedy Bing! Bong! makes its way back to the South by Southwest Festival in Austin, Texas and Scott brings along his nephew Todd to serve as today\u0026#39;s co-host! They welcome two of America\u0026#39;s finest actors, Colin Hanks \u0026amp; Nick Kroll to the show to speak o...","categories":[]},{"title":"338 Michael Ableson, Paul F. Tompkins, Andy Daly, Lauren Lapkus","link":"http://www.earwolf.com/episode/be-my-guest-literally/","author":"","publishedDate":"Mon, 09 Mar 2015 00:41:25 -0700","contentSnippet":"Its a special co-host edition of Comedy Bing Bong with our favorite German film director Werner Herzog! Werner \u0026 Scott welcome ...","content":"Its a special co-host edition of Comedy Bing Bong with our favorite German film director Werner Herzog! Werner \u0026amp; Scott welcome guest of honor Michael Ableson, a NYC corporate litigator AND Origin Story documentary donator to tell us all about being t...","categories":[]},{"title":"337 Weird Al Yankovic, Paul F. Tompkins, Joe Wengert","link":"http://www.earwolf.com/episode/the-ying-and-the-yankovic/","author":"","publishedDate":"Mon, 02 Mar 2015 00:04:46 -0800","contentSnippet":"We command thee to listen to music titans \"Weird Al\" Yankovic \u0026 Lord Andrew Lloyd Webber on todays Comedy Bing Bong! The Vicar ...","content":"We command thee to listen to music titans \u0026quot;Weird Al\u0026quot; Yankovic \u0026amp; Lord Andrew Lloyd Webber on todays Comedy Bing Bong! The Vicar of Yanks tells us all about his upcoming (potentially infinite) world tour and Lord Webber finally explains what\u0026#39;s the deal...","categories":[]},{"title":"336 Harris Wittels, Chelsea Peretti, Adam Scott","link":"http://www.earwolf.com/episode/not-farts-procreation-4/","author":"","publishedDate":"Sun, 22 Feb 2015 23:45:52 -0800","contentSnippet":"4 years ago, maybe the greatest recording in Earwolf history took place. Now, the Farts and Procreation crew aka Harris ...","content":"4 years ago, maybe the greatest recording in Earwolf history took place. Now, the Farts and Procreation crew aka Harris Wittels, Chelsea Peretti, and Adam Scott return for the fourth time to attempt to recreate the magic. Creak, slam, sit, and chill...","categories":[]},{"title":"335 Colin Hay, Gillian Jacobs, Paul F. Tompkins","link":"http://www.earwolf.com/episode/the-wedding-of-gilli-and-garry/","author":"","publishedDate":"Mon, 16 Feb 2015 00:04:09 -0800","contentSnippet":"You're cordially invited to attend the wedding of Gillian Jacobs \u0026 Garry Marshall on this special episode of Comedy Bing Bong. ...","content":"You\u0026#39;re cordially invited to attend the wedding of Gillian Jacobs \u0026amp; Garry Marshall on this special episode of Comedy Bing Bong. Master singer-songwriter Colin Hay of Men at Work is playing songs from his new record Next Year People to celebrate their...","categories":[]},{"title":"334 David Cross, James Adomian, Matt Walsh","link":"http://www.earwolf.com/episode/the-dream-team/","author":"","publishedDate":"Thu, 12 Feb 2015 00:02:45 -0800","contentSnippet":"David Cross of Mr. Show brings along James Adomian \u0026 Matt Walsh, the stars of his directorial debut Hits on this week's ...","content":"David Cross of Mr. Show brings along James Adomian \u0026amp; Matt Walsh, the stars of his directorial debut Hits on this week\u0026#39;s b-b-b-onus-s-s Comedy Bean Bag! Theyll talk extensively about the inception of the film beginning with the title, their lovers, an...","categories":[]},{"title":"333 Jack Antonoff, Horatio Sanz, Miriam Tolan","link":"http://www.earwolf.com/episode/pit-stop/","author":"","publishedDate":"Mon, 09 Feb 2015 00:04:42 -0800","contentSnippet":"Jack Antonoff of fun. \u0026 Bleachers finally makes his way onto Comedy Bing Bong for a serious chat about love. Scott \u0026 Jack talk ...","content":"Jack Antonoff of fun. \u0026amp; Bleachers finally makes his way onto Comedy Bing Bong for a serious chat about love. Scott \u0026amp; Jack talk about immortality, marriage, and Jacks personal 10 commandments. Then, Susan and Jacob Brooks of Pit Stop in Beverly Hills...","categories":[]},{"title":"332 Kyle Kinane, Matt Braunger, Fran Gillespie, Neil Campbell","link":"http://www.earwolf.com/episode/what-winsome-said/","author":"","publishedDate":"Mon, 02 Feb 2015 00:22:02 -0800","contentSnippet":"Two of the world's best comedians and pals from Chicago, Kyle Kinane \u0026 Matt Braunger are on today's Comedy Bing Bong! Scott \u0026 ...","content":"Two of the world\u0026#39;s best comedians and pals from Chicago, Kyle Kinane \u0026amp; Matt Braunger are on today\u0026#39;s Comedy Bing Bong! Scott \u0026amp; Matt do some long form improv, Matt tells us all about his new comedy special Big Dumb Animal, Kyle teases us with some info...","categories":[]},{"title":"331 Patton Oswalt, Lauren Lapkus, Mary Holland","link":"http://www.earwolf.com/episode/secret-superlatives/","author":"","publishedDate":"Mon, 26 Jan 2015 00:04:56 -0800","contentSnippet":"Comedian extraordinaire Patton Oswalt is back to tell us all about his new book Silver Screen Fiend which goes into his classic ...","content":"Comedian extraordinaire Patton Oswalt is back to tell us all about his new book Silver Screen Fiend which goes into his classic film obsession of the late 90s on todays Comedy Bing Bong! Patton \u0026amp; Scott talk about the time they improvised a live stage...","categories":[]},{"title":"330 Jim Rash, Horatio Sanz","link":"http://www.earwolf.com/episode/peruvian-pullovers/","author":"","publishedDate":"Mon, 19 Jan 2015 00:06:56 -0800","contentSnippet":"Academy award winner Jim Rash joins the first timers club on todays Comedy Bean Bag! Jim tells us about the upcoming 6th season ...","content":"Academy award winner Jim Rash joins the first timers club on todays Comedy Bean Bag! Jim tells us about the upcoming 6th season of Community on Yahoo! Screen, potential plot lines involving his character Marquess of Queensberry on Mike Tyson Mysterie...","categories":[]},{"title":"329 Nick Kroll, John Mulaney","link":"http://www.earwolf.com/episode/too-much-tuna-tour/","author":"","publishedDate":"Mon, 12 Jan 2015 00:05:12 -0800","contentSnippet":"Oh, hello CBB listeners. Nick Kroll of The League \u0026 Kroll Show returns to the stuudge to give us all the details on the final ...","content":"Oh, hello CBB listeners. Nick Kroll of The League \u0026amp; Kroll Show returns to the stuudge to give us all the details on the final season of Kroll Show as well as take some calls before joining Scott in a new segment called Get To The Gifts. Then, George...","categories":[]},{"title":"328 American Football, Anders Holm, Mike Hanford","link":"http://www.earwolf.com/episode/beatle-heaven/","author":"","publishedDate":"Thu, 08 Jan 2015 01:28:36 -0800","contentSnippet":"2015 is starting to look like the year of first timers as Anders Holm of Workaholics and Mike, Steve, and Steve of the Rock n ...","content":"2015 is starting to look like the year of first timers as Anders Holm of Workaholics and Mike, Steve, and Steve of the Rock n Roll band American Football join Scott for a B-B-B-ONUS-S-S-S episode of Comedy Bing Bong! Well hear some amazing acoustic p...","categories":[]},{"title":"327 Ben Schwartz, Horatio Sanz","link":"http://www.earwolf.com/episode/bang-bang-into-your-mouth/","author":"","publishedDate":"Mon, 05 Jan 2015 00:04:43 -0800","contentSnippet":"House of Pies star Ben Schwartz aka Benny Schwaz \u0026 Saturday Night Pies alum Horatio Sanz are back to kick off the new year on ...","content":"House of Pies star Ben Schwartz aka Benny Schwaz \u0026amp; Saturday Night Pies alum Horatio Sanz are back to kick off the new year on Comedy Bing Bong! Everyone chats about Scotts time working at Disneyland, Horatio dressing like Captain Crunch for a gig, an...","categories":[]},{"title":"Best of 2014 Pt 4","link":"http://www.earwolf.com/episode/best-of-2014-pt-4/","author":"","publishedDate":"Wed, 31 Dec 2014 23:35:34 -0800","contentSnippet":"The exciting conclusion of the Comedy Bang! Bang! best of 2014 countdown with Paul F. Tompkins is here with numbers three to ...","content":"The exciting conclusion of the Comedy Bang! Bang! best of 2014 countdown with Paul F. Tompkins is here with numbers three to one of the best CBB eps that YOU have chosen! Happy New Year!","categories":[]},{"title":"Best of 2014 Pt 3","link":"http://www.earwolf.com/episode/best-of-2014-pt-3/","author":"","publishedDate":"Mon, 29 Dec 2014 00:04:00 -0800","contentSnippet":"It's getting real close to the end with part three of the Comedy Bang! Bang! best of countdown as Scott and special guest Paul ...","content":"It's getting real close to the end with part three of the Comedy Bang! Bang! best of countdown as Scott and special guest Paul F. Tompkins get into the meat of the matter and count down numbers seven through four. Sit tight and look out for the final...","categories":[]},{"title":"Best of 2014 Pt 2","link":"http://www.earwolf.com/episode/best-of-2014-pt-2/","author":"","publishedDate":"Wed, 24 Dec 2014 22:40:28 -0800","contentSnippet":"Merry Christmas to you all! The best of Comedy Bang! Bang! countdown 2014 continues with Scott and special guest Paul F. ...","content":"Merry Christmas to you all! The best of Comedy Bang! Bang! countdown 2014 continues with Scott and special guest Paul F. Tompkins as they count down numbers eleven through eight of the best episodes YOU voted for! Come back Monday for Pt 3!","categories":[]},{"title":"Best of 2014 Pt 1","link":"http://www.earwolf.com/episode/best-of-2014-pt-1/","author":"","publishedDate":"Mon, 22 Dec 2014 00:04:17 -0800","contentSnippet":"Say bye bye to another year but say hello hello to the new year with the best of 2014 episode of Comedy Bang! Bang! One of our ...","content":"Say bye bye to another year but say hello hello to the new year with the best of 2014 episode of Comedy Bang! Bang! One of our faves, Paul F. Tompkins joins Scott to countdown numbers fifteen through twelve of the best CBB eps of 2014 that YOU voted...","categories":[]},{"title":"326 2014 Holiday Spectacular","link":"http://www.earwolf.com/episode/2014-holiday-spectacular/","author":"","publishedDate":"Mon, 15 Dec 2014 00:04:33 -0800","contentSnippet":"Ho! Ho! Ho! It's the year end holiday episode of Comedy Bean Bag with music from The Both (Aimee Mann \u0026 Ted Leo) and guests ...","content":"Ho! Ho! Ho! It\u0026#39;s the year end holiday episode of Comedy Bean Bag with music from The Both (Aimee Mann \u0026amp; Ted Leo) and guests galore! Director of the Underworld series, Len Wiseman is back for the CBB festivities that will include visits from some spoo...","categories":[]},{"title":"325 Skylar Astin, Rory Scovel, Pamela Murphy, Will Hines","link":"http://www.earwolf.com/episode/musical-organs/","author":"","publishedDate":"Mon, 08 Dec 2014 02:12:04 -0800","contentSnippet":"Ground Floor stars Skylar Astin \u0026 Rory Scovel are two bros that are todays Comedy Bean Bag! Skylar, Rory, \u0026 Scott chat about ...","content":"Ground Floor stars Skylar Astin \u0026amp; Rory Scovel are two bros that are todays Comedy Bean Bag! Skylar, Rory, \u0026amp; Scott chat about the new season of TBS\u0026#39;s Ground Floor, which songs will be in Pitch Perfect 2, and Rory\u0026#39;s future comedy special that is in the...","categories":[]},{"title":"324 Colin Hanks, Lauren Lapkus, Stephanie Allynne, Mary Holland, Erin Whitehead","link":"http://www.earwolf.com/episode/golden-duchess-cruise-lines/","author":"","publishedDate":"Mon, 01 Dec 2014 00:05:39 -0800","contentSnippet":"Returning champion Colin Hanks of FX's Fargo is here to talk about his humble beginnings on Comedy Bean Bag! Colin tells us all ...","content":"Returning champion Colin Hanks of FX's Fargo is here to talk about his humble beginnings on Comedy Bean Bag! Colin tells us all about one of his first acting roles on Roswell, the status of his Tower Records documentary, and the record that got him h...","categories":[]},{"title":"323 Tears for Fears, Reggie Watts, Paul F. Tompkins","link":"http://www.earwolf.com/episode/pie-quiz-with-tears-for-fears/","author":"","publishedDate":"Mon, 24 Nov 2014 01:42:04 -0800","contentSnippet":"The writers and performers of such iconic pop hits as Mad World, Shout, and Everybody Wants To Rule The World, Tears For Fears ...","content":"The writers and performers of such iconic pop hits as Mad World, Shout, and Everybody Wants To Rule The World, Tears For Fears are in the studio as well as Scotts old pal Reggie Watts on this weeks Comedy Bing Bong! Well hear all about how Curt \u0026amp; Rol...","categories":[]},{"title":"322 Chelsea Peretti, Seth Morris","link":"http://www.earwolf.com/episode/youtube-phenomana/","author":"","publishedDate":"Mon, 17 Nov 2014 00:04:28 -0800","contentSnippet":"One of the greats, Chelsea Peretti of Brooklyn Nine-Nine and Farts and Procreation fame returns to Comedy Bean Bag! Chelsea ...","content":"One of the greats, Chelsea Peretti of Brooklyn Nine-Nine and Farts and Procreation fame returns to Comedy Bean Bag! Chelsea tells us all about her new Netflix special One of the Greats, her dads reaction to when she got her RZ Cola, and her first LA...","categories":[]},{"title":"321 Ana Gasteyer, Jon Gabrus, Mookie Blaiklock","link":"http://www.earwolf.com/episode/big-fat-voice/","author":"","publishedDate":"Mon, 10 Nov 2014 00:30:35 -0800","contentSnippet":"SNL Hall of Famer and Suburgatory's Ana Gasteyer joins the first timer club and Intern Gino returns on this week's Comedy Bean ...","content":"SNL Hall of Famer and Suburgatory's Ana Gasteyer joins the first timer club and Intern Gino returns on this week's Comedy Bean Bag! Ana tells us about her Broadway career post SNL, shares what her SNL dream cast would be, and plays a couple of tracks...","categories":[]},{"title":"320 Alex Borstein, Brendon Small, Molly Bretthauer","link":"http://www.earwolf.com/episode/charging-kids/","author":"","publishedDate":"Mon, 03 Nov 2014 00:04:38 -0800","contentSnippet":"Family Guy \u0026 HBO's Getting On star Alex Borstein makes her debut on this week's Comedy Bean Bag! Alex chats about the different ...","content":"Family Guy \u0026amp; HBO\u0026#39;s Getting On star Alex Borstein makes her debut on this week\u0026#39;s Comedy Bean Bag! Alex chats about the different Lois Griffin voices she does for the week, her stage show Star Wars in 10 Minutes, and getting into her character on Getti...","categories":[]},{"title":"319 Halloween, Brett Gelman, Jon Daly, Allan McLeod, Nick Wiger, Caroline Anderson","link":"http://www.earwolf.com/episode/return-to-suicide-house-part-gore/","author":"","publishedDate":"Thu, 30 Oct 2014 00:04:27 -0700","contentSnippet":"Welp, it appears that Scott's car broke down once again outside a spoOoOoky house on 1122 Boogie Woogie Avenue which can only ...","content":"Welp, it appears that Scott's car broke down once again outside a spoOoOoky house on 1122 Boogie Woogie Avenue which can only mean one thing. Rot Awfulman has again stumbled upon the Werewolf Studios and is in the presence of the ghoulish Beuford and...","categories":[]},{"title":"318 Wyatt Cenac, Matt Besser, Jocelyn DeBoer","link":"http://www.earwolf.com/episode/lumber-hack/","author":"","publishedDate":"Mon, 27 Oct 2014 00:07:23 -0700","contentSnippet":"Wyatt Cenac of The Daily Show and his new Netflix comedy special Brooklyn returns to Comedy Big Bang Theory! Wyatt tells us a ...","content":"Wyatt Cenac of The Daily Show and his new Netflix comedy special Brooklyn returns to Comedy Big Bang Theory! Wyatt tells us a bit about his new stand-up special after he gets to know the mysterious hacker Paul Funyuns, the man behind the recent leake...","categories":[]},{"title":"317 Natasha Lyonne, Paul F. Tompkins, Mary Holland","link":"http://www.earwolf.com/episode/tash-2/","author":"","publishedDate":"Mon, 20 Oct 2014 00:30:42 -0700","contentSnippet":"Orange Is the New Black's Natasha Lyonne makes her first appearance \u0026 dapper comedian Paul F. Tompkins makes a rare appearance ...","content":"Orange Is the New Black\u0026#39;s Natasha Lyonne makes her first appearance \u0026amp; dapper comedian Paul F. Tompkins makes a rare appearance on today\u0026#39;s Comedy Bean Bag! Natasha, Paul, \u0026amp; Scott chat about silent films, the first time Natasha met Woody Allen, and gre...","categories":[]},{"title":"316 Dane Cook, Reggie Watts, Neil Campbell","link":"http://www.earwolf.com/episode/in-the-larp-run/","author":"","publishedDate":"Thu, 16 Oct 2014 00:04:03 -0700","contentSnippet":"Dane Cook and Reggie Watts dig deep to talk comedy on this week's B-B-B-BONUS Comedy Bang Bang! Scott, Reggie and Dane share ...","content":"Dane Cook and Reggie Watts dig deep to talk comedy on this week's B-B-B-BONUS Comedy Bang Bang! Scott, Reggie and Dane share their excitement for the mid-season premiere of season three of Comedy Bang Bang: The TV series, which premieres on IFC on Fr...","categories":[]},{"title":"315 Ken Marino, Casey Wilson, Joe Wengert","link":"http://www.earwolf.com/episode/sandwich-therapy/","author":"","publishedDate":"Mon, 13 Oct 2014 00:31:21 -0700","contentSnippet":"Ken Marino \u0026 Casey Wilson of NBCs Marry Me sing their hearts out on this weeks Comedy Bean Bag! After giving us an oral history ...","content":"Ken Marino \u0026amp; Casey Wilson of NBCs Marry Me sing their hearts out on this weeks Comedy Bean Bag! After giving us an oral history of their new show Marry Me, Ken \u0026amp; Casey collabo once more as they create a brand new going to commercial theme song. Then,...","categories":[]},{"title":"314 Cameron Esposito, Paul F. Tompkins","link":"http://www.earwolf.com/episode/yall-heard-any-of-these-names-before/","author":"","publishedDate":"Mon, 06 Oct 2014 00:05:05 -0700","contentSnippet":"Comedian extraordinaire Cameron Esposito of Put Your Hands Together returns to tell us all about her new stand-up album Same ...","content":"Comedian extraordinaire Cameron Esposito of Put Your Hands Together returns to tell us all about her new stand-up album Same Sex Symbol on today\u0026#39;s Comedy Bing Bong! Cameron \u0026amp; Scott chat about eradicating men from the Earth, Portland food, and Cameron...","categories":[]},{"title":"313 Ben Schwartz, Horatio Sanz, Paul Banks","link":"http://www.earwolf.com/episode/gumbo-challenge/","author":"","publishedDate":"Mon, 29 Sep 2014 00:04:29 -0700","contentSnippet":"Ben Schwartz aka Benny Schwaz of House of Pies is here along with musical guest Paul Banks of Interpol on this weeks musical ...","content":"Ben Schwartz aka Benny Schwaz of House of Pies is here along with musical guest Paul Banks of Interpol on this weeks musical episode of Comedy Bing Bong! They talk about Interpols new album El Pintor and good heckles for bands before sound proofer Da...","categories":[]},{"title":"312 Andy Samberg, Lauren Lapkus","link":"http://www.earwolf.com/episode/grounded-meat/","author":"","publishedDate":"Mon, 22 Sep 2014 00:04:22 -0700","contentSnippet":"Fall TV premieres are back baby! Brooklyn Nine-Nine star Andy Samberg returns to Comedy Bean Bag along with Scotts nephew Todd ...","content":"Fall TV premieres are back baby! Brooklyn Nine-Nine star Andy Samberg returns to Comedy Bean Bag along with Scotts nephew Todd to talk all things Hollywood, Todd \u0026amp; Scotts potential sitcom, the new season of B-99, and eating pee popsicles. Then, a gam...","categories":[]},{"title":"311 Joe Lo Truglio, Beth Dover","link":"http://www.earwolf.com/episode/dennys-boys/","author":"","publishedDate":"Thu, 18 Sep 2014 00:04:13 -0700","contentSnippet":"Brooklyn Nine-Nine star \u0026 The State alumni Joe Lo Truglio is back on a bonus Comedy Bean Bag! Scott \u0026 Joe bro out over ...","content":"Brooklyn Nine-Nine star \u0026amp; The State alumni Joe Lo Truglio is back on a bonus Comedy Bean Bag! Scott \u0026amp; Joe bro out over giraffes, role models, and Dennys. Joe then shares the spotlight as he and Scott help housewife Saman Thughgh with her plan to land...","categories":[]},{"title":"310 Kevin Allison, Pamela Murphy, John Gemberling","link":"http://www.earwolf.com/episode/little-button-puss/","author":"","publishedDate":"Mon, 15 Sep 2014 00:04:07 -0700","contentSnippet":"WARNING: Kevin Allison of the groundbreaking sketch comedy troupe The State \u0026 the RISK! podcast joins the first timer club on ...","content":"WARNING: Kevin Allison of the groundbreaking sketch comedy troupe The State \u0026amp; the RISK! podcast joins the first timer club on today\u0026#39;s Comedy Bing Bong! Kevin lets us know the deets surrounding the upcoming The State reunion at Festival Supreme, the o...","categories":[]},{"title":"309 Nick Kroll, Jimmy Pardo, Claudia O'Doherty","link":"http://www.earwolf.com/episode/tony-macaroni/","author":"","publishedDate":"Mon, 08 Sep 2014 00:04:40 -0700","contentSnippet":"Happy National Anthem to You! Kroll Show's Nick Kroll \u0026 Never Not Funny's Jimmy Pardo are here to chat about the legacy of Don ...","content":"Happy National Anthem to You! Kroll Show\u0026#39;s Nick Kroll \u0026amp; Never Not Funny\u0026#39;s Jimmy Pardo are here to chat about the legacy of Don Pardo, Nick\u0026#39;s entourage, and their favorite Ghostbuster songs on this week\u0026#39;s Comedy Bean Bag! Later, Claudia O\u0026#39;Doherty retu...","categories":[]},{"title":"308 Matt Gourley, Mark McConville, Jeremy Carter, Paul F. Tompkins: Superego","link":"http://www.earwolf.com/episode/superego-loose-beginnings-tight-ends/","author":"","publishedDate":"Mon, 01 Sep 2014 00:14:43 -0700","contentSnippet":"You're in luck this Labor Day because Matt Gourley, Mark McConville, Jeremy Carter, and Paul F. Tompkins of the Superego ...","content":"You're in luck this Labor Day because Matt Gourley, Mark McConville, Jeremy Carter, and Paul F. Tompkins of the Superego podcast are all here to celebrate their new 4th season! What is the origin story behind Superego? What lead to PFT joining the gr...","categories":[]},{"title":"307 Tenacious D, Lauren Lapkus, Joe Wengert","link":"http://www.earwolf.com/episode/ruths-ross-dress-for-loss/","author":"","publishedDate":"Mon, 25 Aug 2014 00:25:16 -0700","contentSnippet":"The masters of their craft, Jack Black and Kyle Gass of Tenacious D join the first timers club on this week's Comedy Bing Bong! ...","content":"The masters of their craft, Jack Black and Kyle Gass of Tenacious D join the first timers club on this week's Comedy Bing Bong! They talk about their life expectancy, hanging out in the Mr. Show days, and give us a 'sclusy regarding the spooky themed...","categories":[]},{"title":"306 Paul Rust, Harris Wittels, Michael Cassady, Don't Stop Or We'll Die","link":"http://www.earwolf.com/episode/project-funway/","author":"","publishedDate":"Thu, 21 Aug 2014 02:10:38 -0700","contentSnippet":"Don't ever stop listening to this podcast or Paul Rust, Harris Wittels, and Michael Cassady from our favorite comedy-pop ...","content":"Don't ever stop listening to this podcast or Paul Rust, Harris Wittels, and Michael Cassady from our favorite comedy-pop crossover act Don't Stop or We'll Die will die from being unable to make your sides hurt from laughter here on a bonus Kobe Beef...","categories":[]},{"title":"305 Howard Kremer, Kulap Vilaysack, Jon Gabrus","link":"http://www.earwolf.com/episode/cattlelickitup/","author":"","publishedDate":"Mon, 18 Aug 2014 00:04:07 -0700","contentSnippet":"Howard Kremer \u0026 Kulap Vilaysack of the fellow Earwolf podcast Who Charted? are both here with separate amazing projects to ...","content":"Howard Kremer \u0026amp; Kulap Vilaysack of the fellow Earwolf podcast Who Charted? are both here with separate amazing projects to share with us as well as the return of intern Gino Lambardo on todays Comedy Bean Bag! After Gino gives us his take on whats be...","categories":[]},{"title":"304 Jessica St. Clair, Lennon Parham, Lauren Lapkus, Jason Mantzoukas, Brian Huskey, Melissa Rauch, Andy Daly","link":"http://www.earwolf.com/episode/marissa-womplers-six-flags-birthday-womptacular/","author":"","publishedDate":"Mon, 11 Aug 2014 00:04:23 -0700","contentSnippet":"WOMP IT UP! LIVE from high above the Log flume ride in Six Flags Magic Mountain in Valencia, California, it's Marissa Wompler's ...","content":"WOMP IT UP! LIVE from high above the Log flume ride in Six Flags Magic Mountain in Valencia, California, it's Marissa Wompler's Birthday Party Womptacular with Miss Listler, Marissa's step dad Dr. Seth Wompler, Eric \"Gutterballs\" Gutterman, and possi...","categories":[]},{"title":"303 Paul F. Tompkins, Loudon Wainwright III","link":"http://www.earwolf.com/episode/puttering-around/","author":"","publishedDate":"Mon, 04 Aug 2014 00:04:17 -0700","contentSnippet":"Need an experience to keep you from puttering around your home? Well, this weeks episode has it all including a rare appearance ...","content":"Need an experience to keep you from puttering around your home? Well, this weeks episode has it all including a rare appearance from CBB favorite Paul F. Tompkins and returning champ/singer-songwriter Loudon Wainwright III! Were treated to live songs...","categories":[]},{"title":"302 Mary Lynn Rajskub, Eddie Pepitone, Twin Shadow","link":"http://www.earwolf.com/episode/milkshake-movies/","author":"","publishedDate":"Thu, 31 Jul 2014 00:04:28 -0700","contentSnippet":"24's Mary Lynn Rajskub is back to finally bring together the worlds of action, comedy \u0026 music with the help of ...","content":"24\u0026#39;s Mary Lynn Rajskub is back to finally bring together the worlds of action, comedy \u0026amp; music with the help of singer-songwriter Twin Shadow on this weeks bonus Comedy Bing Bong! Scott \u0026amp; Mary try to guess the title of Twin Shadow\u0026#39;s upcoming album whi...","categories":[]},{"title":"301 Jonah Ray, Kumail Nanjiani, Brendon Small","link":"http://www.earwolf.com/episode/theyre-twins-jonah/","author":"","publishedDate":"Mon, 28 Jul 2014 00:04:09 -0700","contentSnippet":"The stars of The Meltdown with Jonah \u0026 Kumail, the titular Jonah Ray \u0026 Kumail Nanjiani return to ring in the new hundo on ...","content":"The stars of The Meltdown with Jonah \u0026amp; Kumail, the titular Jonah Ray \u0026amp; Kumail Nanjiani return to ring in the new hundo on today\u0026#39;s Comedy Bing Bong Theory! After a delightful chat about jazz, their favorite skits, and waterproof books, Victor Diamond...","categories":[]},{"title":"300 Jason Mantzoukas, Andy Daly","link":"http://www.earwolf.com/episode/oh-golly-you-devil/","author":"","publishedDate":"Mon, 21 Jul 2014 00:04:44 -0700","contentSnippet":"What better way to celebrate the 300th episode of Comedy Bang! Bang! than having a bro down hoedown with Jason Mantzoukas! As ...","content":"What better way to celebrate the 300th episode of Comedy Bang! Bang! than having a bro down hoedown with Jason Mantzoukas! As Scott \u0026amp; Jason look back at some of their favorite CBB moments, they remember that they never released the conclusion to the...","categories":[]},{"title":"299 Weird Al Yankovic, Claudia O'Doherty","link":"http://www.earwolf.com/episode/dont-hack-the-sac/","author":"","publishedDate":"Tue, 15 Jul 2014 00:04:32 -0700","contentSnippet":"Returning champion and the titular Weird Al Yankovic of the new album  Mandatory Fun  is here on this weeks very special ...","content":"Returning champion and the titular Weird Al Yankovic of the new album  Mandatory Fun  is here on this weeks very special Tuesday episode of Comedy Bang! Bang! which is a mandatory listen! Weird Al gives us a taste of his new album, explains what his...","categories":[]},{"title":"298 Paul Scheer, Dannah Phirman, Danielle Schneider, Tymberlee Hill, Andrea Savage","link":"http://www.earwolf.com/episode/hotwives-of-orlando/","author":"","publishedDate":"Mon, 07 Jul 2014 00:04:34 -0700","contentSnippet":"Celebrity Paul Scheer of The League, NTSF:SD:SUV, and How Did This Get Made? fame always has always had his eye on the next big ...","content":"Celebrity Paul Scheer of The League, NTSF:SD:SUV, and How Did This Get Made? fame always has always had his eye on the next big thing on television. This time around he doesnt disappoint as he brought along Shauna, Phe Phe, Veronica, and Allie of the...","categories":[]},{"title":"297 Nathan Fielder, Joe Wengert, James Adomian","link":"http://www.earwolf.com/episode/canadian-apparel/","author":"","publishedDate":"Mon, 30 Jun 2014 00:04:43 -0700","contentSnippet":"Comedy titan and the titular Nathan Fielder, star of Comedy Centrals Nathan For You is back on todays Comedy Bing! Bong! Nathan ...","content":"Comedy titan and the titular Nathan Fielder, star of Comedy Centrals Nathan For You is back on todays Comedy Bing! Bong! Nathan tells us a bit about season 2 of Nathan For You, his recent obsession with reflections on Instagram, and swears that he kn...","categories":[]},{"title":"296 David Wain, Michael Showalter, Neil Campbell","link":"http://www.earwolf.com/episode/taking-the-bladder-out/","author":"","publishedDate":"Mon, 23 Jun 2014 00:10:30 -0700","contentSnippet":"Life long pals David Wain \u0026 Michael Showalter have reunited to co-write a brand new rom-com called They Came Together and ...","content":"Life long pals David Wain \u0026amp; Michael Showalter have reunited to co-write a brand new rom-com called They Came Together and they\u0026#39;re here on CBB to tell us all about it! Theyll get into the good ol days of listening to podcasts on road trips to NYU, how...","categories":[]},{"title":"295 Alex Anfanger, Dan Schimpf, Lauren Lapkus","link":"http://www.earwolf.com/episode/i-turned-it-on-for-the-dog-penis/","author":"","publishedDate":"Thu, 19 Jun 2014 00:04:21 -0700","contentSnippet":"The impresarios behind the hit web-series \"Next Time on Lonny,\" Alex Anfanger \u0026 Dan Schimpf are here along with today's co-host ...","content":"The impresarios behind the hit web-series \u0026quot;Next Time on Lonny,\u0026quot; Alex Anfanger \u0026amp; Dan Schimpf are here along with today\u0026#39;s co-host Traci Rearden on a bonus Comedy Bing Bong! Well hear about the new season of Next Time on Lonny, the process behind Alex \u0026amp;...","categories":[]},{"title":"294 Ian Edwards, Brendon Small, Jessica St. Clair","link":"http://www.earwolf.com/episode/honk-shoo/","author":"","publishedDate":"Mon, 16 Jun 2014 00:04:50 -0700","contentSnippet":"First timers Ian Edwards and number one corporate rock comedian Bernie Fretts jam out on today's Comedy Bang Bang aka CBB! It ...","content":"First timers Ian Edwards and number one corporate rock comedian Bernie Fretts jam out on today's Comedy Bang Bang aka CBB! It wouldnt be a true jam sesh without Marissa Wompler here to womp up the jamz as well as drop a bombshell on our heads. If tha...","categories":[]},{"title":"293 Phil Lord, Chris Miller, Jon Gabrus, Eugene Cordero","link":"http://www.earwolf.com/episode/monster-muscles/","author":"","publishedDate":"Thu, 12 Jun 2014 00:04:36 -0700","contentSnippet":"21 and 22 Jump Street directors Phil Lord \u0026 Chris Miller join Scott \u0026 intern Gino Lambardo for special emergency bonus episode ...","content":"21 and 22 Jump Street directors Phil Lord \u0026amp; Chris Miller join Scott \u0026amp; intern Gino Lambardo for special emergency bonus episode of Comedy Bing Bong! We\u0026#39;ll get into Lord \u0026amp; Miller\u0026#39;s career from Clone High to The Lego Movie, find out how a sequel to 21 J...","categories":[]},{"title":"292 Jenny Slate, Merrill Garbus, Jon Daly","link":"http://www.earwolf.com/episode/djs-are-sleaze-js/","author":"","publishedDate":"Mon, 09 Jun 2014 00:32:02 -0700","contentSnippet":"Obvious Child's Jenny Slate and lead singer of the tUnE-yArDs, Merrill Garbus join forces to find out what they have in common ...","content":"Obvious Child's Jenny Slate and lead singer of the tUnE-yArDs, Merrill Garbus join forces to find out what they have in common as artists on todays Comedy Bing Bong! Jenny tells us about her role in the new film Obvious Child as well as showcases her...","categories":[]},{"title":"291 Bob Odenkirk, Adam Resnick, Neil Casey, Fran Gillespie","link":"http://www.earwolf.com/episode/summer-haunted-house/","author":"","publishedDate":"Thu, 05 Jun 2014 00:05:23 -0700","contentSnippet":"Better Call Saul's Bob Odenkirk \u0026 Cabin Boy director Adam Resnick stop on by for a b-b-b-bonus Comedy Bang! Bang! Bob debuts ...","content":"Better Call Saul\u0026#39;s Bob Odenkirk \u0026amp; Cabin Boy director Adam Resnick stop on by for a b-b-b-bonus Comedy Bang! Bang! Bob debuts his Johnny Carson impression, Adam reads an excerpt from his hilarious memoir  Will Not Attend: Lively Stories of Detachment...","categories":[]},{"title":"290 Todd Glass, James Adomian","link":"http://www.earwolf.com/episode/shed-busting/","author":"","publishedDate":"Mon, 02 Jun 2014 00:04:59 -0700","contentSnippet":"Comedian extraordinaire/friend of the show Todd Glass returns to Comedy Bang! Bang! and brings along the wonderful James ...","content":"Comedian extraordinaire/friend of the show Todd Glass returns to Comedy Bang! Bang! and brings along the wonderful James Adomian for his first time ever appearance! The guys chat about the early days of the CBB live show (formerly CDR), Todds new boo...","categories":[]},{"title":"289 Paul F. Tompkins, Matt Gourley","link":"http://www.earwolf.com/episode/the-exorcism-of-cake-boss/","author":"","publishedDate":"Mon, 26 May 2014 00:04:23 -0700","contentSnippet":"Straight from the cake kitchen, our old buddy Buddy Valastro aka Cake Boss (Cake Boss!) returns to talk about the new changes ...","content":"Straight from the cake kitchen, our old buddy Buddy Valastro aka Cake Boss (Cake Boss!) returns to talk about the new changes in the Star Wars canon when suddenly his body is possessed. The spirit of the recently deceased narco-sculptor H.R. Giger is...","categories":[]},{"title":"288 The Sklar Brothers, Horatio Sanz","link":"http://www.earwolf.com/episode/back-to-barz-back-to-reality/","author":"","publishedDate":"Thu, 22 May 2014 00:04:41 -0700","contentSnippet":"Randy \u0026 Jason Sklar make their way from Sklarbro Country as they return to the land of Comedy Bang! Bang! on this week's ...","content":"Randy \u0026amp; Jason Sklar make their way from Sklarbro Country as they return to the land of Comedy Bang! Bang! on this week\u0026#39;s b-b-b-onus episode! The Sklarbros chat about their new comedy special What Are We Talking About which is available on Netflix ins...","categories":[]},{"title":"287 Shane Torres, Lauren Lapkus","link":"http://www.earwolf.com/episode/stinky-chips/","author":"","publishedDate":"Mon, 19 May 2014 00:04:39 -0700","contentSnippet":"Portland comedian Shane Torres bursts his way into the first timers club on todays Comedy Bang! Bang! Shane talks about his ...","content":"Portland comedian Shane Torres bursts his way into the first timers club on todays Comedy Bang! Bang! Shane talks about his start in comedy in the land of Portland, his life after his previous appearance on the LIVE from Portland CBB ep, and possibly...","categories":[]},{"title":"286 Bobby Moynihan, Paul F. Tompkins","link":"http://www.earwolf.com/episode/time-bobby-3/","author":"","publishedDate":"Mon, 12 May 2014 00:04:32 -0700","contentSnippet":"The man, the myth, the music maker Sir Andrew Lloyd Webber returns to Comedy Bing Bong only to encounter a 90-year-old ...","content":"The man, the myth, the music maker Sir Andrew Lloyd Webber returns to Comedy Bing Bong only to encounter a 90-year-old gentleman complete with a full white beard by the name of Fourvel. Could this old chap be the same stabby lil' orphan boy from the...","categories":[]},{"title":"285 Ben Schwartz","link":"http://www.earwolf.com/episode/solo-bolo/","author":"","publishedDate":"Thu, 08 May 2014 00:03:38 -0700","contentSnippet":"You asked for it and now you've got it! Ben Schwartz aka Benny Schwaz of House of Pies is here for a SOLO BOLO episode of ...","content":"You asked for it and now you've got it! Ben Schwartz aka Benny Schwaz of House of Pies is here for a SOLO BOLO episode of Comedy Bang! Bang! What can you expect from a Solo Bolo? Tons of singing, classic impressions, and real talk between bros. So li...","categories":[]},{"title":"284 The Thrilling Adventure Hour","link":"http://www.earwolf.com/episode/a-thrilling-cbb-adventure-hour/","author":"","publishedDate":"Mon, 05 May 2014 00:26:11 -0700","contentSnippet":"Uh oh! It looks like actor extraordinaire Marc Evan Jackson from  The Thrilling Adventure Hour  has his second visit to Comedy ...","content":"Uh oh! It looks like actor extraordinaire Marc Evan Jackson from  The Thrilling Adventure Hour  has his second visit to Comedy Bang! Bang! cut short as a portal appears in the Earwolf studio and has transported some of the characters from The Thrilli...","categories":[]},{"title":"283 5th Anniversary, Jessica St. Clair, Lennon Parham, Jason Mantzoukas, Lauren Lapkus, Matt Besser, Paul F. Tompkins, Paul Rust, Neil Campbell","link":"http://www.earwolf.com/episode/the-5th-anniversary-show/","author":"","publishedDate":"Mon, 28 Apr 2014 00:04:43 -0700","contentSnippet":"IT'S BEEN 5 years of Comedy Bang Bang: The Podcast and all your favorites have returned for a bro out sesh! Get ready to ...","content":"IT'S BEEN 5 years of Comedy Bang Bang: The Podcast and all your favorites have returned for a bro out sesh! Get ready to experience our unbelievable open door policy as friends of the show Marissa Wompler, Miss Listler, Jason Mantzoukas, and Traci Re...","categories":[]},{"title":"282 Jessica St. Clair, Lennon Parham","link":"http://www.earwolf.com/episode/wompsters-university/","author":"","publishedDate":"Mon, 21 Apr 2014 00:04:31 -0700","contentSnippet":"WOMP IT UP! CBB intern Marissa Wompler \u0026 her life coach Miss Listler are back to catch us up on what's been going on in their ...","content":"WOMP IT UP! CBB intern Marissa Wompler \u0026amp; her life coach Miss Listler are back to catch us up on what\u0026#39;s been going on in their life since Marissa\u0026#39;s birthday pool party. Well hear how their recent college visits in Washington D.C. have gone, how Mariss...","categories":[]},{"title":"281 Matt Walsh, Tim Simons","link":"http://www.earwolf.com/episode/bro-boarders/","author":"","publishedDate":"Mon, 14 Apr 2014 00:04:38 -0700","contentSnippet":"Let's turn our gaze away from Los Angeles and move over to Washington D.C. which is where HBO's Veep takes place and Matt Walsh ...","content":"Let\u0026#39;s turn our gaze away from Los Angeles and move over to Washington D.C. which is where HBO\u0026#39;s Veep takes place and Matt Walsh \u0026amp; first timer Tim Simons are both HBO actors in. They\u0026#39;ll define political terms, describe the accents from their hometowns...","categories":[]},{"title":"280 Weird Al Yankovic, Paul F. Tompkins","link":"http://www.earwolf.com/episode/duality/","author":"","publishedDate":"Mon, 07 Apr 2014 00:04:58 -0700","contentSnippet":"You're getting two Als for the price of one as \"Weird Al\" Yankovic \u0026 Alan Thicke return on today's Comedy Bean Bag! There will ...","content":"You\u0026#39;re getting two Als for the price of one as \u0026quot;Weird Al\u0026quot; Yankovic \u0026amp; Alan Thicke return on today\u0026#39;s Comedy Bean Bag! There will be talk of juke boxicals, what we should expect from the next \u0026quot;Weird Al\u0026quot; album, and Alan debuts his new song parody. Plus,...","categories":[]},{"title":"279 Patton Oswalt, Lauren Lapkus, Will Hines","link":"http://www.earwolf.com/episode/reverse-april-fools/","author":"","publishedDate":"Mon, 31 Mar 2014 00:04:36 -0700","contentSnippet":"This week's Comedy Bing Buh has Scott \u0026 co-host Traci Rearden welcome back Patton Oswalt to answer some burning questions in ...","content":"This week\u0026#39;s Comedy Bing Buh has Scott \u0026amp; co-host Traci Rearden welcome back Patton Oswalt to answer some burning questions in honor of his new special Tragedy Plus Comedy Equals Time. How many guns should a person own? What exactly is a reverse April...","categories":[]},{"title":"278 Only Tones","link":"http://www.earwolf.com/episode/only-tones/","author":"","publishedDate":"Mon, 24 Mar 2014 01:13:46 -0700","contentSnippet":"It's a special March Music edition of Comedy Bean Bag as Matt Berninger of The National \u0026 Rhett Miller of the Old 97's get ...","content":"It\u0026#39;s a special March Music edition of Comedy Bean Bag as Matt Berninger of The National \u0026amp; Rhett Miller of the Old 97\u0026#39;s get candid about being lead singers all while the Old 97\u0026#39;s play live versions of songs from their new album \u0026quot;Most Messed Up.\u0026quot; Later...","categories":[]},{"title":"277 Chelsea Peretti, Paul Rust, Neil Campbell","link":"http://www.earwolf.com/episode/comedy-bang-me/","author":"","publishedDate":"Mon, 17 Mar 2014 00:04:31 -0700","contentSnippet":"Are you ready for some pet peeves from TV's own Chelsea Peretti? Things heat up on a Bang! Bang! After Dark as Chelsea gets ...","content":"Are you ready for some pet peeves from TV's own Chelsea Peretti? Things heat up on a Bang! Bang! After Dark as Chelsea gets deep about her thoughts on rental cars, dookie emojis, and DSLs. That's not all, we know you've been missing record producers...","categories":[]},{"title":"276 LIVE from SXSW 2014 II; Matt Braunger, Matt Besser, Jon Gabrus","link":"http://www.earwolf.com/episode/live-from-sxsw-2014-ii/","author":"","publishedDate":"Thu, 13 Mar 2014 00:03:35 -0700","contentSnippet":"It's time for another b-b-b-bonus episode of Comedy Bang! Bang! recorded live at the South by Southwest Festival! Featuring ...","content":"It's time for another b-b-b-bonus episode of Comedy Bang! Bang! recorded live at the South by Southwest Festival! Featuring co-host/intern Gino Lambardo and one of America's favorite comedians Matt Braunger. But that's not all, Scott's childhood frie...","categories":[]},{"title":"275 LIVE from SXSW 2014; Jonah Ray, Adam Cayton-Holland, James Adomian","link":"http://www.earwolf.com/episode/live-from-sxsw-2014/","author":"","publishedDate":"Mon, 10 Mar 2014 02:03:00 -0700","contentSnippet":"This week's Comedy Bang Bang was recorded live at the South by Southwest Festival 2014 in Austin, Texas with fan favorite Jonah ...","content":"This week's Comedy Bang Bang was recorded live at the South by Southwest Festival 2014 in Austin, Texas with fan favorite Jonah Ray and soon to be fan favorite Adam Cayton-Holland! Also, The Sheriff of Nottingham makes a harrowing return as he crashe...","categories":[]},{"title":"274 Jason Mantzoukas, Andy Daly","link":"http://www.earwolf.com/episode/oh-golly/","author":"","publishedDate":"Mon, 03 Mar 2014 00:04:40 -0800","contentSnippet":"Get ready for some dating stories from the life of our good friend Jason Mantzoukas on today's Comedy Bang Bang! Just as we get ...","content":"Get ready for some dating stories from the life of our good friend Jason Mantzoukas on today's Comedy Bang Bang! Just as we get into Jason's love life, an entertainer by the name of Gil accompanied by his puppet Golly stop by the studio. But somethin...","categories":[]},{"title":"273 Jim O'Heir, Horatio Sanz","link":"http://www.earwolf.com/episode/vape-cod/","author":"","publishedDate":"Mon, 24 Feb 2014 00:04:42 -0800","contentSnippet":"Parks and Recreation's Jim O'Heir makes his way from Pawnee for his debut appearance on today's Comedy Bing Bong! Jim takes us ...","content":"Parks and Recreation's Jim O'Heir makes his way from Pawnee for his debut appearance on today's Comedy Bing Bong! Jim takes us through the many masks he wears as an actor and explains how the audition he did for the role of Ron Swanson lead to the cr...","categories":[]},{"title":"272 Gillian Jacobs, Paul F. Tompkins","link":"http://www.earwolf.com/episode/sex-party-season/","author":"","publishedDate":"Mon, 17 Feb 2014 00:04:26 -0800","contentSnippet":"IT'S BEEN a long time since the previously married Garry Marshall \u0026 Gillian Jacobs have been on Comedy Bean Bag but now they're ...","content":"IT\u0026#39;S BEEN a long time since the previously married Garry Marshall \u0026amp; Gillian Jacobs have been on Comedy Bean Bag but now they\u0026#39;re here to set things straight. Will Gilli (sorry!) ever get stinkin\u0026#39; rich? What gets Underworld series director Len Wiseman\u0026#39;...","categories":[]},{"title":"271 Nick Thune, Molly Bretthauer","link":"http://www.earwolf.com/episode/tiny-little-boy-parts/","author":"","publishedDate":"Thu, 13 Feb 2014 00:34:41 -0800","contentSnippet":"Comedian extraordinaire, fan favorite, and new dad Nick Thune returns on this week's b-b-bonus Comedy Bing Bong! Smash cut to ...","content":"Comedian extraordinaire, fan favorite, and new dad Nick Thune returns on this week's b-b-bonus Comedy Bing Bong! Smash cut to Nick giving us a conclusion to his neighbor saga, explaining how he thought his baby boy was going to be a baby girl, and te...","categories":[]},{"title":"270 Jon Daly, James Adomian","link":"http://www.earwolf.com/episode/off-the-grid/","author":"","publishedDate":"Mon, 10 Feb 2014 00:04:47 -0800","contentSnippet":"One half of The Pepper Men, Jon Daly is here to discuss all things RHCP on today's Comedy Bing Bong! Jon tells us about his ...","content":"One half of The Pepper Men, Jon Daly is here to discuss all things RHCP on today\u0026#39;s Comedy Bing Bong! Jon tells us about his tribute track to the Red Hots and dives deep into the Superb Bowl Halftime show controversy. Then, Scott \u0026amp; Jon start to go thr...","categories":[]},{"title":"269 Doug Benson, Paul Hornschemeier, Matt Besser","link":"http://www.earwolf.com/episode/smaugs-kickstarter/","author":"","publishedDate":"Mon, 03 Feb 2014 00:04:31 -0800","contentSnippet":"You must know by now that Doug Benson loves movies, dining with Karen, and getting Doug right? Doug \u0026 cartoonist/author Paul ...","content":"You must know by now that Doug Benson loves movies, dining with Karen, and getting Doug right? Doug \u0026amp; cartoonist/author Paul Hornschemeier join Scott to talk about Paul\u0026#39;s new book \u0026quot; Artists Authors Thinkers Directors ,\u0026quot; their all time favorite movies...","categories":[]},{"title":"268 Jimmy Pardo, Betsy Sodaro","link":"http://www.earwolf.com/episode/what-does-the-fonz-say/","author":"","publishedDate":"Thu, 30 Jan 2014 00:16:03 -0800","contentSnippet":"Never Not Funny host Jimmy Pardo is back to chat about Twitter snitches, how much money he made in 1990, and his award winning ...","content":"Never Not Funny host Jimmy Pardo is back to chat about Twitter snitches, how much money he made in 1990, and his award winning podcast Never Not Funny joining Earwolf on today's b-b-b-onus episode of Comedy Bing Bong Theory! Then, Voda the Gypsy has...","categories":[]},{"title":"267 Jerrod Carmichael, Neil Campbell, Mookie Blaiklock","link":"http://www.earwolf.com/episode/that-wasnt-it-im-back-hee-hee/","author":"","publishedDate":"Mon, 27 Jan 2014 00:04:44 -0800","contentSnippet":"Hee Hee's back! While waiting for fan favorite Jerrod Carmichael to show up, head writer/executive producer of the Comedy Bang! ...","content":"Hee Hee\u0026#39;s back! While waiting for fan favorite Jerrod Carmichael to show up, head writer/executive producer of the Comedy Bang! Bang! TV show \u0026amp; G.O.A.T. freestyle rapper Neil Campbell stops by along with the return of a reincarnated Michael Jackson f...","categories":[]},{"title":"266 Taran Killam, Paul Brittain","link":"http://www.earwolf.com/episode/the-calvins-twins/","author":"","publishedDate":"Mon, 20 Jan 2014 00:04:40 -0800","contentSnippet":"Comedy buds Taran Killam and Paul Brittain are back to chat about how to take compliments, if older people should be driving ...","content":"Comedy buds Taran Killam and Paul Brittain are back to chat about how to take compliments, if older people should be driving old cars, and why aren't birds shitting on us all the time. Later, Bever Hopox and Chico Hands aka the Calvins twins gallop i...","categories":[]},{"title":"265 LIVE from RIOT LA; Paul F. Tompkins, Lauren Lapkus, Harris Wittels","link":"http://www.earwolf.com/episode/live-from-riot-la-2/","author":"","publishedDate":"Thu, 16 Jan 2014 00:04:32 -0800","contentSnippet":"Recorded LIVE from the Downtown Independent Theater as part of the RIOT LA festival, its a b-b-b-onus episode of Big Bang ...","content":"Recorded LIVE from the Downtown Independent Theater as part of the RIOT LA festival, its a b-b-b-onus episode of Big Bang Theory Comedy! ITS BEEN quite a while since high school student Traci Rearden has been on the show as she catches up with Scott...","categories":[]},{"title":"264 Nick Kroll, Jenny Slate","link":"http://www.earwolf.com/episode/creating-a-krolliverse/","author":"","publishedDate":"Mon, 13 Jan 2014 00:04:57 -0800","contentSnippet":"Stars of the Kroll Show, Nick Kroll \u0026 Jenny Slate are on this weeks Big Bang Theory Comedy to chat about the upcoming season of ...","content":"Stars of the Kroll Show, Nick Kroll \u0026amp; Jenny Slate are on this weeks Big Bang Theory Comedy to chat about the upcoming season of Kroll Show, how they met doing stand-up shows in New York, and their thoughts on public restrooms. Later, Liz and Pretty L...","categories":[]},{"title":"263 Ben Schwartz, Horatio Sanz","link":"http://www.earwolf.com/episode/hollywild/","author":"","publishedDate":"Mon, 06 Jan 2014 00:04:17 -0800","contentSnippet":"House of Pies star Ben Schwartz aka Benny Schwaz is here to share his new year's resolutions on another edition of Comedy Bing ...","content":"House of Pies star Ben Schwartz aka Benny Schwaz is here to share his new year's resolutions on another edition of Comedy Bing Bang Theory! After some wonderful duets, Coco Marx (Groucho Marxs grandson) returns to tell us about his past in the celebr...","categories":[]},{"title":"Best of 2013 Pt 4","link":"http://www.earwolf.com/episode/best-of-2013-pt-4/","author":"","publishedDate":"Thu, 02 Jan 2014 00:04:29 -0800","contentSnippet":"And now the exciting conclusion to the best of 2013 countdown with special guest Paul F. Tompkins. What will be the number one ...","content":"And now the exciting conclusion to the best of 2013 countdown with special guest Paul F. Tompkins. What will be the number one episode of 2013? You'll have to tune in to find out!","categories":[]},{"title":"Best of 2013 Pt 3","link":"http://www.earwolf.com/episode/best-of-2013-pt-3/","author":"","publishedDate":"Mon, 30 Dec 2013 00:04:31 -0800","contentSnippet":"It's getting real close to the end with part three of the Comedy Bang! Bang! best of countdown as Scott and special guest Paul ...","content":"It's getting real close to the end with part three of the Comedy Bang! Bang! best of countdown as Scott and special guest Paul F. Tompkins count down numbers six through four as well as some b-b-b-bonus-s-s-s clips. Sit tight and look out for the fin...","categories":[]},{"title":"Best of 2013 Pt 2","link":"http://www.earwolf.com/episode/best-of-2013-pt-2/","author":"","publishedDate":"Thu, 26 Dec 2013 00:03:11 -0800","contentSnippet":"The best of Comedy Bang! Bang! countdown continues with Scott and special guest Paul F. Tompkins as they go count down numbers ...","content":"The best of Comedy Bang! Bang! countdown continues with Scott and special guest Paul F. Tompkins as they go count down numbers eleven through seven of the best episodes YOU voted for along with additional b-b-b-bonus-s-s-s clips. Much love!","categories":[]},{"title":"Best of 2013 Pt 1","link":"http://www.earwolf.com/episode/best-of-2013-pt-1/","author":"","publishedDate":"Mon, 23 Dec 2013 00:04:15 -0800","contentSnippet":"Alas, we say farewell to another year but never fear because the best of 2013 episode of Comedy Bang! Bang! is here! There were ...","content":"Alas, we say farewell to another year but never fear because the best of 2013 episode of Comedy Bang! Bang! is here! There were sooo many good episodes this year that we had to step up the countdown to the next level. Making a rare appearance is spec...","categories":[]},{"title":"262 2013 Holiday Spectacular","link":"http://www.earwolf.com/episode/2013-holiday-spectacular/","author":"","publishedDate":"Mon, 16 Dec 2013 00:03:49 -0800","contentSnippet":"Ho! Ho! Ho! Surfing Santa wipeout! Its time once again for the year end holiday episode of Comedy Bing Bong! with guests ...","content":"Ho! Ho! Ho! Surfing Santa wipeout! Its time once again for the year end holiday episode of Comedy Bing Bong! with guests galore! Jason Mantzoukas returns with singer-songwriter Nick Lowe wholl play some festive songs from his new Christmas record  Qu...","categories":[]},{"title":"261 Horatio Sanz, Kulap Vilaysack, Shelby Fero","link":"http://www.earwolf.com/episode/nubile-agape/","author":"","publishedDate":"Mon, 09 Dec 2013 00:14:16 -0800","contentSnippet":"The holidays are a time to spend with family so gather round the ol' laptop and listen to a special Bing! Bong! Comedy! with ...","content":"The holidays are a time to spend with family so gather round the ol' laptop and listen to a special Bing! Bong! Comedy! with Who Charted? co-host/Scott's wiiife Kulap Vilaysack and comedian Shelby Fero of the Analyze Fish family! Well hear about thei...","categories":[]},{"title":"260 Mike Birbiglia, Brendon Small, Jon Gabrus","link":"http://www.earwolf.com/episode/tiny-cheeseburger-story/","author":"","publishedDate":"Thu, 05 Dec 2013 00:04:37 -0800","contentSnippet":"Award-winning (sleepwalking) comedian, author, and filmmaker Mike Birbiglia makes his second appearance along with intern Gino ...","content":"Award-winning (sleepwalking) comedian, author, and filmmaker Mike Birbiglia makes his second appearance along with intern Gino Lambardo on todays bonus Bing! Bong! Comedy! Mike tells us about his new special My Girlfriends Boyfriend and focusing on a...","categories":[]},{"title":"259 David Alan Grier, Lauren Lapkus, Joe Wengert","link":"http://www.earwolf.com/episode/charlottes-website/","author":"","publishedDate":"Mon, 02 Dec 2013 00:14:59 -0800","contentSnippet":"It's a Comedy Bing! Bong! for the ages as accomplished actor, comedian, and yes and-er David Alan Grier makes his debut ...","content":"It's a Comedy Bing! Bong! for the ages as accomplished actor, comedian, and yes and-er David Alan Grier makes his debut appearance! We also get a blast from the past as the short haired singer Regina Crimp drops by to perform some of her amazing fole...","categories":[]},{"title":"258 Jimmy Pardo, Bill Callahan, Seth Morris","link":"http://www.earwolf.com/episode/yoke-jams/","author":"","publishedDate":"Mon, 25 Nov 2013 00:04:14 -0800","contentSnippet":"We're never not thankful here at Comedy Bing! Bong! and this week is no exception as Never Not Funny's Jimmy Pardo returns ...","content":"We're never not thankful here at Comedy Bing! Bong! and this week is no exception as Never Not Funny's Jimmy Pardo returns along with first timer/singer-songwriter Bill Callahan! Jimmy gives us the deets on the  5th Annual Pardcast-a-thon  and Bill p...","categories":[]},{"title":"257 Will Forte, Paul F. Tompkins","link":"http://www.earwolf.com/episode/nuts-as-a-pile-of-nuts/","author":"","publishedDate":"Thu, 21 Nov 2013 00:04:07 -0800","contentSnippet":"SNL alum Will Forte is back to tell us a bit about his exciting role in Alexander Paynes dramedy Nebraska on this weeks ...","content":"SNL alum Will Forte is back to tell us a bit about his exciting role in Alexander Paynes dramedy Nebraska on this weeks b-b-b-bonus-s-s-s episode of Comedy Bing! Bong! Will begins to read the entire plot of Nebraska when the sudden sound of clanking...","categories":[]},{"title":"256 Brendon Small, Cameron Esposito, James Adomian","link":"http://www.earwolf.com/episode/raw-copera/","author":"","publishedDate":"Mon, 18 Nov 2013 00:03:36 -0800","contentSnippet":"Creator, star, and driving force behind Metalocalypse, Brendon Small returns as well as  Put Your Hands Together  host/creator ...","content":"Creator, star, and driving force behind Metalocalypse, Brendon Small returns as well as  Put Your Hands Together  host/creator Cameron Esposito whos making her first appearance on todays Comedy Bing Bong! Cameron takes us through her memorable late n...","categories":[]},{"title":"255 Rob Delaney, Mookie Blaiklock","link":"http://www.earwolf.com/episode/a-visit-from-hee-hee-ll/","author":"","publishedDate":"Mon, 11 Nov 2013 00:04:10 -0800","contentSnippet":"Twitter expert, comedian extraordinaire, and author Rob Delaney returns on this weeks episode of Comedy Bing! Bong! After a ...","content":"Twitter expert, comedian extraordinaire, and author Rob Delaney returns on this weeks episode of Comedy Bing! Bong! After a chat about poop, Twitter headquarters, and Robs new book,  Rob Delaney: Mother. Wife. Sister. Human. Warrior. Falcon. Yardstic...","categories":[]},{"title":"254 LIVE from Comedy Gives Back; Zach Galifianakis, David Wain, Andy Daly","link":"http://www.earwolf.com/episode/live-from-comedy-gives-back/","author":"","publishedDate":"Thu, 07 Nov 2013 00:04:03 -0800","contentSnippet":"Bearded bad boy Zach Galifianakis and director/scribe David Wain are both on this weeks special bonus LIVE episode of Comedy ...","content":"Bearded bad boy Zach Galifianakis and director/scribe David Wain are both on this weeks special bonus LIVE episode of Comedy Bang! Bang! from the Comedy Gives Back benefit for Malaria No More. Zach \u0026amp; David bro out about dubstep \u0026amp; parkour before they...","categories":[]},{"title":"253 Tim Heidecker, Jon Daly","link":"http://www.earwolf.com/episode/fieri-fight/","author":"","publishedDate":"Mon, 04 Nov 2013 00:04:35 -0800","contentSnippet":"Titans of comedy Tim Heidecker and a newly Twitter verified Jon Daly are back on today's Comedy Bang! Bang! Unfortunately their ...","content":"Titans of comedy Tim Heidecker and a newly Twitter verified Jon Daly are back on today's Comedy Bang! Bang! Unfortunately their friendship quickly hits the danger zone when they have conflicting opinions on Guy Fieri. Will the #230PST bros be able to...","categories":[]},{"title":"252 Halloween, Steven Yeun, Paul Rust, Molly Bretthauer, Nick Wiger, Eva Anderson, Caroline Anderson","link":"http://www.earwolf.com/episode/the-creeeeeeepy-halloween-special/","author":"","publishedDate":"Mon, 28 Oct 2013 00:04:31 -0700","contentSnippet":"Beware listeners, today's spOoOoky edition of Comedy Fang! Fang! might be too scary for the faint hearted but hopefully the ...","content":"Beware listeners, today\u0026#39;s spOoOoky edition of Comedy Fang! Fang! might be too scary for the faint hearted but hopefully the zombie killing expertise of The Walking Deads Steven Yeun will help you face your fears! Join Scott \u0026amp; Steven (if you dare) as...","categories":[]},{"title":"251 Amber Tamblyn, Todd Glass","link":"http://www.earwolf.com/episode/the-bed-spoiler/","author":"","publishedDate":"Thu, 24 Oct 2013 00:04:00 -0700","contentSnippet":"Star of The Sisterhood of the Traveling Pants \u0026 first timer Amber Tamblyn stops by along with fan favorite Todd Glass to ...","content":"Star of The Sisterhood of the Traveling Pants \u0026amp; first timer Amber Tamblyn stops by along with fan favorite Todd Glass to celebrate Ovarytober on today\u0026#39;s special B-B-B-ONUS-S-S-s episode of Comedy Bing Bong! Amber tells us about recently becoming a re...","categories":[]},{"title":"250 Pete Holmes, Jon Gabrus, Pamela Murphy","link":"http://www.earwolf.com/episode/podcast-silence/","author":"","publishedDate":"Mon, 21 Oct 2013 00:04:55 -0700","contentSnippet":"The star of The Pete Holmes Show, infectious laugher, and todays guest of honor Pete Holmes finally makes it weird on his ...","content":"The star of The Pete Holmes Show, infectious laugher, and todays guest of honor Pete Holmes finally makes it weird on his inaugural Comedy Bing Bong appearance! Also joining both Scott \u0026amp; Pete is Gino Lambardo, a new intern from Long Island that is su...","categories":[]},{"title":"249 Bob Odenkirk, The Birthday Boys","link":"http://www.earwolf.com/episode/ice-cold-stab/","author":"","publishedDate":"Mon, 14 Oct 2013 00:09:42 -0700","contentSnippet":"Mr. Show \u0026 Breaking Bads Bob Odenkirk returns along with our favorite sketch group The Birthday Boys on todays Comedy Bang ...","content":"Mr. Show \u0026amp; Breaking Bads Bob Odenkirk returns along with our favorite sketch group The Birthday Boys on todays Comedy Bang Boing! Bob takes us through the true final episode of Breaking Bad, he helps Scott find a new catchphrase, and tells us all abo...","categories":[]},{"title":"248 Eric Andre, Lauren Lapkus","link":"http://www.earwolf.com/episode/todds-life-2-0/","author":"","publishedDate":"Thu, 10 Oct 2013 00:04:27 -0700","contentSnippet":"It's the meeting of the fake talk show hosts as Eric Andre makes his makes his first appearance on this week's ...","content":"It's the meeting of the fake talk show hosts as Eric Andre makes his makes his first appearance on this week's b-b-b-bonus-s-s-s episode of Comedy Bang! Bang! After a chat about cross over episodes, ska, and bass lines, Scotts missing nephew Todd sho...","categories":[]},{"title":"247 Tim Meadows, Horatio Sanz","link":"http://www.earwolf.com/episode/half-a-score/","author":"","publishedDate":"Mon, 07 Oct 2013 00:04:29 -0700","contentSnippet":"Comedy legend and Saturday Night Fever Live star Tim Meadows makes his first visit to the podcast on this week's Comedy Bang ...","content":"Comedy legend and Saturday Night Fever Live star Tim Meadows makes his first visit to the podcast on this week\u0026#39;s Comedy Bang Bang! After Tim and Scott discuss the ins and outs of laser eye surgery and the SNL writing process, musician \u0026amp; esteemed auth...","categories":[]},{"title":"246 Casey Wilson, June Diane Raphael","link":"http://www.earwolf.com/episode/butthole-baby/","author":"","publishedDate":"Mon, 30 Sep 2013 00:04:40 -0700","contentSnippet":"The writing team and stars of  Ass Backwards , Casey Wilson \u0026 June Diane Raphael are here to predict future inventions on this ...","content":"The writing team and stars of  Ass Backwards , Casey Wilson \u0026amp; June Diane Raphael are here to predict future inventions on this weeks Comedy Bing! Bing! Casey \u0026amp; June let us know how their new movie  Ass Backwards  (which is now out on VOD) was loosely...","categories":[]},{"title":"245 Amy Poehler, Paul F. Tompkins, Neil Campbell","link":"http://www.earwolf.com/episode/poehler-ice-caps/","author":"","publishedDate":"Mon, 23 Sep 2013 00:04:13 -0700","contentSnippet":"Cancel all your plans because Amy Poehler is back along with co-host Neil Campbell for a post-Emmys chat on todays Comedy Bing ...","content":"Cancel all your plans because Amy Poehler is back along with co-host Neil Campbell for a post-Emmys chat on todays Comedy Bing Bong! Amy gives us a sneak preview of the new season of Parks and Recreation, tells us about the reality shows shes working...","categories":[]},{"title":"244 Andy Samberg, Eddie Pepitone","link":"http://www.earwolf.com/episode/an-ode-to-new-york/","author":"","publishedDate":"Mon, 16 Sep 2013 00:04:58 -0700","contentSnippet":"Whats that? How will you deal with your life now that Andy Samberg isnt live on your TV on Saturday nights anymore? Cheer up ...","content":"Whats that? How will you deal with your life now that Andy Samberg isnt live on your TV on Saturday nights anymore? Cheer up because youll still be able to see him on FOXs upcoming Brooklyn Nine-Nine and hear him remix the Hollywood Facts theme on to...","categories":[]},{"title":"243 Maria Bamford, James Adomian","link":"http://www.earwolf.com/episode/blow-me-up-tom/","author":"","publishedDate":"Mon, 09 Sep 2013 00:04:37 -0700","contentSnippet":"ITS BEEN a while since Maria Bamford has been on the show and this time shes unexpectedly joined by the one and only Tom ...","content":"ITS BEEN a while since Maria Bamford has been on the show and this time shes unexpectedly joined by the one and only Tom Leykis. Maria shares her love of community building and what shes been up to, including her stand-up special,  Maria Bamford: The...","categories":[]},{"title":"242 Thomas Lennon, Rob Huebel, Neko Case","link":"http://www.earwolf.com/episode/veggie-dongs/","author":"","publishedDate":"Mon, 02 Sep 2013 00:04:03 -0700","contentSnippet":"Tom Lennon \u0026 Rob Huebel return along with singer/songwriter/first time guest Neko Case in shark leather attire to grill out on ...","content":"Tom Lennon \u0026amp; Rob Huebel return along with singer/songwriter/first time guest Neko Case in shark leather attire to grill out on todays special Labor Day episode of Comedy Bing Bong! Rob gives kids some tips for back to school, Tom makes a promise to e...","categories":[]},{"title":"241 Paul Scheer, Nick Kroll","link":"http://www.earwolf.com/episode/the-stallone-bros/","author":"","publishedDate":"Mon, 26 Aug 2013 00:04:15 -0700","contentSnippet":"Since The League returns on FXX soon why not have cast mates Paul Scheer AND Nick Kroll here to help fans find the show on its ...","content":"Since The League returns on FXX soon why not have cast mates Paul Scheer AND Nick Kroll here to help fans find the show on its new channel, share their favorite apps, and figure out what it would take for Sylvester Stallone to make  Rocky Vs. Rambo...","categories":[]},{"title":"240 Edgar Wright, Simon Pegg, Nick Frost","link":"http://www.earwolf.com/episode/the-worlds-end/","author":"","publishedDate":"Fri, 23 Aug 2013 00:04:51 -0700","contentSnippet":"The trio of filmmakers from The Worlds End, Edgar Wright, Simon Pegg, and Nick Frost are on todays B-B-B-B-ONUS episode of ...","content":"The trio of filmmakers from The Worlds End, Edgar Wright, Simon Pegg, and Nick Frost are on todays B-B-B-B-ONUS episode of Comedy Bang! Bang! Theyll explain how the Cornetto trilogy came to be, describe some of the themes of their film The Worlds End...","categories":[]},{"title":"239 Jay Mohr, Matt Besser","link":"http://www.earwolf.com/episode/new-dad/","author":"","publishedDate":"Mon, 19 Aug 2013 00:04:50 -0700","contentSnippet":"SNL alum and Mohr Stories host Jay Mohr makes his first appearance on todays Comedy Bang! Bang! After a discussion on the ...","content":"SNL alum and Mohr Stories host Jay Mohr makes his first appearance on todays Comedy Bang! Bang! After a discussion on the central time zone, Scotts neighbor drops by to tell us all about being a new dad and how to keep a baby happy. Plus, a life chan...","categories":[]},{"title":"238 Jessica St. Clair, Lennon Parham, Jason Mantzoukas, Brian Huskey, Melissa Rauch","link":"http://www.earwolf.com/episode/marissa-womplers-birthday-pool-party-live/","author":"","publishedDate":"Mon, 12 Aug 2013 00:04:04 -0700","contentSnippet":"WOMP IT UP! Were celebrating Marissa Womplers 17th Birthday Party LIVE from the Marina Del Rey condo HOA common area pool with ...","content":"WOMP IT UP! Were celebrating Marissa Womplers 17th Birthday Party LIVE from the Marina Del Rey condo HOA common area pool with Miss Listler, Marissas step dad Dr. Seth Wompler, and Eric Gutterballs Gutterman. Its all fun in the sun until Marissas arc...","categories":[]},{"title":"237 Jonah Ray, Nick Thune, Eugene Cordero","link":"http://www.earwolf.com/episode/filipino-blockbuster/","author":"","publishedDate":"Thu, 08 Aug 2013 00:02:19 -0700","contentSnippet":"1/3 of the Nerdist podcast \u0026 host of Jonah Raydio, Jonah Ray makes his first appearance along with fan favorite Nick Thune for ...","content":"1/3 of the Nerdist podcast \u0026amp; host of Jonah Raydio, Jonah Ray makes his first appearance along with fan favorite Nick Thune for a bro out sesh on this weeks b-b-b-bonus-s-s-s episode of Comedy Bang! Bang! After the guys confess their love of baseball...","categories":[]},{"title":"236 Rob Corddry, Paul F. Tompkins","link":"http://www.earwolf.com/episode/murderer-heaven/","author":"","publishedDate":"Mon, 05 Aug 2013 00:04:05 -0700","contentSnippet":"Rob Corddry finds his way to the Earwolf studios once again on todays Comedy Bang! Bang! Rob talks to us about Hot Tub Time ...","content":"Rob Corddry finds his way to the Earwolf studios once again on todays Comedy Bang! Bang! Rob talks to us about Hot Tub Time Machine 2, the 5th season of Childrens Hospital, and Herve Villechaize. Suddenly the ghostly presence of Richard Harrow appear...","categories":[]},{"title":"235 Doug Benson, Paul F. Tompkins","link":"http://www.earwolf.com/episode/concert-buddies/","author":"","publishedDate":"Mon, 29 Jul 2013 00:04:43 -0700","contentSnippet":"If you dont already know, Doug Benson hates candy wrappers, screaming children, and sticky seats. Although, he loves movies and ...","content":"If you dont already know, Doug Benson hates candy wrappers, screaming children, and sticky seats. Although, he loves movies and he joins Scott on todays Comedy Bang Bang to talk about Broadway, the first time they met, and being concert buddies. Our...","categories":[]},{"title":"234 Bill Hader, Seth Morris","link":"http://www.earwolf.com/episode/changing-the-bandage/","author":"","publishedDate":"Thu, 25 Jul 2013 00:03:48 -0700","contentSnippet":"SNL superstar Bill Hader makes his inaugural appearance on this weeks B-B-B-BONUS episode of Comedy Bang! Bang! Bill regales us ...","content":"SNL superstar Bill Hader makes his inaugural appearance on this weeks B-B-B-BONUS episode of Comedy Bang! Bang! Bill regales us with stories of his first SNL, going on a ride-along with a cop while shooting Superbad, and his wifes upcoming directoria...","categories":[]},{"title":"233 Bob Odenkirk, Andy Daly","link":"http://www.earwolf.com/episode/royal-watching/","author":"","publishedDate":"Mon, 22 Jul 2013 00:04:14 -0700","contentSnippet":"Todays episode of Comedy Bang Bang will delight fans of both Mr. Show and the Royal family! Bob Odenkirk treats listeners to ...","content":"Todays episode of Comedy Bang Bang will delight fans of both Mr. Show and the Royal family! Bob Odenkirk treats listeners to some special news thats sure to please anyone who loves Mr. Show. Joining Bob is Byron Denniston, a Royal watcher from across...","categories":[]},{"title":"232 LIVE from San Diego Comic-Con; Andy Daly, Paul Rust","link":"http://www.earwolf.com/episode/live-from-san-diego-comic-con/","author":"","publishedDate":"Thu, 18 Jul 2013 02:00:31 -0700","contentSnippet":"Thats right, its a b-b-b-bonus episode of Comedy Bang! Bang! recorded live from San Diego Comic-Con! ITS BEEN a while since ...","content":"Thats right, its a b-b-b-bonus episode of Comedy Bang! Bang! recorded live from San Diego Comic-Con! ITS BEEN a while since weve heard whats up with Hot Dog and since we heard a couple of New No-Nos from CBB favorite Paul Rust! What more can you ask...","categories":[]},{"title":"231 Kumail Nanjiani, James Adomian","link":"http://www.earwolf.com/episode/this-is-not-me-this-is-them/","author":"","publishedDate":"Mon, 15 Jul 2013 00:04:47 -0700","contentSnippet":"Things get weird fast as Kumail Nanjiani returns and Paul Giamatti bursts through the studio to confess all the experiments hes ...","content":"Things get weird fast as Kumail Nanjiani returns and Paul Giamatti bursts through the studio to confess all the experiments hes gone through while shooting his films. Kumail then tells us what we can expect on his upcoming Comedy Central one-hour spe...","categories":[]},{"title":"230 Reggie Watts, Neil Campbell","link":"http://www.earwolf.com/episode/something-for-everything/","author":"","publishedDate":"Thu, 11 Jul 2013 00:03:43 -0700","contentSnippet":"Reggie Watts and Neil Campbell are back in the hot seats on this week's B-B-B-BONUS Comedy Bang Bang! Scott, Reggie and Neil ...","content":"Reggie Watts and Neil Campbell are back in the hot seats on this week's B-B-B-BONUS Comedy Bang Bang! Scott, Reggie and Neil share their excitement for season two of Comedy Bang Bang: The TV series, which premieres on IFC on Friday July 12th, as well...","categories":[]},{"title":"229 Ben Schwartz, Paul F. Tompkins","link":"http://www.earwolf.com/episode/two-thumbs-and-not-much-else/","author":"","publishedDate":"Mon, 08 Jul 2013 00:04:36 -0700","contentSnippet":"Ben Schwartz and director extraordinaireWerner Herzog both return to the studio on today's Comedy Bang Bang! Scott shares his ...","content":"Ben Schwartz and director extraordinaireWerner Herzog both return to the studio on today's Comedy Bang Bang! Scott shares his enthusiasm for season two of the Comedy Bang Bang TV series, which premieres on IFC this Friday July 12th, and Ben and Scott...","categories":[]},{"title":"228 John Hodgman, Paul F. Tompkins","link":"http://www.earwolf.com/episode/acapella-cuddle-puddle/","author":"","publishedDate":"Mon, 01 Jul 2013 00:04:22 -0700","contentSnippet":"The immensely talented \u0026 hilarious John Hodgman stops by the studio for the first time EVER on today's Comedy Bang Bang! Scott ...","content":"The immensely talented \u0026amp; hilarious John Hodgman stops by the studio for the first time EVER on today\u0026#39;s Comedy Bang Bang! Scott asks John all the hard-hitting questions and finds out everything you need to know, like where he isn\u0026#39;t from, and John talk...","categories":[]},{"title":"227 Brian Posehn, Jon Daly","link":"http://www.earwolf.com/episode/all-farted-out/","author":"","publishedDate":"Thu, 27 Jun 2013 00:03:28 -0700","contentSnippet":"Nerd Poker's Brian Posehn stops by the studio on this week's special B-B-B-BONUS Thursday episode of Comedy Bang Bang! Scott ...","content":"Nerd Poker's Brian Posehn stops by the studio on this week's special B-B-B-BONUS Thursday episode of Comedy Bang Bang! Scott and Brian reminisceabout the old Mr. Show days, break down Brian's latest comedy album  THE FARTIST  track-by-track, and talk...","categories":[]},{"title":"226 Paul Feig, Horatio Sanz","link":"http://www.earwolf.com/episode/aspira/","author":"","publishedDate":"Mon, 24 Jun 2013 00:04:50 -0700","contentSnippet":"Comedy juggernaut Paul Feig returns to the podcast for the first time since 2011 on today's Comedy Bang Bang! Paul shares his ...","content":"Comedy juggernaut Paul Feig returns to the podcast for the first time since 2011 on today's Comedy Bang Bang! Paul shares his philosophy on improvising, discusses recording ADR jokes and talks about his latest feature THE HEAT, which opens in theater...","categories":[]},{"title":"225 Taran Killam, Paul Brittain","link":"http://www.earwolf.com/episode/super-chums/","author":"","publishedDate":"Mon, 17 Jun 2013 00:04:40 -0700","contentSnippet":"Hey kiddos! Saturday Night Lives Taran Killam and Paul Brittain make their first time Comedy Bang Bang appearance! They let us ...","content":"Hey kiddos! Saturday Night Lives Taran Killam and Paul Brittain make their first time Comedy Bang Bang appearance! They let us know what is was like being office mates at SNL, the difference between an accent \u0026amp; a dialect, and give us a refresher on t...","categories":[]},{"title":"224 Live From Austin; Paul Scheer, Martin Starr, Brandon Johnson, Neil Campbell","link":"http://www.earwolf.com/episode/live-from-austin/","author":"","publishedDate":"Thu, 13 Jun 2013 00:03:51 -0700","contentSnippet":"This special B-B-B-BONUS Comedy Bang Bang was recorded live on June 6th at the Scottish Rite Theater in Austin, Texas with the ...","content":"This special B-B-B-BONUS Comedy Bang Bang was recorded live on June 6th at the Scottish Rite Theater in Austin, Texas with the stars of Adult Swim's NTSF:SD:SUV! Martin Starr, Brandon Johnson, and depressed teen Rick Faber join Scott to talk about Ma...","categories":[]},{"title":"223 Seth Rogen","link":"http://www.earwolf.com/episode/roll-over-seth-rogen/","author":"","publishedDate":"Mon, 10 Jun 2013 00:04:13 -0700","contentSnippet":"The legendary Seth Rogen and his infectious laugh join Scott for the first time in Comedy Bang Bang history! Seth shares ...","content":"The legendary Seth Rogen and his infectious laugh join Scott for the first time in Comedy Bang Bang history! Seth shares stories from the set of \"Superbad\", discusses weird Kirk Cameron movies and clues us in on the origin of his hilarious directoria...","categories":[]},{"title":"222 Paul F. Tompkins, Gillian Jacobs, Mike Hanford","link":"http://www.earwolf.com/episode/a-peanut-in-the-rain/","author":"","publishedDate":"Mon, 03 Jun 2013 00:04:19 -0700","contentSnippet":"Take a break from grabbing that tasty air and enjoy a fresh episode of Comedy Bing Bong! The iconic Garry Marshall is back with ...","content":"Take a break from grabbing that tasty air and enjoy a fresh episode of Comedy Bing Bong! The iconic Garry Marshall is back with Gillian Jacobs to deal with some unfinished business that occurred since the last time they were on the show and were also...","categories":[]},{"title":"221 Andy Richter, Paul F. Tompkins","link":"http://www.earwolf.com/episode/the-cake-council/","author":"","publishedDate":"Mon, 27 May 2013 00:04:42 -0700","contentSnippet":"Announcer extraordinaire Andy Richter makes his record breaking 25th appearance and uses his co-hosting duties to get into the ...","content":"Announcer extraordinaire Andy Richter makes his record breaking 25th appearance and uses his co-hosting duties to get into the origins of Cake Boss (Cake Boss!) on todays Comedy Bang Bang! Well hear about his earliest cake memory, hell reveal some se...","categories":[]},{"title":"220 Lennon Parham, Jessica St. Clair","link":"http://www.earwolf.com/episode/4-paydays-a-baby/","author":"","publishedDate":"Mon, 20 May 2013 00:04:48 -0700","contentSnippet":"Get ready for a Womp Up the Jamz edition of Comedy Bang Bang! Our intern Marissa Wompler decides to show up again along with ...","content":"Get ready for a Womp Up the Jamz edition of Comedy Bang Bang! Our intern Marissa Wompler decides to show up again along with her couples counselor Miss Listler. Theyll get into Marissas current state of mind as she will soon be a big sister, Listlers...","categories":[]},{"title":"219 Adam Scott, Harris Wittels, Chelsea Peretti","link":"http://www.earwolf.com/episode/farts-and-procreation-3/","author":"","publishedDate":"Mon, 13 May 2013 00:04:07 -0700","contentSnippet":"2 years ago, a momentous recording occurred in the Earwolf studios. Now, all the participants have returned once more to ...","content":"2 years ago, a momentous recording occurred in the Earwolf studios. Now, all the participants have returned once more to recreate the magic. You asked for it and its finally happening, Adam Scott, Harris Wittels, andChelsea Peretti are here for the F...","categories":[]},{"title":"218 4th Anniversary, David Wain, Lauren Lapkus, Jessica St. Clair, Paul F. Tompkins, Jason Mantzoukas, Paul Rust, Neil Campbell","link":"http://www.earwolf.com/episode/the-4th-anniversary-extravaganza/","author":"","publishedDate":"Mon, 06 May 2013 00:14:20 -0700","contentSnippet":"Join us as we celebrate the Four Year Anniversary of Comedy Bang Bang: The Podcast! Acclaimed director David Wain returns with ...","content":"Join us as we celebrate the Four Year Anniversary of Comedy Bang Bang: The Podcast! Acclaimed director David Wain returns with co-host Traci Rearden to experience the high capacity of our open door policy as a furious Marissa Wompler \u0026amp; a disintereste...","categories":[]},{"title":"217 Marc Maron","link":"http://www.earwolf.com/episode/the-wtf-hour/","author":"","publishedDate":"Thu, 02 May 2013 00:03:01 -0700","contentSnippet":"Lock the gates! We have an incredible one on one, getting into the actors pain interview with Marc Maron of the WTF podcast on ...","content":"Lock the gates! We have an incredible one on one, getting into the actors pain interview with Marc Maron of the WTF podcast on todays special Thursday episode of Comedy Bing Bong! Marc tells us what we can expect on his new show Maron, takes us throu...","categories":[]},{"title":"216 Kristen Schaal, Michaela Watkins, Neil Campbell","link":"http://www.earwolf.com/episode/top-of-the-schaal-to-you/","author":"","publishedDate":"Mon, 29 Apr 2013 00:04:37 -0700","contentSnippet":"Most people would say that Kristen Schaal sparked a ton of controversy on her last Comedy Bang Bang appearance, we at CBB can ...","content":"Most people would say that Kristen Schaal sparked a ton of controversy on her last Comedy Bang Bang appearance, we at CBB can neither confirm or deny this (it totally did). Co-host/licensed therapist Dr. Sherri Levine joins us to discuss which actors...","categories":[]},{"title":"215 Bobby Moynihan, Paul F. Tompkins","link":"http://www.earwolf.com/episode/time-bobby-2/","author":"","publishedDate":"Mon, 22 Apr 2013 00:04:39 -0700","contentSnippet":"ITS BEEN quite a while since Sir Andrew Lloyd Webber has been on Comedy Bean Bag and this time hes here for a special ...","content":"ITS BEEN quite a while since Sir Andrew Lloyd Webber has been on Comedy Bean Bag and this time hes here for a special comprehensive interview of his entire career! Shortly after expressing his love for Vampire Weekend, Scott \u0026amp; Lord ALW are caught off...","categories":[]},{"title":"214 Jen Kirkman, Pamela Murphy","link":"http://www.earwolf.com/episode/you-have-to-take-action/","author":"","publishedDate":"Thu, 18 Apr 2013 00:03:41 -0700","contentSnippet":"Comedian and author Jen Kirkman explains why shes never been on the show on todays b-b-b-bonus episode of Comedy Bang Bang! Jen ...","content":"Comedian and author Jen Kirkman explains why shes never been on the show on todays b-b-b-bonus episode of Comedy Bang Bang! Jen talks about her new book  I Can Barely Take Care of Myself , her fear of finding a dead body, and shares an embarrassing s...","categories":[]},{"title":"213 Jerrod Carmichael, Horatio Sanz","link":"http://www.earwolf.com/episode/star-graves/","author":"","publishedDate":"Mon, 15 Apr 2013 00:04:45 -0700","contentSnippet":"Comedian extraordinaire Jerrod Carmichael returns just in time to do his taxes on todays Comedy Bang Bang! Jerrod shares his ...","content":"Comedian extraordinaire Jerrod Carmichael returns just in time to do his taxes on todays Comedy Bang Bang! Jerrod shares his love of triumphant white people music, why he saves his checks, and what hes working on this year. The proprietor of Star Gra...","categories":[]},{"title":"212 Brendon Walsh, James Adomian, Neil Campbell","link":"http://www.earwolf.com/episode/comedy-bleep-bleep/","author":"","publishedDate":"Mon, 08 Apr 2013 00:04:47 -0700","contentSnippet":"Are you [bleep] ready for another [bleep] incredible episode of Comedy Bang Bang? Neil Campbell is taking over co-hosting ...","content":"Are you [bleep] ready for another [bleep] incredible episode of Comedy Bang Bang? Neil Campbell is taking over co-hosting duties today as we welcome back Brendon Walsh aka B Money Dubbz to get a taste of his new comedic persona. Suddenly, Gordon Rams...","categories":[]},{"title":"211 Jon Hamm, Nick Kroll","link":"http://www.earwolf.com/episode/april-fools-2/","author":"","publishedDate":"Mon, 01 Apr 2013 00:04:53 -0700","contentSnippet":"Happy April Fools! The joke is on us as todays co-host Nick Kroll joins Scott to talk about Kroll Show season 2, sandwiches, ...","content":"Happy April Fools! The joke is on us as todays co-host Nick Kroll joins Scott to talk about Kroll Show season 2, sandwiches, and showcase his Christopher Walken impression as they wait for Jon Hamm to arrive. Eventually Jon arrives to chat about the...","categories":[]},{"title":"210 Adam Brody, Lauren Lapkus, Joe Wengert","link":"http://www.earwolf.com/episode/a-spiritual-journey/","author":"","publishedDate":"Mon, 25 Mar 2013 00:04:00 -0700","contentSnippet":"Be brave as you join The OCs Adam Brody and todays co-host/high school junior Traci Rearden as they go on a spiritual journey ...","content":"Be brave as you join The OCs Adam Brody and todays co-host/high school junior Traci Rearden as they go on a spiritual journey to the far off land of Comedy Bang Bang! Theyll talk about piercings, surfing, and what their 50 year plans look like. Spiri...","categories":[]},{"title":"209 Don't Stop Or We'll Die, Howard Kremer","link":"http://www.earwolf.com/episode/the-bisco-boys/","author":"","publishedDate":"Thu, 21 Mar 2013 00:03:51 -0700","contentSnippet":"Who Charteds Howard Dragon Boy Suede Kremer \u0026 fan favorites Paul Rust, Harris Wittels, and Michael Cassady aka Dont Stop or ...","content":"Who Charteds Howard Dragon Boy Suede Kremer \u0026amp; fan favorites Paul Rust, Harris Wittels, and Michael Cassady aka Dont Stop or Well Die are in the studio to jam out in todays very special musical b-b-b-bonus s-s-s-show! Theyll get into what the future h...","categories":[]},{"title":"208 Steven Yeun, Doug Benson, Paul F. Tompkins","link":"http://www.earwolf.com/episode/zombie-candles/","author":"","publishedDate":"Mon, 18 Mar 2013 00:04:53 -0700","contentSnippet":"The Walking Deads Steven Yeun joins the Bang! Bang! universe along with todays co-host/lover of movies Doug Benson! After a ...","content":"The Walking Deads Steven Yeun joins the Bang! Bang! universe along with todays co-host/lover of movies Doug Benson! After a chat about hair in movies/tv, haunted hotels, and what we can expect on the upcoming episodes of The Walking Dead, our old pal...","categories":[]},{"title":"207 LIVE from SXSW 2013 II; Ken Marino, Rob Huebel, Natasha Leggero, Martin Starr, Reggie Watts, James Adomian","link":"http://www.earwolf.com/episode/live-from-sxsw-2013-ii/","author":"","publishedDate":"Thu, 14 Mar 2013 00:03:20 -0700","contentSnippet":"Whats this!? A b-b-b-bonus second episode of Comedy Bang! Bang! recorded live at the South by Southwest Festival! Featuring ...","content":"Whats this!? A b-b-b-bonus second episode of Comedy Bang! Bang! recorded live at the South by Southwest Festival! Featuring co-host Reggie Watts, as well as special guests Ken Marino, Rob Huebel, Natasha Leggero, and Martin Starr of Burning Love. Wha...","categories":[]},{"title":"206 Live from SXSW 2013; Michael Cera, Sarah Silverman, Tim \u0026 Eric, Reggie Watts","link":"http://www.earwolf.com/episode/live-from-sxsw-2013/","author":"","publishedDate":"Mon, 11 Mar 2013 00:04:00 -0700","contentSnippet":"This weeks Comedy Bang Bang was recorded live at the South by Southwest Festival 2013 in Austin, Texas with the stars of Jash! ...","content":"This weeks Comedy Bang Bang was recorded live at the South by Southwest Festival 2013 in Austin, Texas with the stars of Jash! Michael Cera, Sarah Silverman, Tim \u0026amp; Eric, and Reggie Watts join Scott to talk about coming together to form a  comedy coll...","categories":[]},{"title":"205 Anthony Jeselnik, Eugene Mirman, Nathan Fielder, Eugene Cordero","link":"http://www.earwolf.com/episode/titans-of-comedy/","author":"","publishedDate":"Thu, 07 Mar 2013 00:03:56 -0800","contentSnippet":"Its an all star studded show as Anthony Jeselnik, Eugene Mirman, and Nathan Fielder aka the Titans of Comedy stop by for a ...","content":"Its an all star studded show as Anthony Jeselnik, Eugene Mirman, and Nathan Fielder aka the Titans of Comedy stop by for a larger than life episode of Comedy Bang! Bang! They talk about Anthonys new show The Jeselnik Offensive, Nathans new show Natha...","categories":[]},{"title":"204 Zach Galifianakis, Jon Daly, Neil Campbell","link":"http://www.earwolf.com/episode/the-pepper-men/","author":"","publishedDate":"Mon, 04 Mar 2013 00:04:25 -0800","contentSnippet":"Pepper heads rejoice as fan favorites Zach Galifianakis \u0026 Jon Daly join us to talk about their Red Hot Chili Peppers fan club ...","content":"Pepper heads rejoice as fan favorites Zach Galifianakis \u0026amp; Jon Daly join us to talk about their Red Hot Chili Peppers fan club on todays Comedy Bang Bang! We get to hear about their podcast devoted to the Chili Peps, the awesome theme song that they s...","categories":[]},{"title":"203 \"Weird Al\" Yankovic, Paul F. Tompkins","link":"http://www.earwolf.com/episode/the-vicar-of-yanks/","author":"","publishedDate":"Mon, 25 Feb 2013 00:04:26 -0800","contentSnippet":"Two immense stars from the world of music, Weird Al Yankovic \u0026 Lord Andrew Lloyd Webber are on todays Comedy Bean Bag! After ...","content":"Two immense stars from the world of music, Weird Al Yankovic \u0026amp; Lord Andrew Lloyd Webber are on todays Comedy Bean Bag! After chatting with Lord Andrew Lloyd Webber about English accents, the Little Prince, and nautical bed bugs, the Vicar of Yanks hi...","categories":[]},{"title":"202 Nick Thune, James Adomian, Lauren Lapkus","link":"http://www.earwolf.com/episode/philip-traumatic-seymour-disorder/","author":"","publishedDate":"Thu, 21 Feb 2013 00:03:10 -0800","contentSnippet":"Oscar season is upon us so who better to join us than Oscar-nominated actor Philip Seymour Hoffman and fan favorite Nick Thune ...","content":"Oscar season is upon us so who better to join us than Oscar-nominated actor Philip Seymour Hoffman and fan favorite Nick Thune on this weeks bonus episode of Comedy Bang Bang! Philip gives us a preview of his upcoming Orson Welles project right befor...","categories":[]},{"title":"201 Jon Glaser, Matt Besser","link":"http://www.earwolf.com/episode/end-scene/","author":"","publishedDate":"Mon, 18 Feb 2013 00:04:30 -0800","contentSnippet":"First timer Jon Glaser and past guest Pope Benedict XVI join us to talk finales on todays Comedy Bang Bang! Jon gives a taste ...","content":"First timer Jon Glaser and past guest Pope Benedict XVI join us to talk finales on todays Comedy Bang Bang! Jon gives a taste of what we can expect on the Delocated series finale and where his role on Parks and Recreation might possibly lead. Pope Be...","categories":[]},{"title":"200 Jason Mantzoukas, Andy Daly","link":"http://www.earwolf.com/episode/halfway-to-china/","author":"","publishedDate":"Mon, 11 Feb 2013 00:04:52 -0800","contentSnippet":"Happy 200th episode of Comedy Bang Bang! Take a break from reading the funny papers and tune in as Jason Mantzoukas joins Scott ...","content":"Happy 200th episode of Comedy Bang Bang! Take a break from reading the funny papers and tune in as Jason Mantzoukas joins Scott to talk about his role on Enlightened, movie theater handies, and anything else in the news. Old friend Don Dimello sends...","categories":[]},{"title":"199 Gillian Jacobs, Paul F. Tompkins","link":"http://www.earwolf.com/episode/garry-unmarried/","author":"","publishedDate":"Wed, 06 Feb 2013 00:04:10 -0800","contentSnippet":"Old pals Gillian Jacobs and Garry Marshall return to give us an update on their relationship on todays Comedy Bing Bong! Want ...","content":"Old pals Gillian Jacobs and Garry Marshall return to give us an update on their relationship on todays Comedy Bing Bong! Want to know what went wrong in their marriage? How about the truth behind Garrys deceased wife Barbara? Will there be enough cur...","categories":[]},{"title":"198 Jeffrey Ross, Ron Sexsmith, Amy Phillips, Neil Campbell","link":"http://www.earwolf.com/episode/arent-you-glad/","author":"","publishedDate":"Mon, 04 Feb 2013 00:04:29 -0800","contentSnippet":"Arent you glad that the Roastmaster General Jeffrey Ross and Canadian singer-songwriter Ron Sexsmith are making their Comedy ...","content":"Arent you glad that the Roastmaster General Jeffrey Ross and Canadian singer-songwriter Ron Sexsmith are making their Comedy Bang Bang debut!? Thats not all, Sarah Silverman joins us to sing some of her telegrams and author Cam Billmoth reads an exce...","categories":[]},{"title":"197 Tim Heidecker, Paul Rust, Jon Daly","link":"http://www.earwolf.com/episode/please-claire-ify/","author":"","publishedDate":"Mon, 28 Jan 2013 00:04:38 -0800","contentSnippet":"Tim Heidecker is here to tell us about his new venture as Vice President of Alternative Merchandising for The Who on this weeks ...","content":"Tim Heidecker is here to tell us about his new venture as Vice President of Alternative Merchandising for The Who on this weeks Comedy Bang Bang! Paul Rust is our cheesed off co-host who helps Scott demystify some American myths and brings in some br...","categories":[]},{"title":"196 Jeff Garlin, James Adomian","link":"http://www.earwolf.com/episode/a-different-huelliverse/","author":"","publishedDate":"Thu, 24 Jan 2013 00:03:30 -0800","contentSnippet":"Jeff Garlin is back on todays special Thursday episode of Comedy Bang Bang! Jeff explains why sarcasm is easiest thing to do in ...","content":"Jeff Garlin is back on todays special Thursday episode of Comedy Bang Bang! Jeff explains why sarcasm is easiest thing to do in comedy, does some of his favorite impressions, and tells us about his new podcast  By The Way, In Conversation with Jeff G...","categories":[]},{"title":"195 Billy Eichner, Reggie Watts, Matt Besser","link":"http://www.earwolf.com/episode/making-the-snow-angel/","author":"","publishedDate":"Mon, 21 Jan 2013 00:04:59 -0800","contentSnippet":"Out of the street and into the studio, Billy Eichner of Funny or Dies Billy on the Street is on todays Comedy Bang Bang! Billy ...","content":"Out of the street and into the studio, Billy Eichner of Funny or Dies Billy on the Street is on todays Comedy Bang Bang! Billy shares his take on George Carlins Stuff routine, explains where the idea for his show came about, and tells us about meetin...","categories":[]},{"title":"194 Nick Kroll, Chelsea Peretti","link":"http://www.earwolf.com/episode/me-gusta-characters/","author":"","publishedDate":"Mon, 14 Jan 2013 00:04:54 -0800","contentSnippet":"Friends of the show, Nick Kroll and Chelsea Peretti are here for a character filled episode of Comedy Bang Bang! Chelsea tells ...","content":"Friends of the show, Nick Kroll and Chelsea Peretti are here for a character filled episode of Comedy Bang Bang! Chelsea tells us about her recent nauseating airplane experience and Nick quickly lets us know what to expect on the upcoming Kroll Show...","categories":[]},{"title":"193 Kristen Schaal, Neil Campbell, Pamela Murphy","link":"http://www.earwolf.com/episode/what-else-what-else/","author":"","publishedDate":"Thu, 10 Jan 2013 00:03:38 -0800","contentSnippet":"Kristen Schaal makes her first in-studio appearance on todays special Thursday episode of Comedy Bang Bang! Kristen schools ...","content":"Kristen Schaal makes her first in-studio appearance on todays special Thursday episode of Comedy Bang Bang! Kristen schools co-host Nancy Cooper on rare pennies, microphone techniques, and invites her to Los Angeles for a 24 hour comedy training expe...","categories":[]},{"title":"192 Ben Schwartz, Horatio Sanz","link":"http://www.earwolf.com/episode/goodfelines/","author":"","publishedDate":"Mon, 07 Jan 2013 00:04:11 -0800","contentSnippet":"Fan favorite and House of Pies star Ben Schwartz tells us about his plans for the new year on todays Comedy Bang Bang! Ben \u0026 ...","content":"Fan favorite and House of Pies star Ben Schwartz tells us about his plans for the new year on todays Comedy Bang Bang! Ben \u0026amp; Scott recall performing together in Bens improv show Snowpants, recreate Bens favorite Bane sketch, and talk about wet dreams...","categories":[]},{"title":"Best of 2012 Pt 2","link":"http://www.earwolf.com/episode/best-of-2012-pt-2/","author":"","publishedDate":"Mon, 31 Dec 2012 00:04:57 -0800","contentSnippet":"Wait no longer as the conclusion of the Comedy Bang Bang Best of 2012 is here! Were counting down the top five episodes as ...","content":"Wait no longer as the conclusion of the Comedy Bang Bang Best of 2012 is here! Were counting down the top five episodes as chosen by the listeners and of course more special b-b-b-bonus clips. Join Scott Aukerman and Paul F. Tompkins to see which epi...","categories":[]},{"title":"Best of 2012 Pt 1","link":"http://www.earwolf.com/episode/best-of-2012-pt-1/","author":"","publishedDate":"Mon, 24 Dec 2012 00:04:24 -0800","contentSnippet":"Another year has flown by, so what better way to celebrate than to revisit some of the best Comedy Bang Bang moments that YOU ...","content":"Another year has flown by, so what better way to celebrate than to revisit some of the best Comedy Bang Bang moments that YOU voted for! Special guest Paul F. Tompkins makes a rare appearance as he helps Scott Aukerman countdown numbers ten through s...","categories":[]},{"title":"2012 Holiday Spectacular","link":"http://www.earwolf.com/episode/2012-holiday-spectacular/","author":"","publishedDate":"Tue, 18 Dec 2012 00:11:27 -0800","contentSnippet":"Its that time of year where you try to not get burned when roasting chestnuts over an open fire and have the whole family ...","content":"Its that time of year where you try to not get burned when roasting chestnuts over an open fire and have the whole family gather round the ol computer for a special holiday podcast treat! Scott welcomes fan favorite Harris Wittels as he tells us abou...","categories":[]},{"title":"190 Demetri Martin, James Adomian, Pamela Murphy","link":"http://www.earwolf.com/episode/you-know-what-i-mean/","author":"","publishedDate":"Mon, 10 Dec 2012 00:04:15 -0800","contentSnippet":"Did you ever notice that Demetri Martin has never been on Comedy Bang Bang? Well Demetri is here in studio to tell us about ...","content":"Did you ever notice that Demetri Martin has never been on Comedy Bang Bang? Well Demetri is here in studio to tell us about growing up in the Jersey Shore, gift giving, and how he celebrates the holidays. Dont you hate it when the ghost of Orson Well...","categories":[]},{"title":"189 Chris Fairbanks, Paul F. Tompkins","link":"http://www.earwolf.com/episode/the-pancake-man/","author":"","publishedDate":"Mon, 03 Dec 2012 00:04:09 -0800","contentSnippet":"One of our favorite film directors Werner Herzog and one of Americas favorite comedians Chris Fairbanks are here on todays ...","content":"One of our favorite film directors Werner Herzog and one of Americas favorite comedians Chris Fairbanks are here on todays Comedy Bang Bang! Werner lets us know about his upcoming acting debut and Chris reveals the truth behind pancakes and flapjacks...","categories":[]},{"title":"188 Judd Apatow, Graham Parker, Jessica St. Clair","link":"http://www.earwolf.com/episode/attack-of-the-shits/","author":"","publishedDate":"Mon, 26 Nov 2012 00:04:32 -0800","contentSnippet":"Comedy Maestro Judd Apatow is here for his very first appearance on Comedy Bang Bang! 16 Year-Old Intern Marissa Wompler joins ...","content":"Comedy Maestro Judd Apatow is here for his very first appearance on Comedy Bang Bang! 16 Year-Old Intern Marissa Wompler joins us as well for a discussion about inviting herself over Judds for a sleepover with his daughter Maude, his new film This Is...","categories":[]},{"title":"187 Nat Faxon, Lennon Parham","link":"http://www.earwolf.com/episode/finger-chimes/","author":"","publishedDate":"Mon, 19 Nov 2012 00:03:08 -0800","contentSnippet":"Academy Award-winner Nat Faxon reveals his most secret pain on todays Comedy Bang Bang! Special co-host/DJ Forsythia drops by ...","content":"Academy Award-winner Nat Faxon reveals his most secret pain on todays Comedy Bang Bang! Special co-host/DJ Forsythia drops by to bring up listenership to her late night radio show, lifts spirits by playing some of her favorite songs, and tells us abo...","categories":[]},{"title":"186 Paul F. Tompkins, Julie Klausner, Jake Fogelnest","link":"http://www.earwolf.com/episode/new-york-mainstays/","author":"","publishedDate":"Mon, 12 Nov 2012 00:03:29 -0800","contentSnippet":"Fellow podcasters and first timers Julie Klausner and Jake Fogelnest are here on todays Comedy Bang Bang! Jake \u0026 Julie recall ...","content":"Fellow podcasters and first timers Julie Klausner and Jake Fogelnest are here on todays Comedy Bang Bang! Jake \u0026amp; Julie recall the first time they met, each describe their podcasts The Fogelnest Files and How Was Your Week respectively, and share thei...","categories":[]},{"title":"185 Chris Hardwick, Ike Barinholtz","link":"http://www.earwolf.com/episode/cum-scanners/","author":"","publishedDate":"Wed, 07 Nov 2012 00:02:11 -0800","contentSnippet":"Every once in a while a bro might want to come hang out so who better to stop by than the Nerdist himself Chris Hardwick on ...","content":"Every once in a while a bro might want to come hang out so who better to stop by than the Nerdist himself Chris Hardwick on todays special mid-week episode of Comedy Bang Bang! Chris tells us about his upcoming Comedy Central special Mandroid, explai...","categories":[]},{"title":"184 Aziz Ansari, Bob Odenkirk, Neil Campbell, Mike Hanford, James Adomian","link":"http://www.earwolf.com/episode/pop-and-politics/","author":"","publishedDate":"Mon, 05 Nov 2012 00:02:36 -0800","contentSnippet":"Parks and Recreations Aziz Ansari returns for todays special election episode of Comedy Bang Bang! Aziz talks about the ...","content":"Parks and Recreations Aziz Ansari returns for todays special election episode of Comedy Bang Bang! Aziz talks about the inspiration behind his tour Buried Alive, the cast on Parks \u0026amp; Rec, and being scared of Gout. Bob Odenkirk, Mike Hanford, and Neil...","categories":[]},{"title":"183 Halloween, Brett Gelman, Jon Daly, Allan McLeod, James Adomian","link":"http://www.earwolf.com/episode/return-to-suicide-house/","author":"","publishedDate":"Mon, 29 Oct 2012 00:02:56 -0700","contentSnippet":"It looks like Scott Achingman has stumbled upon the Werewolf Studios once more to find himself inside of Suicide House with ...","content":"It looks like Scott Achingman has stumbled upon the Werewolf Studios once more to find himself inside of Suicide House with none other than the dreadful Beuford and Messmore le Barron. After some catching up, they are joined by Caine Sherman of the H...","categories":[]},{"title":"182 Tim Heidecker, Joe Wengert, Lauren Lapkus","link":"http://www.earwolf.com/episode/repeat-your-keyword/","author":"","publishedDate":"Wed, 24 Oct 2012 00:02:20 -0700","contentSnippet":"Its more Bang Bang for your buck buck on todays special Wednesday episode of Comedy Bang Bang! Friend of the show and star of ...","content":"Its more Bang Bang for your buck buck on todays special Wednesday episode of Comedy Bang Bang! Friend of the show and star of the upcoming film The Comedy, Tim Heidecker returns to tell us about the failed pilot of his popular comic strip Stitches, g...","categories":[]},{"title":"181 Casey Wilson, Adam Pally","link":"http://www.earwolf.com/episode/happy-endings/","author":"","publishedDate":"Mon, 22 Oct 2012 00:02:38 -0700","contentSnippet":"Two cast members from the hit ABC show Happy Endings, Casey Wilson and Adam Pally came to play on this weeks Comedy Bang Bang! ...","content":"Two cast members from the hit ABC show Happy Endings, Casey Wilson and Adam Pally came to play on this weeks Comedy Bang Bang! Adam \u0026amp; Casey share stories of their parents, talk couples Halloween costumes, and give us a little taste of what to expect...","categories":[]},{"title":"180 Gillian Jacobs, Paul F. Tompkins, Lauren Lapkus","link":"http://www.earwolf.com/episode/friends-without-words/","author":"","publishedDate":"Mon, 15 Oct 2012 00:03:11 -0700","contentSnippet":"Communitys Gillian Jacobs returns to bury the hatchet with Scott on todays Comedy Bang Bang! Gillian brings awareness to the ...","content":"Communitys Gillian Jacobs returns to bury the hatchet with Scott on todays Comedy Bang Bang! Gillian brings awareness to the fact that the Zynga corporation is out to get her and wedding bells are heard when she falls for co-host Garry Marshall. Also...","categories":[]},{"title":"179 Adam DeVine, Paul Scheer, Kay Cannon, Hana Mae Lee","link":"http://www.earwolf.com/episode/pitch-slapped/","author":"","publishedDate":"Mon, 08 Oct 2012 00:03:23 -0700","contentSnippet":"Were devoting todays very special episode of Comedy Bang Bang to the movie Pitch Perfect! Writer of the film Kay Cannon and ...","content":"Were devoting todays very special episode of Comedy Bang Bang to the movie Pitch Perfect! Writer of the film Kay Cannon and stars Adam DeVine \u0026amp; Hana Mae Lee join us to discuss pool scenes, target demographics, and which songs were sung for the auditi...","categories":[]},{"title":"178 Rob Corddry, Jessica St. Clair","link":"http://www.earwolf.com/episode/motor-boating-around-town/","author":"","publishedDate":"Mon, 01 Oct 2012 00:00:22 -0700","contentSnippet":"School's back in session so it was only a matter of time before our 16 year-old intern Marissa Wompler made her way back to the ...","content":"School's back in session so it was only a matter of time before our 16 year-old intern Marissa Wompler made her way back to the studio to help co-host todays Comedy Bang Bang! Marissa gets schooled on Grimace, The Fat Boys and motor boating by none o...","categories":[]},{"title":"177 B.J. Novak, Wyatt Cenac, Keegan-Michael Key, Jordan Peele","link":"http://www.earwolf.com/episode/penises-abounding/","author":"","publishedDate":"Mon, 24 Sep 2012 00:01:18 -0700","contentSnippet":"A star studded panel of guests who havent been on the show due to geographical reasons, B.J. Novak and Wyatt Cenac join us for ...","content":"A star studded panel of guests who havent been on the show due to geographical reasons, B.J. Novak and Wyatt Cenac join us for todays Comedy Bang Bang! We talk to B.J. about leaving The Office and Wyatt Cenac tells us what is coming up on The Daily S...","categories":[]},{"title":"176 Amy Poehler, Jason Mantzoukas, James Adomian","link":"http://www.earwolf.com/episode/out-of-bleeps/","author":"","publishedDate":"Mon, 17 Sep 2012 00:01:43 -0700","contentSnippet":"The funniest person in the universe, Amy Poehler, reveals which foreign show that Parks and Recreation is based on this week on ...","content":"The funniest person in the universe, Amy Poehler, reveals which foreign show that Parks and Recreation is based on this week on Comedy Bang Bang! Fan favorite Jason Mantzoukas uses his co-hosting duties to help countdown the Twelve Days of the Emmys,...","categories":[]},{"title":"175 Justin Kirk, Paul F. Tompkins","link":"http://www.earwolf.com/episode/mop-water/","author":"","publishedDate":"Mon, 10 Sep 2012 00:01:01 -0700","contentSnippet":"The Fall Season is upon us and who better to join us other than star of stage and screen Justin Kirk! Justin stops by to talk ...","content":"The Fall Season is upon us and who better to join us other than star of stage and screen Justin Kirk! Justin stops by to talk about his new show Animal Practice, working on Angels in America, and his first role in the theatre. We are also joined by t...","categories":[]},{"title":"174 Lizzy Caplan, John Mulaney, Nick Kroll","link":"http://www.earwolf.com/episode/series-regulars/","author":"","publishedDate":"Mon, 03 Sep 2012 00:00:11 -0700","contentSnippet":"Oh, hello Comedy Bang Bang listeners. First time guest Lizzy Caplan joins us this week with return guests John Mulaney and Nick ...","content":"Oh, hello Comedy Bang Bang listeners. First time guest Lizzy Caplan joins us this week with return guests John Mulaney and Nick Kroll! They discuss Lizzys new film The Bachelorette, more info on the Party Down movie, and LL Cool Jason Alexander. Seri...","categories":[]},{"title":"173 Paul F. Tompkins, Paul Scheer, Brent Weinbach","link":"http://www.earwolf.com/episode/ride-like-hell/","author":"","publishedDate":"Mon, 27 Aug 2012 00:00:22 -0700","contentSnippet":"This weeks Comedy Bang Bang is a special co-host edition with none other than Werner Herzog! Were also treated to the R\u0026B ...","content":"This weeks Comedy Bang Bang is a special co-host edition with none other than Werner Herzog! Were also treated to the R\u0026amp;B stylings of the crowd pleasing Brent Weinbach! Thats not all, producer Scott Jeffries drops by to help keep the show on track an...","categories":[]},{"title":"172 Todd Glass, Brian Huskey","link":"http://www.earwolf.com/episode/this-is-a-safe-zone/","author":"","publishedDate":"Mon, 20 Aug 2012 00:01:18 -0700","contentSnippet":"Scott is back from the Comedy Bang! Bang! tour and brings one of the best guests you can get on a show, Todd Glass! Todd joins ...","content":"Scott is back from the Comedy Bang! Bang! tour and brings one of the best guests you can get on a show, Todd Glass! Todd joins us with his own jingle, shares how he took a bit too many pot cookies, and discusses his stance on spanking jokes. Plus, we...","categories":[]},{"title":"171 Megan Mullally, Nick Kroll, Stephanie Hunt","link":"http://www.earwolf.com/episode/scrog-secretions/","author":"","publishedDate":"Mon, 13 Aug 2012 00:00:40 -0700","contentSnippet":"Todays episode of Comedy Bang Bang is an episode of firsts! Childrens Hospitals Megan Mullally makes her first appearance on ...","content":"Todays episode of Comedy Bang Bang is an episode of firsts! Childrens Hospitals Megan Mullally makes her first appearance on the program to talk Emmy nominations, the Party Down movie, and her musical group Nancy and Beth. The other half of Nancy and...","categories":[]},{"title":"170 Martin Starr, Lennon Parham, Neil Campbell","link":"http://www.earwolf.com/episode/new-scoop/","author":"","publishedDate":"Mon, 06 Aug 2012 00:01:50 -0700","contentSnippet":"Word on the street is that Martin Starr of Freaks and Geeks, Party Down, and NTSF:SD:SUV:: is a first time guest on this weeks ...","content":"Word on the street is that Martin Starr of Freaks and Geeks, Party Down, and NTSF:SD:SUV:: is a first time guest on this weeks Comedy Bang Bang! You didnt hear it from me but Martin joins Scott for a text session with David Caruso, to showcase his re...","categories":[]},{"title":"169 Jay Chandrasekhar, Paul F. Tompkins","link":"http://www.earwolf.com/episode/immortal-mustache/","author":"","publishedDate":"Mon, 30 Jul 2012 00:00:06 -0700","contentSnippet":"The owner of one of the five one-way tickets used to board the Rocket Ship to Fame, Broken Lizards Jay Chandrasekhar makes his ...","content":"The owner of one of the five one-way tickets used to board the Rocket Ship to Fame, Broken Lizards Jay Chandrasekhar makes his first appearance! He talks about his early sketch days, the importance of mustaches, how Super Troopers almost never existe...","categories":[]},{"title":"168 Bob Odenkirk, Matt Besser","link":"http://www.earwolf.com/episode/breaking-bread/","author":"","publishedDate":"Mon, 23 Jul 2012 00:00:22 -0700","contentSnippet":"Today's episode of Comedy Bang Bang will bring you revelations from two of the most famous and powerful men in the world. ...","content":"Today's episode of Comedy Bang Bang will bring you revelations from two of the most famous and powerful men in the world. That's maybe an overstatement, but if you're a fan of Mr. Show or Breaking Bad than you'll be hanging onto every word as Bob Ode...","categories":[]},{"title":"167 Jessica St. Clair, Paul Rust, Jerrod Carmichael","link":"http://www.earwolf.com/episode/new-no-nos/","author":"","publishedDate":"Mon, 16 Jul 2012 00:00:46 -0700","contentSnippet":"Intern Marissa Wompler, fear-based comic Jerrod Carmichael, and controversial comedian Paul Rust join Scott in a riveting ...","content":"Intern Marissa Wompler, fear-based comic Jerrod Carmichael, and controversial comedian Paul Rust join Scott in a riveting discussion of penis pencils, politics, and a game of Would You Rather. New No-No: If youre going to listen to this podcast, then...","categories":[]},{"title":"166 Adam Scott, Harris Wittels, Chelsea Peretti","link":"http://www.earwolf.com/episode/farts-and-procreation-2/","author":"","publishedDate":"Mon, 09 Jul 2012 00:01:31 -0700","contentSnippet":"Last year, an episode of Comedy Bang Bang was made that, to put it simply, changed the world. Nearly a year later, can the ...","content":"Last year, an episode of Comedy Bang Bang was made that, to put it simply, changed the world. Nearly a year later, can the magic bereplicated? We've brought back Harris Wittels, Adam Scott, andChelsea Peretti, and they're here for more songs, charact...","categories":[]},{"title":"165 Andy Kindler, Loudon Wainwright III, Amy Phillips","link":"http://www.earwolf.com/episode/hoo-ah/","author":"","publishedDate":"Mon, 02 Jul 2012 00:00:34 -0700","contentSnippet":"Need a cleansing experience, in addition to your 8-to-12-week smoothie diet? This week's show has everything you need to purge ...","content":"Need a cleansing experience, in addition to your 8-to-12-week smoothie diet? This week's show has everything you need to purge the soul. Andy Kindler trots out his Jay Leno and Al Pacino impersonations, Loudon Wainwright III performs several songs of...","categories":[]},{"title":"164 Tony Clifton, Ben Schwartz","link":"http://www.earwolf.com/episode/clifton-was-here/","author":"","publishedDate":"Mon, 25 Jun 2012 00:01:23 -0700","contentSnippet":"International Singing Sensation Tony Clifton, joined by Cliftonettes Maxim and Phoenix, tells exclusive stories about Andy ...","content":"International Singing Sensation Tony Clifton, joined by Cliftonettes Maxim and Phoenix, tells exclusive stories about Andy Kaufman, Jim Carrey, and Nicolas Cage, as well as cracking some off-color jokes. Plus, \"House of Pies\" star Ben Schwartz compet...","categories":[]},{"title":"163 Ken Marino, Steve Agee, Janet Varney, Deanna Russo","link":"http://www.earwolf.com/episode/burning-love/","author":"","publishedDate":"Mon, 18 Jun 2012 00:01:12 -0700","contentSnippet":"Today's audio sound recording of Comedy Bang Bang is the perfect companion to everyone's favorite reality show, Burning Love! ...","content":"Today's audio sound recording of Comedy Bang Bang is the perfect companion to everyone's favorite reality show, Burning Love! Mark Orlando and two of his lovely lady suitors, Carly and Tamara G, are joining Scott to answer the tough questions: Can a...","categories":[]},{"title":"162 Andy Samberg, Adam Pally","link":"http://www.earwolf.com/episode/best-bro-hang/","author":"","publishedDate":"Mon, 11 Jun 2012 00:00:20 -0700","contentSnippet":"The bros are back in town! Andy Samberg, whose film That's My Boy opens this weekend, and Scott's weed dealer Bro have ...","content":"The bros are back in town! Andy Samberg, whose film That's My Boy opens this weekend, and Scott's weed dealer Bro have reunited, and this time they have a good rapport (unless you were to ask Bro about it). The boys talk Hangin' with Mr. Cooper, Bro'...","categories":[]},{"title":"161 Reggie Watts,Tim Heidecker,Andy Daly,Jon Daly","link":"http://www.earwolf.com/episode/highly-illogical/","author":"","publishedDate":"Mon, 04 Jun 2012 00:01:51 -0700","contentSnippet":"Comedy Bang! Bang! on IFC has been a long time coming and in less than a week you'll be able to catch the premiere! To ease the ...","content":"Comedy Bang! Bang! on IFC has been a long time coming and in less than a week you'll be able to catch the premiere! To ease the pain of the wait, we're bringing you a full week of Earwolf podcasts heralding the show's arrival. I know it's highly illo...","categories":[]},{"title":"160 Sarah Silverman,Kyle Dunnigan","link":"http://www.earwolf.com/episode/slow-dance-boner/","author":"","publishedDate":"Mon, 28 May 2012 00:00:00 -0700","contentSnippet":"This week we dive into the personal lives of comedy power couple Sarah Silverman and Kyle Dunnigan. A new game, Shorts or ...","content":"This week we dive into the personal lives of comedy power couple Sarah Silverman and Kyle Dunnigan. A new game, Shorts or Jeans, is played, and we're visited by two strange guests. Check out the  Comedy Bang Bang on IFC website  to watch a full episo...","categories":[]},{"title":"159 Alison Brie,Jason Mantzoukas,Saul Goodman","link":"http://www.earwolf.com/episode/apicklelypse/","author":"","publishedDate":"Mon, 21 May 2012 00:05:35 -0700","contentSnippet":"Alison Brie and Jason Mantzoukas both costar in critically acclaimed movies and television shows...but a PODCAST? I know it ...","content":"Alison Brie and Jason Mantzoukas both costar in critically acclaimed movies and television shows...but a PODCAST? I know it seems unlikely, but they are in the Earwolf studio to tell the untold story of Rizzoli \u0026amp; Isles and see if they can\u0026#39;t find love...","categories":[]},{"title":"158 Jordan Peele,Gillian Jacobs","link":"http://www.earwolf.com/episode/words-with-friends/","author":"","publishedDate":"Mon, 14 May 2012 00:01:55 -0700","contentSnippet":"If you like television, you'll love this week's episode of Comedy Bang Bang! From the newly renewed NBC comedy Community, ...","content":"If you like television, you'll love this week's episode of Comedy Bang Bang! From the newly renewed NBC comedy Community, Gillian Jacobs is here to seek forgiveness for her iPhoneindiscretionsand give us just a taste of how she got her big television...","categories":[]},{"title":"157 Bobcat Goldthwait,Paul F Tompkins","link":"http://www.earwolf.com/episode/god-bless-america/","author":"","publishedDate":"Mon, 07 May 2012 00:00:49 -0700","contentSnippet":"You love Bobcat Goldthwait for his stand-up comedy, his performance of Zed in Police Academy, and as the director of movies ...","content":"You love Bobcat Goldthwait for his stand-up comedy, his performance of Zed in Police Academy, and as the director of movies like Shakes the Clown and World's Greatest Dad. You're about to fall in love with him for his showbiz secrets and his prowess...","categories":[]},{"title":"156 3rd Anniversary,Zach Galifianakis,St. Vincent,Special Guests","link":"http://www.earwolf.com/episode/anniversary-party/","author":"","publishedDate":"Mon, 30 Apr 2012 00:00:12 -0700","contentSnippet":"What do you need to throw the perfect anniversary party? You need some tunes, you need some bros, and if you're Comedy Bang ...","content":"What do you need to throw the perfect anniversary party? You need some tunes, you need some bros, and if you're Comedy Bang Bang you need some celebrity guests! Put on your party hats and boogie shoes for an hour and a half of Zach Galifianakis, Harr...","categories":[]},{"title":"155 Patton Oswalt,Chris Tallman","link":"http://www.earwolf.com/episode/fingerbang-lindbergh/","author":"","publishedDate":"Mon, 23 Apr 2012 00:05:53 -0700","contentSnippet":"Are you ready for the final episode of the third year of Comedy Bang Bang? What do you want more than anything from this ...","content":"Are you ready for the final episode of the third year of Comedy Bang Bang? What do you want more than anything from this episode of Comedy Bang Bang? To finally get that one-on-one exclusive interview with Patton Oswalt we keep trying to give you? Yo...","categories":[]},{"title":"154 Lennon Parham,Jessica St. Clair","link":"http://www.earwolf.com/episode/finger-guns/","author":"","publishedDate":"Mon, 16 Apr 2012 00:02:21 -0700","contentSnippet":"With the Spring 2012 semester coming to a close, we are contractually obligated to have our 15 year-old intern Marissa Wompler ...","content":"With the Spring 2012 semester coming to a close, we are contractually obligated to have our 15 year-old intern Marissa Wompler visit. I cannot reiterate how much this is not our choice, especially now that she's accompanied by her faculty mentor Miss...","categories":[]},{"title":"153 Will Forte,Leo Allen","link":"http://www.earwolf.com/episode/jing-it-or-ding-it/","author":"","publishedDate":"Thu, 12 Apr 2012 00:02:30 -0700","contentSnippet":"We're back again with more previously unreleased Comedy Bang Bang hilarity. This time first time guests Leo Allen and Will ...","content":"We're back again with more previously unreleased Comedy Bang Bang hilarity. This time first time guests Leo Allen and Will Forte remember some of their favorite rejected SNL pitches, discuss the tragedy of divorce, and try their hand at a brand new g...","categories":[]},{"title":"152 Ed Helms,Seth Morris","link":"http://www.earwolf.com/episode/behind-the-irony-curtain/","author":"","publishedDate":"Mon, 09 Apr 2012 00:01:28 -0700","contentSnippet":"This week we're giving you Comedy Bang Bang listeners a little treat: Two previously unreleased episodes with some ...","content":"This week we're giving you Comedy Bang Bang listeners a little treat: Two previously unreleased episodes with some behind-the-curtain commentary courtesy of Scott Aukerman. Today's episode features Seth Morris in the role he was born to play: Himself...","categories":[]},{"title":"151 Fred Savage,Jackie Clarke,Gil Ozeri","link":"http://www.earwolf.com/episode/fan-fiction/","author":"","publishedDate":"Mon, 02 Apr 2012 00:02:11 -0700","contentSnippet":"What would you do if I sang out of tune? I'd tell you to shut up because we have actor and director Fred Savage on the show and ...","content":"What would you do if I sang out of tune? I'd tell you to shut up because we have actor and director Fred Savage on the show and he's giving us secrets and scoops from the set of The Wonder Years as well as NBC's Best Friends Forever, which he directe...","categories":[]},{"title":"150 Bobby Moynihan,Paul F. Tompkins","link":"http://www.earwolf.com/episode/time-bobby/","author":"","publishedDate":"Mon, 26 Mar 2012 00:01:47 -0700","contentSnippet":"It's a tale as old as time: A precocious orphan with a heart of gold and a love for musical theater meets a living legend of ...","content":"It's a tale as old as time: A precocious orphan with a heart of gold and a love for musical theater meets a living legend of Broadway. Such is the story of Fourvel and Lord Andrew Lloyd Webber, an unlikely pair who met during today's Comedy Bang Bang...","categories":[]},{"title":"149 Live At SXSW,Tim Heidecker,James Adomian,Seth Morris,Reggie Watts","link":"http://www.earwolf.com/episode/live-from-sxsw-2012/","author":"","publishedDate":"Mon, 19 Mar 2012 00:01:49 -0700","contentSnippet":"This week's Comedy Bang Bang was recorded live at the South by Southwest Festival 2012 in Austin, Texas. Our guest for the ...","content":"This week's Comedy Bang Bang was recorded live at the South by Southwest Festival 2012 in Austin, Texas. Our guest for the prestigious affair is the one and only Tim Heidecker who shows off his prowess in comedy, music, and headwear. To comment on al...","categories":[]},{"title":"148 Jason Mantzoukas,Andy Daly","link":"http://www.earwolf.com/episode/wipeout/","author":"","publishedDate":"Mon, 12 Mar 2012 00:00:33 -0700","contentSnippet":"Put down your Entertainment Weekly and tune into Comedy Bang Bang! We have Jason Mantzoukas of comedy, film, and cinema fame ...","content":"Put down your Entertainment Weekly and tune into Comedy Bang Bang! We have Jason Mantzoukas of comedy, film, and cinema fame here to count down the Twelve Nights of Oscars and more importantly, try to get through to a friend in need. Also joining us...","categories":[]},{"title":"147 Paul F. Tompkins,Greg Proops,James Adomian","link":"http://www.earwolf.com/episode/raisin-norman-bates/","author":"","publishedDate":"Mon, 05 Mar 2012 00:01:51 -0800","contentSnippet":"You are entering ComedyBang Bang, a magical place not far from Planet Centaur where 40 year-old raptors hail cabs and the ...","content":"You are entering ComedyBang Bang, a magical place not far from Planet Centaur where 40 year-old raptors hail cabs and the object of your affection is alive in your wallet. A place where Ice T and Jesse Ventura can seek tough answers and pitch televis...","categories":[]},{"title":"146 Reggie Watts,Ben Schwartz,Matt Besser","link":"http://www.earwolf.com/episode/climbing-the-ladder/","author":"","publishedDate":"Mon, 27 Feb 2012 00:02:42 -0800","contentSnippet":"Sorry you guys, but we did NOT get Ice Ben Schwartz or Ice Reggie Watts for the podcast this week. You'll have to settle for ...","content":"Sorry you guys, but we did NOT get Ice Ben Schwartz or Ice Reggie Watts for the podcast this week. You'll have to settle for their American doppelgangers who join the world-famous Scottabot and the legendary Bjork for a sexy, funny, sexy, musical, se...","categories":[]},{"title":"145 David Wain,James Adomian","link":"http://www.earwolf.com/episode/a-family-affair/","author":"","publishedDate":"Mon, 20 Feb 2012 00:03:29 -0800","contentSnippet":"We all love David Wain, but do we really KNOW David Wain? This week's Comedy Bang Bang is the only place on the internet to get ...","content":"We all love David Wain, but do we really KNOW David Wain? This week's Comedy Bang Bang is the only place on the internet to get in-depth info about Wain's personal life with the added perspective of his father and four-year-old son. I think we all al...","categories":[]},{"title":"144 Harris Wittels,Paul Rust,Michael Cassady,Don't Stop Or We'll Die","link":"http://www.earwolf.com/episode/clones-and-oliver-stones/","author":"","publishedDate":"Mon, 13 Feb 2012 00:04:13 -0800","contentSnippet":"Don't stop listening to this podcast or you know what will happen! Paul Rust, Harris Wittels, and Michael Cassady from our ...","content":"Don't stop listening to this podcast or you know what will happen! Paul Rust, Harris Wittels, and Michael Cassady from our favorite comedy-pop crossover act Don't Stop or We'll Die are in the studio to jam out some tunes before their matrimonial debu...","categories":[]},{"title":"143 Weird Al Yankovic,Todd Glass,Amy Phillips","link":"http://www.earwolf.com/episode/grammy-spectacular/","author":"","publishedDate":"Mon, 06 Feb 2012 00:02:06 -0800","contentSnippet":"Can I ask you a question? Are you ready for a star studded tribute to the most important Awards Show of the season? This year ...","content":"Can I ask you a question? Are you ready for a star studded tribute to the most important Awards Show of the season? This year Comedy Bang Bang is paying tribute to The Grammys with guests like musical comedy legend \"Weird Al\" Yankovic, brilliant come...","categories":[]},{"title":"142 Tim \u0026 Eric,James Adomian","link":"http://www.earwolf.com/episode/popcorn-com/","author":"","publishedDate":"Mon, 30 Jan 2012 00:02:54 -0800","contentSnippet":"Have you seen Tim \u0026 Eric's Billion Dollar Movie yet? We'll you'll beclamoringto see it after this in-depth interview with the ...","content":"Have you seen Tim \u0026amp; Eric\u0026#39;s Billion Dollar Movie yet? We\u0026#39;ll you\u0026#39;ll beclamoringto see it after this in-depth interview with the titular Tim Heidecker and Eric Wareheim. They reveal all the deets about making a movie for \u0026quot;The Big S\u0026quot; and share with us th...","categories":[]},{"title":"141 Tig Notaro,Ronna \u0026 Beverly","link":"http://www.earwolf.com/episode/ladies-night/","author":"","publishedDate":"Mon, 23 Jan 2012 00:02:49 -0800","contentSnippet":"How about we get some ladies up in the Comedy Bang Bang studio? Tig Notaro has left the Professor Blastoff hatch and is making ...","content":"How about we get some ladies up in the Comedy Bang Bang studio? Tig Notaro has left the Professor Blastoff hatch and is making her triumphant return as Comedy Bang Bang's master impressionist and character actress. In keeping with the theme we've inv...","categories":[]},{"title":"140 Nick Offerman,James Adomian","link":"http://www.earwolf.com/episode/ron-swanson-off/","author":"","publishedDate":"Mon, 16 Jan 2012 00:03:56 -0800","contentSnippet":"I think we have a new best friend and his name isNick Offerman! The ex-con and star of Parks and Recreation makes his Comedy ...","content":"I think we have a new best friend and his name isNick Offerman! The ex-con and star of Parks and Recreation makes his Comedy Bang Bang debut this week and gives all you Parks and Rec die-hards a glimpse into the tear-jerking story of how Ron Swanson...","categories":[]},{"title":"139 Bob Odenkirk,Brian Huskey","link":"http://www.earwolf.com/episode/win-a-farmhouse/","author":"","publishedDate":"Mon, 09 Jan 2012 00:03:27 -0800","contentSnippet":"Today's Comedy Bang Bang is the total insider experience! Do you want sizzling hot entertainment news about your favorite ...","content":"Today's Comedy Bang Bang is the total insider experience! Do you want sizzling hot entertainment news about your favorite podcasts and bands? You'll get it! Are you interested in what it's like to be on the hottest drama on television?Bob Odenkirkwil...","categories":[]},{"title":"138 Andy Richter,Paul F. Tompkins","link":"http://www.earwolf.com/episode/ghost-protocol/","author":"","publishedDate":"Mon, 02 Jan 2012 00:02:49 -0800","contentSnippet":"If you Googled \"A funny podcast to start 2012\" than you're in the right place! And before you go Googling \"Who are the guests?\" ...","content":"If you Googled \"A funny podcast to start 2012\" than you're in the right place! And before you go Googling \"Who are the guests?\" I'll tell you:Andy Richterand Werner Herzog! And instead of using Google to find out if they play Would You Rather?, what...","categories":[]},{"title":"Best of 2011 Pt 2","link":"http://www.earwolf.com/episode/best-of-2011-pt-2/","author":"","publishedDate":"Thu, 29 Dec 2011 00:02:05 -0800","contentSnippet":"And now the thrilling conclusion of the Comedy Bang Bang Best of 2011! We're counting down the top five episodes as chosen by ...","content":"And now the thrilling conclusion of the Comedy Bang Bang Best of 2011! We're counting down the top five episodes as chosen by the listeners and throwing in some of your favorite segments and characters like The New Year Chicken, Vampire Jesus, \"Deaf...","categories":[]},{"title":"Best of 2011 Pt 1","link":"http://www.earwolf.com/episode/best-of-2011-pt-1/","author":"","publishedDate":"Mon, 26 Dec 2011 00:01:33 -0800","contentSnippet":"As the year winds down, let us revisit some of the highlights from Comedy Bang Bang in 2011. Joined by audience favorite Paul ...","content":"As the year winds down, let us revisit some of the highlights from Comedy Bang Bang in 2011. Joined by audience favorite Paul F. Tompkins, Scott Aukerman is counting down numbers ten through six of the viewer selected top episodes of the year. Check...","categories":[]},{"title":"2011 Holiday Spectacular","link":"http://www.earwolf.com/episode/2011-holiday-spectacular/","author":"","publishedDate":"Mon, 19 Dec 2011 00:03:19 -0800","contentSnippet":"It's that time of year again! You've hung up your proverbial podcast stocking and Comedy Bang Bang is here to stuff it full of ...","content":"It's that time of year again! You've hung up your proverbial podcast stocking and Comedy Bang Bang is here to stuff it full of your favorite guests, characters, games, raps, and more! Happy Holidays!","categories":[]},{"title":"135 Paul F. Tompkins,Erinn Hayes,Dan Telfer","link":"http://www.earwolf.com/episode/scavenge-and-the-wisemen/","author":"","publishedDate":"Mon, 12 Dec 2011 00:02:13 -0800","contentSnippet":"We have a lot of fun here on Comedy Bang Bang, but this week we'd like to share an important holiday message with you all. You ...","content":"We have a lot of fun here on Comedy Bang Bang, but this week we'd like to share an important holiday message with you all. You see, the holidays are a time for friendship, giving, forgiveness, cakes, and Would You Rather?! This week is a merry celebr...","categories":[]},{"title":"134 Kevin Nealon,Ben Schwartz,Amy Phillips","link":"http://www.earwolf.com/episode/bride-of-chucky/","author":"","publishedDate":"Mon, 05 Dec 2011 00:05:44 -0800","contentSnippet":"This week's Comedy Bang Bang serves as a forum to learn aboutshow businessfrom some of the industry's biggest names. From Kevin ...","content":"This week's Comedy Bang Bang serves as a forum to learn aboutshow businessfrom some of the industry's biggest names. From Kevin Nealon auditioning for Cheers to Ben Schwartz freelancing for Saturday Night Live, you'll have an earful of exclusive know...","categories":[]},{"title":"133 Patton Oswalt, Chris Tallman","link":"http://www.earwolf.com/episode/fortunately-unfortunately/","author":"","publishedDate":"Mon, 28 Nov 2011 00:04:41 -0800","contentSnippet":"Patton Oswalt is back in the Comedy Bang Bang hot seat! Fortunately, he has a new movie coming out and he's ready to give us ...","content":"Patton Oswalt is back in the Comedy Bang Bang hot seat! Fortunately, he has a new movie coming out and he's ready to give us all sorts of exclusive information. Unfortunately, we still have our open door policy and a gentleman named Leslie Schecter f...","categories":[]},{"title":"132 David Wain,Margret Cho,James Adomian,Grant Lee Phillips","link":"http://www.earwolf.com/episode/occupy-thanksgiving/","author":"","publishedDate":"Mon, 21 Nov 2011 00:02:57 -0800","contentSnippet":"At the intersection of comedy, music, and fashion lies this week's Comedy Bang Bang. Margaret Cho and Grant-Lee Phillips ...","content":"At the intersection of comedy, music, and fashion lies this week's Comedy Bang Bang. Margaret Cho and Grant-Lee Phillips provide the score for the episode in addition to delighting us with tales of the 90s and fun rounds of What Am I Thinking? and Wo...","categories":[]},{"title":"131 Andy Daly,Jason Mantzoukas","link":"http://www.earwolf.com/episode/honorary-mayor-of-hollywood/","author":"","publishedDate":"Mon, 14 Nov 2011 00:03:33 -0800","contentSnippet":"It's sure been a while since Jason Mantzoukas popped in for an episode of Comedy Bang Bang. And I don't know about you, but I ...","content":"It's sure been a while since Jason Mantzoukas popped in for an episode of Comedy Bang Bang. And I don't know about you, but I could really use a good interruption from a total stranger! We get the best of both worlds this week as Scott and Jason are...","categories":[]},{"title":"130 Bobby Moynihan,Jenny Slate,Elizabeth Laime","link":"http://www.earwolf.com/episode/tall-napoleon/","author":"","publishedDate":"Mon, 07 Nov 2011 00:04:12 -0800","contentSnippet":"This is not a prank! We really do have Jenny Slate from SNL and Elizabeth Laime from the Totally Laime Podcast on the show! ...","content":"This is not a prank! We really do have Jenny Slate from SNL and Elizabeth Laime from the Totally Laime Podcast on the show! Joining them is legendary actor Fagin Platt, son of Oliver Platt (the Canadian-American actor currently starring in the Showti...","categories":[]},{"title":"129 Halloween,Brett Gelman,Jon Daly,Allan McCloud,Neil Campbell","link":"http://www.earwolf.com/episode/comedy-fang-fang/","author":"","publishedDate":"Mon, 31 Oct 2011 00:04:38 -0700","contentSnippet":"It seems as though every year around this time something awfully spooky washes over this podcast and takes it in a devilish ...","content":"It seems as though every year around this time something awfully spooky washes over this podcast and takes it in a devilish direction. I'm sorry to say that this year is no different, with guests like the dreadful Beuford and Messmore le Barron of Su...","categories":[]},{"title":"128 Jon Heder,Harris Wittels,Seth Morris","link":"http://www.earwolf.com/episode/coach-coach-coach/","author":"","publishedDate":"Mon, 24 Oct 2011 00:03:57 -0700","contentSnippet":"Boy, what a fun episode of Comedy Bang Bang we have today! Our old friend Harris Wittels is in the studio with a brand new ...","content":"Boy, what a fun episode of Comedy Bang Bang we have today! Our old friend Harris Wittels is in the studio with a brand new edition of Harris' Foam Corner. Our new friend Jon Heder makes a great first impression with an impressive round of Harris' fav...","categories":[]},{"title":"127 Paul Scheer,Nick Swardson,Brody Stevens","link":"http://www.earwolf.com/episode/national-pleasure/","author":"","publishedDate":"Mon, 17 Oct 2011 00:04:37 -0700","contentSnippet":"How many ingredients are in pizza? Can you high five an orangutan? What does the moon do when we're not looking? The answers to ...","content":"How many ingredients are in pizza? Can you high five an orangutan? What does the moon do when we're not looking? The answers to these questions and more can be found in today's Comedy Bang Bang! Nick Swardson finally found his way back to the studio...","categories":[]},{"title":"126 Jon Hamm,Paul F. Tompkins,Nick Lowe","link":"http://www.earwolf.com/episode/suicide-is-painless/","author":"","publishedDate":"Mon, 10 Oct 2011 00:02:48 -0700","contentSnippet":"The leaves are falling, there is a chill in the air, the kids are at school so it's time to curl up with a brand new Comedy ...","content":"The leaves are falling, there is a chill in the air, the kids are at school so it's time to curl up with a brand new Comedy Bang Bang. Our guests are the always charming Jon Hamm, the hugely influential Nick Lowe, and Garry Marshall. Jon teases the n...","categories":[]},{"title":"125 Sarah Silverman,Nick Kroll,Dan Mangan","link":"http://www.earwolf.com/episode/wine-in-the-whirlpool/","author":"","publishedDate":"Mon, 03 Oct 2011 00:03:19 -0700","contentSnippet":"It's been way too long since our good friends Sarah Silverman and Nick Kroll stopped by! They join singer Dan Mangan this week ...","content":"It's been way too long since our good friends Sarah Silverman and Nick Kroll stopped by! They join singer Dan Mangan this week for a \"haha lol\" Comedy Bang Bang complete with surprise appearances from Bobby Bottleservice and Nick's \"Old Lady\" Erma. I...","categories":[]},{"title":"124 Matthew Sweet,Todd Barry,Nick Thune","link":"http://www.earwolf.com/episode/bro-ing-out-pt-deux/","author":"","publishedDate":"Mon, 26 Sep 2011 00:02:38 -0700","contentSnippet":"I don't know about you guys, but I've still got some bro in my system and I gotta get it out! Enter Todd Barry, Nick Thune, and ...","content":"I don't know about you guys, but I've still got some bro in my system and I gotta get it out! Enter Todd Barry, Nick Thune, and Matthew Sweet who join Scott for an hour of songs, games, stories, Hot Topics, and bro time. I mean, what else do you need...","categories":[]},{"title":"123 Amy Poehler,The Bangles,Adam Pally","link":"http://www.earwolf.com/episode/no-scoop-for-you/","author":"","publishedDate":"Mon, 19 Sep 2011 00:05:33 -0700","contentSnippet":"Break the monotony of this Manic Monday with a new Comedy Bang Bang featuring Amy Poehler, The Bangles, and possibly the ...","content":"Break the monotony of this Manic Monday with a new Comedy Bang Bang featuring Amy Poehler, The Bangles, and possibly the biggest guest we've ever had, DavidFiene! Amy and Scott gab about the original UCB pilot and the alternative comedy scene of the...","categories":[]},{"title":"122 Zach Galifianakis,Paul F. Tompkins,Yo La Tengo","link":"http://www.earwolf.com/episode/shanghaied-by-irene/","author":"","publishedDate":"Mon, 12 Sep 2011 00:03:14 -0700","contentSnippet":"Welcome to Comedy Bang Bang! As today is our first day on Funny Or Die, we've pulled out all the stops and brought in some of ...","content":"Welcome to Comedy Bang Bang! As today is our first day on Funny Or Die, we've pulled out all the stops and brought in some of the most talented folks we know. Folks like Zach Galifianakis from The Hangover and Between Two Ferns. Folks like famed film...","categories":[]},{"title":"121 Jimmy Pardo,Paul Rust,Rob Delaney","link":"http://www.earwolf.com/episode/bro-ing-out/","author":"","publishedDate":"Mon, 05 Sep 2011 00:03:08 -0700","contentSnippet":"On a hot summer day, what could be better than chilling out with a bunch of bros? Nothing, that's what! Rob Delaney, Jimmy ...","content":"On a hot summer day, what could be better than chilling out with a bunch of bros? Nothing, that's what! Rob Delaney, Jimmy Pardo, and Paul Rust join Scott for the ultimate Comedy Bang Bang chill sesh. They play some games, chat about some hot topics,...","categories":[]},{"title":"120 Adam Scott,Harris Wittels,Chelsea Peretti","link":"http://www.earwolf.com/episode/farts-and-procreation/","author":"","publishedDate":"Mon, 29 Aug 2011 00:02:02 -0700","contentSnippet":"This week's episode of Comedy Bang Bang is devoted to all the Parks and Recreation fans in the audience. We've jam packed the ...","content":"This week's episode of Comedy Bang Bang is devoted to all the Parks and Recreation fans in the audience. We've jam packed the show with Parks and Rec insiders from Chelsea Peretti to Harris Wittels and even Adam Scott! If you like the unique cast of...","categories":[]},{"title":"119 Gillian Jacobs,Andy Daly","link":"http://www.earwolf.com/episode/andi-callahan-rn/","author":"","publishedDate":"Mon, 22 Aug 2011 00:02:46 -0700","contentSnippet":"They say laughter is the best medicine. If that is the case, take out your IV and put it your earbuds because we have a great ...","content":"They say laughter is the best medicine. If that is the case, take out your IV and put it your earbuds because we have a great new episode of Comedy Bang Bang for you! We have two first time guests: Gillian Jacobs and Andi Callahan. We all know Gillia...","categories":[]},{"title":"118 Patton Oswalt,Eddie Pepitone","link":"http://www.earwolf.com/episode/hologram-toes/","author":"","publishedDate":"Mon, 15 Aug 2011 00:00:50 -0700","contentSnippet":"Since our last episode with Patton Oswalt was so rudely interrupted, we have asked him back on to discuss his upcoming special, ...","content":"Since our last episode with Patton Oswalt was so rudely interrupted, we have asked him back on to discuss his upcoming special, Finest Hour. Unfortunately, in true Comedy Bang Bang fashion we receive an unexpected visit from a stranger so strange I c...","categories":[]},{"title":"117 David Cross,Ruben Fleischer,Chad Carter","link":"http://www.earwolf.com/episode/cant-never-did-nothing/","author":"","publishedDate":"Mon, 08 Aug 2011 00:04:16 -0700","contentSnippet":"This week's Comedy Bang Bang is perfect for all our ambitious listeners looking to make their dreams come true. Hear how ...","content":"This week's Comedy Bang Bang is perfect for all our ambitious listeners looking to make their dreams come true. Hear how director Ruben Fleischer created a career in comedy which has afforded him the chance to meet his idols. Be inspired by Ultimate...","categories":[]},{"title":"116 Todd Glass,Jessica St. Clair","link":"http://www.earwolf.com/episode/when-i-go-to-queens/","author":"","publishedDate":"Mon, 01 Aug 2011 00:01:11 -0700","contentSnippet":"With summer almost over, we knew we had to have Marissa Wompler back on the show before she goes back to school. Womp It Up! ...","content":"With summer almost over, we knew we had to have Marissa Wompler back on the show before she goes back to school. Womp It Up! With her is \"Tough But Fair\" Todd Glass who teaches Marissa how to get started in comedy. Subaru! The episode is chock full o...","categories":[]},{"title":"115 Paul Rudd,David Wain,Ken Marino","link":"http://www.earwolf.com/episode/the-plug-in-drug/","author":"","publishedDate":"Mon, 25 Jul 2011 00:01:27 -0700","contentSnippet":"Paul Rudd freestyle raps in this episode. There is a lot more I could tell you, but that should have sold it. Does he talk with ...","content":"Paul Rudd freestyle raps in this episode. There is a lot more I could tell you, but that should have sold it. Does he talk with David Wain and Ken Marino about Wet Hot American Summer? Yes, of course, but he also freestyle raps. They play What Am I T...","categories":[]},{"title":"114 Edgar Wright,Joe Cornish,Matt Besser","link":"http://www.earwolf.com/episode/hats-off-to-caruso/","author":"","publishedDate":"Mon, 18 Jul 2011 00:02:07 -0700","contentSnippet":"The Earwolf studio is experiencing a British Invasion! They're coming to Attack the Block and we're too Spaced to call the Hot ...","content":"The Earwolf studio is experiencing a British Invasion! They're coming to Attack the Block and we're too Spaced to call the Hot Fuzz. It feels like Earwolf Vs. The World and hopefully we won't end up (Shaun of the) Dead (okay, I'm done now). Joe Corni...","categories":[]},{"title":"113 Bobby Moynihan,Seth Morris","link":"http://www.earwolf.com/episode/skanking-hayride/","author":"","publishedDate":"Mon, 11 Jul 2011 00:02:06 -0700","contentSnippet":"Stars- They're just like us! Bobby Moynihan from Saturday Night Live joins us this week and proves his comedy nerd cred with an ...","content":"Stars- They're just like us! Bobby Moynihan from Saturday Night Live joins us this week and proves his comedy nerd cred with an impressive knowledge of SNL history that will embarrass even the nerdiest of listeners. Our old friend Ozzie Patinkin (no...","categories":[]}]}}, "responseDetails": null, "responseStatus": 200}